


let quran,
        hadith,
        aqida,
        figh,
        tazkia,
        arabic,
        sera,
        tragim,
        coctel;



//--------------------------------------
quran.title[0] = "كيف نفهم القران - لمحمد جميل زينو";
quran.texts[0] = "كيف نفهم القرآن (أنواع التفسير وشرح بعض آي القرآن) - محمد بن جميل زينو ، مطبعة دار المجمع العلمي ، جدة ، ط 6 ، 144 صفحة ، 4 M .";
quran.imgs[0] = "/img/quran/q0.png";
quran.url[0] = "https://ia601308.us.archive.org/20/items/nlpx2/nlpx2.pdf";

//--------------------------------------
quran.title[1] = "معارج الصعود إلى تفسير سورة هود - للشنقيطي";
quran.texts[1] = `معارج الصعود إلى تفسير سورة هود - محمد الأمين بن محمد المختار الجكني الشنقيطي ، كتب عن فضيلة المسفر هذا التفسير تلميذه عبد الله بن أحمد قادري ، دار المجتمع ، جدة ، ط 1 ، 1408 هـ / 1988 م ، 316 ص ، 5 M.`;
quran.imgs[1] = "/img/quran/q1.png";
quran.url[1] = "https://archive.org/download/a1651n/a1651n.pdf";

//--------------------------------------
quran.title[2] = "الإلمام ببعض آيات الأحكام - للعثيمين";
quran.texts[2] = "الإلمام ببعض آيات الأحكام (تفسيراً واستنباطاً) - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 823 صفحة ، 12.8 M .";
quran.imgs[2] = "/img/quran/q2.png";
quran.url[2] = "https://archive.org/download/zoju7/zoju7.pdf";

//--------------------------------------
quran.title[3] = "ايسر التفاسير - للجزائري";
quran.texts[3] = "أيسر التفاسير لكلام العلي الكبير وبهامشه نهير الخير على أيسر التفاسير - أبو بكر جابر الجزائري ، مكتبة العلوم والحكم ، المدينة المنورة ، دار الحديث ، القاهرة ، 1806 صفحة ، (63.5 M) .";
quran.imgs[3] = "/img/quran/q3.png";
quran.url[3] = "https://archive.org/download/hymp5/hymp5.pdf";
//--------------------------------------
quran.title[4] = "المصباح المنير في تهذيب تفسير ابن كثير";
quran.texts[4] = "المصباح المنير في تهذيب تفسير ابن كثير - إعداد جماعة من العلماء ، بإشراف صفي الرحمن المباركفوري ، دار السلام ، الرياض ، 1434 هـ / 2013 م ، 1646 صفحة ، (76.7 M) .";
quran.imgs[4] = "/img/quran/q4.png";
quran.url[4] = "https://archive.org/download/tvfxb3/tvfxb3.pdf";
//--------------------------------------
quran.title[5] = "شرح أصول في التفسير - للعثيمين";
quran.texts[5] = "شرح أصول في التفسير ـ المتن والشرح لفضيلة الشيخ العلامة محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 463 صفحة ، (8.4 M) .";
quran.imgs[5] = "/img/quran/q5.png";
quran.url[5] = "https://archive.org/download/ybvg6/ybvg6.pdf";
//--------------------------------------
quran.title[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم - للشثري";
quran.texts[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم ، شرح د. سعد بن ناصر بن عبد العزيز الشثري ، اعتنى به عبد المجيد بن غيث الغيث و عبد العزيز بن محمد الصديقي ، دار كنوز إشبيليا ، الرياض ، ط 2 ، 1432 هـ / 2011 م ، 227 صفحة .";
quran.imgs[6] = "/img/quran/q6.png";
quran.url[6] = "http://archive.org/download/nbhyg/nbhyg.pdf";

//--------------------------------------
quran.title[7] = "شرح مقدمة في أصول التفسير لابن تيمية - صالح آل الشيخ";
quran.texts[7] = "شرح مقدمة في أصول التفسير لابن تيمية ، صالح بن عبد العزيز بن محمد آل الشيخ ، مكتبة دار المنهاج ، الرياض ، ط 1 ، 1432 هـ ، 207 صفحات .";
quran.imgs[7] = "/img/quran/q7.png";
quran.url[7] = "http://www.archive.org/download/jtrye/jtrye.pdf";

//--------------------------------------
quran.title[8] = "تفسير سورة آل عمران - للعثيمين";
quran.texts[8] = "تفسير سورة آل عمران - محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1435 هـ ، مجلدان مدمجان برابط واحد (الأول = 612 صفحة ، الثاني = 608 صفحات) ، (25.0 M) .";
quran.imgs[8] = "/img/quran/q8.png";
quran.url[8] = "https://archive.org/download/btvn5/btvn5.pdf";






//====================================================================================================================
//                              الحديث
//====================================================================================================================

//--------------------------------------
hadith.title[0] = "شرح الأربعين النووية - لصالح آل الشيخ";
hadith.texts[0] = "شرح الأربعين النووية للإمام يحيى بن شرف النووي ، صالح بن عبد العزيز آل الشيخ ، ت عادل رفاعي ،دار العاصمة ، الرياض ، ط 1 ، 1431 هـ ، 2010 م ، 608 صفحات .";
hadith.imgs[0] = "/img/hadith/h0.png";
hadith.url[0] = "http://www.archive.org/download/jjug6/jjug6.pdf";

//--------------------------------------
hadith.title[1] = "شرح عمدة الأحكام - للعثيمين";
hadith.texts[1] = "شرح عمدة الأحكام - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 880 ص ، الثاني = 820 ص) ، 37 M .";
hadith.imgs[1] = "/img/hadith/h1.png";
hadith.url[1] = "https://archive.org/download/a1640n/a1640n.pdf";

//--------------------------------------
hadith.title[2] = "شرح بلوغ المرام - للشثري";
hadith.texts[2] = "شرح بلوغ المرام من أدلة الأحكام - د. سعد بن ناصر الشثري ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1435 هـ / 2014 م ، 3 مجلدات مدمجات برابط واحد (الأول = 548 صفحة ، الثاني = 591 صفحة ، الثالث = 502 صفحة) ، 31.8 M .";
hadith.imgs[2] = "/img/hadith/h2.png";
hadith.url[2] = "https://archive.org/download/fmgx3/fmgx3.pdf";

//--------------------------------------
hadith.title[3] = "فتح العلام في دراسة أحاديث بلوغ المرام - لابن حزام البعداني";
hadith.texts[3] = "فتح العلام في دراسة أحاديث بلوغ المرام حديثياً وفقهياً مع ذكر بعض المسائل الملحقة - أبو عبد الله محمد بن علي بن حزام الفضلي البعداني ، دار العاصمة ، صنعاء ، ط 4 ، 10 مجلدات مدمجة برابط واحد (الأول = 578 ص ، الثاني = 731 ص ، الثالث = 616 ص ، الرابع = 558 ص ، الخامس = 730 ص ، السادس = 574 ص ، السابع = 520 ص ، الثامن = 750 ص ، التاسع = 651 ص ، العاشر = 696 ص) ، 99 M ، إهداء من أخ كريم - جزاه الله خيراً - وقد قمنا بتنسيقه.";
hadith.imgs[3] = "/img/hadith/h3.png";
hadith.url[3] = "https://archive.org/download/tdso7/tdso7.pdf";
//--------------------------------------
hadith.title[4] = "شرح مختصر لحديث سيد الاستغفار - لابن تيمية";
hadith.texts[4] = "شرح مختصر لحديث سيد الاستغفار - ابن تيمية ، 7 صفحات ، 2 M .";
hadith.imgs[4] = "/img/hadith/h4.png";
hadith.url[4] = "https://archive.org/download/ysqq2/ysqq2.pdf";
//--------------------------------------
hadith.title[5] = "الجامع الصحيح مما ليس في الصحيحين - لمقبل الوادعي";
hadith.texts[5] = "الجامع الصحيح مما ليس في الصحيحين (طبعة جديدة منقحة ومفهرسة ومزيدة بزيادات تنشر لأول مرة مع تنبيهات على الأحاديث التي تراجع عنها الشيخ رحمه الله) - مقبل بن هادي الوادعي ، دار الآثار ، اليمن ، ط 4 ، 1434 هـ / 2013 م ، ستة مجلدات مدمجة برابط واحد (الأول = 624 صفحة ، الثاني = 664 صفحة ، الثالث = 600 صفحة ، الرابع = 648 صفحة ، الخامس = 720 صفحة ، السادس = 720 صفحة) ، 77 M .";
hadith.imgs[5] = "/img/hadith/h5.png";
hadith.url[5] = "https://archive.org/download/a878n/a878n.pdf";
//--------------------------------------
hadith.title[6] = "خطبة الحاجة - لابن تيمية والألباني - بقلم سليم الهلالي";
hadith.texts[6] = "خطبة الحاجة التي كان رسول الله صلى الله عليه وسلم يعلمها أصحابه وبيان أنها سنة في مستهل الخطب والكتب - شرح شيخ الإسلام أبي العباس تقي الدين أحمد بن عبد الحليم ابن تيمية الحراني ، ومحلاة بحواش نفيسة وتعليقات منيفة من كتب الإمام المحدث الشيخ محمد ناصر الدين الألباني وبذيلها كسر القيد لكلام الشيخ بكر أبي زيد والعمدة في رد شبهات أبي غدة - بقلم سليم بن عيد الهلالي ، الدار الأثرية ، عمّان ، ط 2 ، 1425 هـ / 2004 م ، 74 ص ، 1 M .";
hadith.imgs[6] = "/img/hadith/h6.png";
hadith.url[6] = "https://archive.org/download/a1475n/a1475n.pdf";

//--------------------------------------
hadith.title[7] = "كتاب الإمارة من صحيح مسلم";
hadith.texts[7] = "كتاب الإمارة من صحيح مسلم - الهيئة العامة للعناية بطباعة ونشر القرآن الكريم والسنة النبوية وعلومهما ، الكويت ، ط 1 ، 1436 هـ / 2014 م ، 71 ص ، 2 M .";
hadith.imgs[7] = "/img/hadith/h7.png";
hadith.url[7] = "https://archive.org/download/a1527n/a1527n.pdf";

//--------------------------------------
hadith.title[8] = "الصحيح المسند مما ليس في الصحيحين - لمقبل الوادعي";
hadith.texts[8] = "الصحيح المسند مما ليس في الصحيحين - طبعة جديدة منقحة وتحوي زيادات وتراجعات تنشر لأول مرة ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 4 ، 1433 هـ / 2012 م ، مجلدان مدمجان برابط واحد (الأول = 701 صفحة ، الثاني = 680 صفحة) ، 29 M .";
hadith.imgs[8] = "/img/hadith/h8.png";
hadith.url[8] = "https://archive.org/download/a928n/a928n.pdf";

//--------------------------------------
hadith.title[9] = "الدرر النقية في شرح البيقونية - تركي العبديني ";
hadith.texts[9] = "الدرر النقية في شرح المنظومة البيقونية - تركي بن مسفر بن هادي العبديني ، 152 ص ، 2 M";
hadith.imgs[9] = "/img/hadith/h9.png";
hadith.url[9] = "https://archive.org/download/tvdx5/tvdx5.pdf";

//--------------------------------------
hadith.title[10] = "السير الحثيث شرح اختصار علوم الحديث - لمقبل الوادعي ";
hadith.texts[10] = "السير الحثيث شرح اختصار علوم الحديث - مقبل بن هادي الوادعي ، فرّغه وعلق عليه عبد الله بن محمد بن عبد الله الحمادي ، دار الآثار ، صنعاء ، ط 1 ، 1428 هـ / 2007 م ، 495 صفحة ، 8.8 M .";
hadith.imgs[10] = "/img/hadith/h10.png";
hadith.url[10] = "https://archive.org/download/bvgm3/bvgm3.pdf";

//--------------------------------------
hadith.title[11] = "";
hadith.texts[11] = "";
hadith.imgs[11] = "/img/hadith/h11.png";
hadith.url[11] = "";

//--------------------------------------
hadith.title[12] = "";
hadith.texts[12] = "";
hadith.imgs[12] = "/img/hadith/h12.png";
hadith.url[12] = "";

//--------------------------------------
hadith.title[13] = "";
hadith.texts[13] = "";
hadith.imgs[13] = "/img/hadith/h13.png";
hadith.url[13] = "";

//--------------------------------------
hadith.title[14] = "";
hadith.texts[14] = "";
hadith.imgs[14] = "/img/hadith/h14.png";
hadith.url[14] = "";

//--------------------------------------
hadith.title[15] = "";
hadith.texts[15] = "";
hadith.imgs[15] = "/img/hadith/h15.png";
hadith.url[15] = "";

//--------------------------------------
hadith.title[16] = "";
hadith.texts[16] = "";
hadith.imgs[16] = "/img/hadith/h16.png";
hadith.url[16] = "";



var Books = {
        quran,
        hadith,
        aqida,
        figh,
        tazkia,
        arabic,
        sera,
        tragim,
        coctel
};