


let quran,
        hadith,
        aqida,
        figh,
        tazkia,
        arabic,
        sera,
        tragim,
        coctel;



//--------------------------------------
quran.title[0] = "كيف نفهم القران - لمحمد جميل زينو";
quran.texts[0] = "كيف نفهم القرآن (أنواع التفسير وشرح بعض آي القرآن) - محمد بن جميل زينو ، مطبعة دار المجمع العلمي ، جدة ، ط 6 ، 144 صفحة ، 4 M .";
quran.imgs[0] = "/img/quran/q0.png";
quran.url[0] = "https://ia601308.us.archive.org/20/items/nlpx2/nlpx2.pdf";

//--------------------------------------
quran.title[1] = "معارج الصعود إلى تفسير سورة هود - للشنقيطي";
quran.texts[1] = `معارج الصعود إلى تفسير سورة هود - محمد الأمين بن محمد المختار الجكني الشنقيطي ، كتب عن فضيلة المسفر هذا التفسير تلميذه عبد الله بن أحمد قادري ، دار المجتمع ، جدة ، ط 1 ، 1408 هـ / 1988 م ، 316 ص ، 5 M.`;
quran.imgs[1] = "/img/quran/q1.png";
quran.url[1] = "https://archive.org/download/a1651n/a1651n.pdf";

//--------------------------------------
quran.title[2] = "الإلمام ببعض آيات الأحكام - للعثيمين";
quran.texts[2] = "الإلمام ببعض آيات الأحكام (تفسيراً واستنباطاً) - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 823 صفحة ، 12.8 M .";
quran.imgs[2] = "/img/quran/q2.png";
quran.url[2] = "https://archive.org/download/zoju7/zoju7.pdf";

//--------------------------------------
quran.title[3] = "ايسر التفاسير - للجزائري";
quran.texts[3] = "أيسر التفاسير لكلام العلي الكبير وبهامشه نهير الخير على أيسر التفاسير - أبو بكر جابر الجزائري ، مكتبة العلوم والحكم ، المدينة المنورة ، دار الحديث ، القاهرة ، 1806 صفحة ، (63.5 M) .";
quran.imgs[3] = "/img/quran/q3.png";
quran.url[3] = "https://archive.org/download/hymp5/hymp5.pdf";
//--------------------------------------
quran.title[4] = "المصباح المنير في تهذيب تفسير ابن كثير";
quran.texts[4] = "المصباح المنير في تهذيب تفسير ابن كثير - إعداد جماعة من العلماء ، بإشراف صفي الرحمن المباركفوري ، دار السلام ، الرياض ، 1434 هـ / 2013 م ، 1646 صفحة ، (76.7 M) .";
quran.imgs[4] = "/img/quran/q4.png";
quran.url[4] = "https://archive.org/download/tvfxb3/tvfxb3.pdf";
//--------------------------------------
quran.title[5] = "شرح أصول في التفسير - للعثيمين";
quran.texts[5] = "شرح أصول في التفسير ـ المتن والشرح لفضيلة الشيخ العلامة محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 463 صفحة ، (8.4 M) .";
quran.imgs[5] = "/img/quran/q5.png";
quran.url[5] = "https://archive.org/download/ybvg6/ybvg6.pdf";
//--------------------------------------
quran.title[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم - للشثري";
quran.texts[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم ، شرح د. سعد بن ناصر بن عبد العزيز الشثري ، اعتنى به عبد المجيد بن غيث الغيث و عبد العزيز بن محمد الصديقي ، دار كنوز إشبيليا ، الرياض ، ط 2 ، 1432 هـ / 2011 م ، 227 صفحة .";
quran.imgs[6] = "/img/quran/q6.png";
quran.url[6] = "http://archive.org/download/nbhyg/nbhyg.pdf";

//--------------------------------------
quran.title[7] = "شرح مقدمة في أصول التفسير لابن تيمية - صالح آل الشيخ";
quran.texts[7] = "شرح مقدمة في أصول التفسير لابن تيمية ، صالح بن عبد العزيز بن محمد آل الشيخ ، مكتبة دار المنهاج ، الرياض ، ط 1 ، 1432 هـ ، 207 صفحات .";
quran.imgs[7] = "/img/quran/q7.png";
quran.url[7] = "http://www.archive.org/download/jtrye/jtrye.pdf";

//--------------------------------------
quran.title[8] = "تفسير سورة آل عمران - للعثيمين";
quran.texts[8] = "تفسير سورة آل عمران - محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1435 هـ ، مجلدان مدمجان برابط واحد (الأول = 612 صفحة ، الثاني = 608 صفحات) ، (25.0 M) .";
quran.imgs[8] = "/img/quran/q8.png";
quran.url[8] = "https://archive.org/download/btvn5/btvn5.pdf";






//====================================================================================================================
//                              الحديث
//====================================================================================================================

//--------------------------------------
hadith.title[0] = "شرح الأربعين النووية - لصالح آل الشيخ";
hadith.texts[0] = "شرح الأربعين النووية للإمام يحيى بن شرف النووي ، صالح بن عبد العزيز آل الشيخ ، ت عادل رفاعي ،دار العاصمة ، الرياض ، ط 1 ، 1431 هـ ، 2010 م ، 608 صفحات .";
hadith.imgs[0] = "/img/hadith/h0.png";
hadith.url[0] = "http://www.archive.org/download/jjug6/jjug6.pdf";

//--------------------------------------
hadith.title[1] = "شرح عمدة الأحكام - للعثيمين";
hadith.texts[1] = "شرح عمدة الأحكام - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 880 ص ، الثاني = 820 ص) ، 37 M .";
hadith.imgs[1] = "/img/hadith/h1.png";
hadith.url[1] = "https://archive.org/download/a1640n/a1640n.pdf";

//--------------------------------------
hadith.title[2] = "شرح بلوغ المرام - للشثري";
hadith.texts[2] = "شرح بلوغ المرام من أدلة الأحكام - د. سعد بن ناصر الشثري ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1435 هـ / 2014 م ، 3 مجلدات مدمجات برابط واحد (الأول = 548 صفحة ، الثاني = 591 صفحة ، الثالث = 502 صفحة) ، 31.8 M .";
hadith.imgs[2] = "/img/hadith/h2.png";
hadith.url[2] = "https://archive.org/download/fmgx3/fmgx3.pdf";

//--------------------------------------
hadith.title[3] = "فتح العلام في دراسة أحاديث بلوغ المرام - لابن حزام البعداني";
hadith.texts[3] = "فتح العلام في دراسة أحاديث بلوغ المرام حديثياً وفقهياً مع ذكر بعض المسائل الملحقة - أبو عبد الله محمد بن علي بن حزام الفضلي البعداني ، دار العاصمة ، صنعاء ، ط 4 ، 10 مجلدات مدمجة برابط واحد (الأول = 578 ص ، الثاني = 731 ص ، الثالث = 616 ص ، الرابع = 558 ص ، الخامس = 730 ص ، السادس = 574 ص ، السابع = 520 ص ، الثامن = 750 ص ، التاسع = 651 ص ، العاشر = 696 ص) ، 99 M ، إهداء من أخ كريم - جزاه الله خيراً - وقد قمنا بتنسيقه.";
hadith.imgs[3] = "/img/hadith/h3.png";
hadith.url[3] = "https://archive.org/download/tdso7/tdso7.pdf";
//--------------------------------------
hadith.title[4] = "شرح مختصر لحديث سيد الاستغفار - لابن تيمية";
hadith.texts[4] = "شرح مختصر لحديث سيد الاستغفار - ابن تيمية ، 7 صفحات ، 2 M .";
hadith.imgs[4] = "/img/hadith/h4.png";
hadith.url[4] = "https://archive.org/download/ysqq2/ysqq2.pdf";
//--------------------------------------
hadith.title[5] = "الجامع الصحيح مما ليس في الصحيحين - لمقبل الوادعي";
hadith.texts[5] = "الجامع الصحيح مما ليس في الصحيحين (طبعة جديدة منقحة ومفهرسة ومزيدة بزيادات تنشر لأول مرة مع تنبيهات على الأحاديث التي تراجع عنها الشيخ رحمه الله) - مقبل بن هادي الوادعي ، دار الآثار ، اليمن ، ط 4 ، 1434 هـ / 2013 م ، ستة مجلدات مدمجة برابط واحد (الأول = 624 صفحة ، الثاني = 664 صفحة ، الثالث = 600 صفحة ، الرابع = 648 صفحة ، الخامس = 720 صفحة ، السادس = 720 صفحة) ، 77 M .";
hadith.imgs[5] = "/img/hadith/h5.png";
hadith.url[5] = "https://archive.org/download/a878n/a878n.pdf";
//--------------------------------------
hadith.title[6] = "خطبة الحاجة - لابن تيمية والألباني - بقلم سليم الهلالي";
hadith.texts[6] = "خطبة الحاجة التي كان رسول الله صلى الله عليه وسلم يعلمها أصحابه وبيان أنها سنة في مستهل الخطب والكتب - شرح شيخ الإسلام أبي العباس تقي الدين أحمد بن عبد الحليم ابن تيمية الحراني ، ومحلاة بحواش نفيسة وتعليقات منيفة من كتب الإمام المحدث الشيخ محمد ناصر الدين الألباني وبذيلها كسر القيد لكلام الشيخ بكر أبي زيد والعمدة في رد شبهات أبي غدة - بقلم سليم بن عيد الهلالي ، الدار الأثرية ، عمّان ، ط 2 ، 1425 هـ / 2004 م ، 74 ص ، 1 M .";
hadith.imgs[6] = "/img/hadith/h6.png";
hadith.url[6] = "https://archive.org/download/a1475n/a1475n.pdf";

//--------------------------------------
hadith.title[7] = "كتاب الإمارة من صحيح مسلم";
hadith.texts[7] = "كتاب الإمارة من صحيح مسلم - الهيئة العامة للعناية بطباعة ونشر القرآن الكريم والسنة النبوية وعلومهما ، الكويت ، ط 1 ، 1436 هـ / 2014 م ، 71 ص ، 2 M .";
hadith.imgs[7] = "/img/hadith/h7.png";
hadith.url[7] = "https://archive.org/download/a1527n/a1527n.pdf";

//--------------------------------------
hadith.title[8] = "الصحيح المسند مما ليس في الصحيحين - لمقبل الوادعي";
hadith.texts[8] = "الصحيح المسند مما ليس في الصحيحين - طبعة جديدة منقحة وتحوي زيادات وتراجعات تنشر لأول مرة ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 4 ، 1433 هـ / 2012 م ، مجلدان مدمجان برابط واحد (الأول = 701 صفحة ، الثاني = 680 صفحة) ، 29 M .";
hadith.imgs[8] = "/img/hadith/h8.png";
hadith.url[8] = "https://archive.org/download/a928n/a928n.pdf";

//--------------------------------------
hadith.title[9] = "الدرر النقية في شرح البيقونية - تركي العبديني ";
hadith.texts[9] = "الدرر النقية في شرح المنظومة البيقونية - تركي بن مسفر بن هادي العبديني ، 152 ص ، 2 M";
hadith.imgs[9] = "/img/hadith/h9.png";
hadith.url[9] = "https://archive.org/download/tvdx5/tvdx5.pdf";

//--------------------------------------
hadith.title[10] = "السير الحثيث شرح اختصار علوم الحديث - لمقبل الوادعي ";
hadith.texts[10] = "السير الحثيث شرح اختصار علوم الحديث - مقبل بن هادي الوادعي ، فرّغه وعلق عليه عبد الله بن محمد بن عبد الله الحمادي ، دار الآثار ، صنعاء ، ط 1 ، 1428 هـ / 2007 م ، 495 صفحة ، 8.8 M .";
hadith.imgs[10] = "/img/hadith/h10.png";
hadith.url[10] = "https://archive.org/download/bvgm3/bvgm3.pdf";

//--------------------------------------
hadith.title[11] = "شرح نزهة النظر في توضيح نخبة الفكر - للعثيمين";
hadith.texts[11] = "شرح نزهة النظر في توضيح نخبة الفكر - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 531 ص ، 10 M .";
hadith.imgs[11] = "/img/hadith/h11.png";
hadith.url[11] = "https://archive.org/download/a1642n/a1642n.pdf";

//--------------------------------------
hadith.title[12] = "المحدث الفاصل بين الراوي والواعي - الرامهرمزي";
hadith.texts[12] = "المحدث الفاصل بين الراوي والواعي - الحسن بن عبد الرحمن الرامهرمزي - دراسة وتحقيق محمد بن علي الصومعي البيضاني ، الناشر المتميز ، المدينة النبوية ، ط 1 ، 1438 هـ / 2017 م ، 821 ص ، 15 M .";
hadith.imgs[12] = "/img/hadith/h12.png";
hadith.url[12] = "https://archive.org/download/a1705n/a1705n.pdf";

//--------------------------------------
hadith.title[13] = "المزيد في متصل الأسانيد دراسة نظرية وتطبيقية";
hadith.texts[13] = "المزيد في متصل الأسانيد دراسة نظرية وتطبيقية (ماجستير) - سميرة محمد سلامة عمرو ، مكتبة الرشد ، السعودية ، ط 1 ، 1426 هـ / 2005 م ، 254 ص ، 4 M .";
hadith.imgs[13] = "/img/hadith/h13.png";
hadith.url[13] = "https://archive.org/download/a1695n/a1695n.pdf";


//====================================================================================================================
//                             العقيدة
//====================================================================================================================

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح الأصول الثلاثة - عبد العزيز بن عبد الله الراجحي ، مدار الوطن للنشر ، الرياض ، ط 2 ، 1434 هـ / 2013 م ، 111 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/nxmd8/nxmd8.pdf --- https://archive.org/details/nxmd8";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "الأدلة على بطلان الاشتراكية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1430 هـ / 2009 م ، 96 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/bvnf4/bvnf4.pdf --- https://archive.org/details/bvnf4";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح أصول السنة للإمام أحمد بن حنبل - عبد العزيز بن عبد الله الراجحي ، دار التوحيد للنشر ، الرياض ، ط 1 ، 1434 هـ ، 248 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/xyhu7/xyhu7.pdf --- https://archive.org/details/xyhu7";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح أصول الإيمان لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 2 ، 1433 هـ ، 448 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/bgvl3/bgvl3.pdf --- https://archive.org/details/bgvl3";



//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح الفتوى الحموية الكبرى لشيخ الإسلام ابن تيمية - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 521 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/ybhx5/ybhx5.pdf --- https://archive.org/details/ybhx5";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح فضل الإسلام لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 416 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/vcnf4/vcnf4.pdf --- https://archive.org/details/vcnf4";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح كتاب الفرقان بين أولياء الرحمن وأولياء الشيطان لشيخ الإسلام ابن تيمية ، صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 428 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/ftvm8/ftvm8.pdf --- https://archive.org/details/ftvm8";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح متون العقيدة (شرح كتب أصول السنة للإمام أحمد بن حنبل رحمه الله ، الواسطية لشيخ الإسلام ابن تيمية رحمه الله ، القواعد الأربع للشيخ محمد بن عبد الوهاب رحمه الله) - د. سعد بن ناصر الشثري ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1433 هـ / 2012 م ، 253 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/ybgm8/ybgm8.pdf --- https://archive.org/details/ybgm8";


//--------------------------------------
aqida.title[] = "";
aqida.texts[] = "شرح أصول الإيمان لمحمد بن عبد الوهاب ، صالح بن عبد العزيز آل الشيخ ، تحقيق عادل بن محمد مرسي رفاعي ، دار العاصمة ، الرياض ، ط 1 ، 1431 هـ / 2010 م ، 613 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/ookk2/ookk2.pdf ---  ";

//--------------------------------------
aqida.title[] = "";
aqida.texts[] = `قمع المعاند وزجر الحاقد الحاسد ، مقبل بن هادي الوادعي ، دار الحديث ، دماج / اليمن ، ط 1 ، 1413 هـ / 1993 م ، جزءان .`;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://archive.org/download/zseui/zseui.pdf ---  ";

//--------------------------------------
aqida.title[] = "لماذا اخترت المنهج السلفي ؟ سليم بن عيد الهلالي";
aqida.texts[] = "لماذا اخترت المنهج السلفي ؟ سليم بن عيد الهلالي ، دار أهل الحديث ، ط 1 ، 1419 هـ / 1999 م ، 107 صفحات .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/uu777/uu777.pdf ---  ";

//--------------------------------------
aqida.title[] = "اللالئ البهية في شرح العقيدة الواسطية ، صالح آل الشيخ ، مجلدان ";
aqida.texts[] = "
                                اللالئ البهية في شرح العقيدة الواسطية ، صالح بن عبد العزيز آل الشيخ ، تحقيق عادل بن محمد مرسي رفاعي ، دار العاصمة ، الرياض ، ط 1 ، 1431 هـ / 2010 م ، مجلدان(الأول = 631 صفحة ، الثاني = 731 صفحة).
                            ";;;;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://archive.org/download/sharvm1/sharvm1.pdf --- http://archive.org/download/sharvm2/sharvm2.pdf";


//--------------------------------------
aqida.title[] = "غارة الأشرطة على أهل الجهل والسفسطة ، مقبل بن هادي الوادعي";
aqida.texts[] = "
                                غارة الأشرطة على أهل الجهل والسفسطة ، مقبل بن هادي الوادعي ، دار الحرمين ، القاهرة ، ط 1 ، 1419 هـ / 1998 م ، مجلدان.

                            ";;;;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/hyui1/hyui1.pdf --- http://www.archive.org/download/hyui2/hyui2.pdf";


//--------------------------------------
aqida.title[] = "المخرج من الفتنة ، مقبل بن هادي الوادعي";
aqida.texts[] = "
                                المخرج من الفتنة ، مقبل بن هادي الوادعي ، مكتبة صنعاء الأثرية ، صنعاء ، ط 1 ، 2002 م ، 214 صفحة.

                            ";;;;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/hupp9/hupp9.pdf ---  ";


//--------------------------------------
aqida.title[] = "الإمام الأشعري حياته وأطواره العقدية (دكتوراة) ، د. صالح بن مقبل العصيمي التميمي";
aqida.texts[] = "
                                الإمام الأشعري حياته وأطواره العقدية(دكتوراة) ، د.صالح بن مقبل بن عبد الله العصيمي التميمي ، دار الفضيلة ، الرياض ، ط 1 ، 1432 هـ / 2011 م ، 412 صفحة.
                            ";;;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://archive.org/download/frkuy/frkuy.pdf ---  ";


//--------------------------------------
aqida.title[] = "التمهيد لشرح كتاب التوحيد ، صالح آل الشيخ";
aqida.texts[] = "
                                التمهيد لشرح كتاب التوحيد الذي هو حقّ الله على العبيد ، صالح بن عبد العزيز آل الشيخ ، مكتبة دار المنهاج ، الرياض ، ط 2 ، 1433 هـ ، 623 صفحة.


                            ";;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/ewza1/ewza1.pdf ---  ";


//--------------------------------------
aqida.title[] = "التعليقات البازية على شرح الطحاوية ، عبد العزيز ابن باز  ، ( مجلدان )";
aqida.texts[] = "
                                التعليقات البازية على شرح الطحاوية ، عبد العزيز بن عبد الله بن باز ، أعده غزاي بن حمدان حسين الوهبي الأسلمي ، دار ابن الأثير ، الرياض ، ط 1 ، 1429 هـ / 2008 م ، مجلدان = 1288 صفحة.
                            ";;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://archive.org/download/kkto0o1/kkto0o1.pdf --- http://archive.org/download/kktoo2/kktoo2.pdf";


//--------------------------------------
aqida.title[] = "شرح العقيدة الطحاوية ، صالح آل الشيخ ، ( مجلدان )";
aqida.texts[] = "
                                شرح العقيدة الطحاوية(إتحاف السائل بما في الطحاوية من مسائل) ، صالح بن عبد العزيز بن محمد آل الشيخ ، خرج أحاديثه سليمان القاطوني ، دار المودة ، المنصورة / مصر ، ط 1 ، 1432 هـ / 2011 م ، مجلدان = 1210 صفحات.
                            ";;;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://archive.org/download/kktew1/kktew1.pdf --- http://archive.org/download/kktew2/kktew2.pdf";


//--------------------------------------
aqida.title[] = "تأسيس التقديس في كشف تلبيس داود بن جرجيس ، عبدالله أبابطين ، ت د. عبد السلام بن برجس";
aqida.texts[] = "
                                تأسيس التقديس في كشف تلبيس داود بن جرجيس ، عبد الله بن عبد الرحمن أبابطين ، ت د.عبد السلام بن برجس العبد الكريم ، مؤسسة الرسالة ، بيروت ، ط 1 ، 1422 هـ / 2001 م ، 169 صفحة.


                            ";;;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/trds2/trds2.pdf ---  ";


//--------------------------------------
aqida.title[] = "الإلحاد الخميني في أرض الحرمين ، مقبل الوادعي ، (طبعة دار الآثار)";
aqida.texts[] = "
                                الإلحاد الخميني في أرض الحرمين ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 3 ، 1428 هـ / 2007 م ، 336 صفحة.


                            ";;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/gytr5555/gytr5555.pdf ---  ";



//--------------------------------------
aqida.title[] = "شرح رسالة العبودية لشيخ الإسلام ابن تيمية - د. صالح الفوزان";
aqida.texts[] = "شرح رسالة العبودية لشيخ الإسلام ابن تيمية - د. صالح بن فوزان الفوزان ، اعتنى به وأعده للنشر فهد بن إبراهيم الفعيم ، دار ابن الجوزي ، السعودية ، ط 1 ، 1435 هـ ، 303 صفحات .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/dnbp7/dnbp7.pdf --- https://archive.org/details/dnbp7";


//--------------------------------------
aqida.title[] = "تقريب التدمرية - محمد بن صالح العثيمين";
aqida.texts[] = "تقريب التدمرية - محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 1433 هـ ، 159 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/crfp7/crfp7.pdf --- https://archive.org/details/crfp7";

//--------------------------------------
aqida.title[] = "مختارات من اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - محمد بن صالح العثيمين";
aqida.texts[] = "مختارات من اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 2 ، 1434 هـ ، 80 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/kmbv2/kmbv2.pdf --- https://archive.org/details/kmbv2";


//--------------------------------------
aqida.title[] = "شرح عقيدة الإمام المجدد محمد بن عبد الوهاب ، العلامة د. صالح بن فوزان الفوزان";
aqida.texts[] = "شرح عقيدة الإمام المجدد محمد بن عبد الوهاب ، العلامة د. صالح بن فوزان الفوزان ، مكتبة دار المنهاج ، الرياض ، ط 2 ، 1431 هــ .;;;
";;;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/3aqeda_156/3aqeda.pdf --- http://www.archive.org/details/3aqeda_156";

//--------------------------------------
aqida.title[] = "الرد الشافي على الجفري وبيان مخالفاته العقدية والمنهجية ، عادل الفريدان ، تقديم د. صالح الفوزان";
aqida.texts[] = "الرد الشافي على الجفري وبيان مخالفاته العقدية والمنهجية ، عادل الفريدان ، تقديم د. صالح الفوزان ، دار الإمام أحمد ، ط 1 ، 1426 هـ / 2005 م .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.archive.org/download/zaq24/zaq24.pdf --- http://www.archive.org/details/zaq24";

//--------------------------------------
aqida.title[] = "شرح العقيدة الواسطية  - عبد العزيز بن عبد الله الراجحي";
aqida.texts[] = "شرح العقيدة الواسطية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية  - عبد العزيز بن عبد الله الراجحي ، دار التوحيد للنشر ، الرياض ، ط 1 ، 1434 هـ ، 184 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/htvf4/htvf4.pdf --- https://archive.org/details/htvf4";


//--------------------------------------
aqida.title[] = "شرح الكافية الشافية في الانتصار للفرقة الناجية (القصيدة النونية) للحافظ المحقق ابن قيم الجوزية - محمد بن صالح العثيمين";
aqida.texts[] = "شرح الكافية الشافية في الانتصار للفرقة الناجية للحافظ المحقق شمس الدين أبي عبد الله محمد بن أبي بكر ابن قيم الجوزية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1435 هـ ، 4 مجلدات مدمجة برابط واحد (الأول = 704 صفحات ، الثاني = 821 صفحة ، الثالث = 720 صفحة ، الرابع = 624 صفحة) .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/shmv4/shmv4.pdf --- https://archive.org/details/shmv4";

//--------------------------------------
aqida.title[] = "أين الله (دفاع عن حديث الجارية رواية ودراية) ـ سليم الهلالي";
aqida.texts[] = "أين الله (دفاع عن حديث الجارية رواية ودراية) ـ سليم الهلالي ، الدار السلفية ، حولي ، الكويت ، ط 1 ، 1408 هـ / 1988 م ، 111 صفحة ، (3.0 M) .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/tpvf4/tpvf4.pdf --- https://archive.org/details/tpvf4";

//--------------------------------------
aqida.title[] = "شرح كشف الشبهات للإمام محمد بن عبد الوهاب التميمي ، صالح آل الشيخ ";
aqida.texts[] = "شرح كشف الشبهات لشيخ الإسلام محمد بن عبد الوهاب التميمي ، صالح بن عبد العزيز آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 463 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/nhyv5/nhyv5.pdf --- https://archive.org/details/nhyv5";


//--------------------------------------
aqida.title[] = "شرح ثلاثة الأصول للإمام محمد بن عبد الوهاب التميمي - صالح آل الشيخ";
aqida.texts[] = "شرح ثلاثة الأصول لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 267 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/svbd4/svbd4.pdf --- https://archive.org/details/svbd4";

//--------------------------------------
aqida.title[] = "شرح القواعد الأربع للإمام محمد بن عبد الوهاب التميمي ، صالح آل الشيخ";
aqida.texts[] = "شرح القواعد الأربع لشيخ الإسلام محمد بن عبد الوهاب التميمي ، صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 47 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/gtbv9/gtbv9.pdf --- https://archive.org/details/gtbv9";


//--------------------------------------
aqida.title[] = "مطلع الفجر في فقه الزجر بالهجر ومعه بيان منهج السلف الصالح في معاملة أهل الأهواء والبدع وبذيله مذهب شيخ الإسلام ابن تيمية في الهجر ، سليم الهلالي ";
aqida.texts[] = "مطلع الفجر في فقه الزجر بالهجر ومعه بيان منهج السلف الصالح في معاملة أهل الأهواء والبدع وبذيله مذهب شيخ الإسلام ابن تيمية في الهجر ، سليم بن عيد الهلالي ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1426 هـ / 2005 م ، 192 صفحة ، 4.5 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a176.pdf --- https://archive.org/download/jvpn5/jvpn5.pdf";

//--------------------------------------
aqida.title[] = "قرة العيون في تصحيح تفسير عبد الله بن عباس رضي الله عنهما لقوله تعالى ومن لم يحكم بما أنزل الله فأولئك هم الكافرون";
aqida.texts[] = "قرة العيون في تصحيح تفسير عبد الله بن عباس رضي الله عنهما لقوله تعالى : "ومن لم يحكم بما أنزل الله فأولئك هم الكافرون" - رواية ودراية ورعاية - ، سليم بن عيد الهلالي ، مكتبة الفرقان ، عجمان ، الإمارات ، ط 1 ، 1422 هـ / 2001 م ، 259 صفحة ، 6.3 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/bkpv3/bkpv3.pdf ---  ";

//--------------------------------------
aqida.title[] = "الصوفية في ميزان الكتاب والسنة - محمد بن جميل زينو";
aqida.texts[] = "الصوفية في ميزان الكتاب والسنة - محمد بن جميل زينو ، 64 صفحة ، 2.7 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/ftbt7/ftbt7.pdf --- https://archive.org/details/ftbt7";

//--------------------------------------
aqida.title[] = "بيان وتحذير من كتاب عقيدة الإمام الحافظ ابن كثير جمع محمد عادل عزيزة - محمد بن جميل زينو";
aqida.texts[] = "بيان وتحذير من كتاب عقيدة الإمام الحافظ ابن كثير جمع محمد عادل عزيزة - محمد بن جميل زينو ، مكة المكرمة ، ط 1 ، 1414 هـ / 1994 م ، 34 صفحة ، 1.4 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/gujy6/gujy6.pdf --- https://archive.org/details/gujy6";

//--------------------------------------
aqida.title[] = "المختار من أحاديث سيد الأبرار في المعتقد الصحيح - محمد بن علي بن حزام الفضلي البعداني";
aqida.texts[] = "المختار من أحاديث سيد الأبرار في المعتقد الصحيح - محمد بن علي بن حزام الفضلي البعداني ، مكتبة الفلاح ، دار كنوز دماج ، اليمن ، ط 1 ، 1432 هـ / 2011 م ، 155 صفحة ، 5.3 M .;;

";;;
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/01.pdf --- https://archive.org/download/tmxn6/tmxn6.pdf";

//--------------------------------------
aqida.title[] = "الواسطة بين الحق والخلق - شيخ الإسلام ابن تيمية ، تقديم محمد بن جميل زينو ، تمهيد محمود مهدي استانبولي";
aqida.texts[] = "الواسطة بين الحق والخلق - شيخ الإسلام ابن تيمية ، تقديم محمد بن جميل زينو ، تمهيد محمود مهدي استانبولي ، 36 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/79.pdf --- https://archive.org/download/lkmg6/lkmg6.pdf";


//--------------------------------------
aqida.title[] = "التحذير من فتنة الكفر والتكفير - محمد بن جميل زينو";
aqida.texts[] = "التحذير من فتنة الكفر والتكفير - محمد بن جميل زينو ، ط 2 ، 96 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/82.pdf --- https://archive.org/download/pvgd5/pvgd5.pdf";

//--------------------------------------
aqida.title[] = "أركان الإسلام والإيمان من الكتاب والسنة الصحيحة - محمد بن جميل زينو";
aqida.texts[] = "أركان الإسلام والإيمان من الكتاب والسنة الصحيحة - محمد بن جميل زينو ، ط 15 ، 128 صفحة ، 2.7 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/83.pdf --- https://archive.org/download/rpav5/rpav5.pdf";

//--------------------------------------
aqida.title[] = "شهادة الإسلام (لا إله إلا الله محمد رسول الله) - محمد بن جميل زينو";
aqida.texts[] = "شهادة الإسلام (لا إله إلا الله محمد رسول الله) - محمد بن جميل زينو ، دار المحمدي ، جدة ، ط 1 ، 1417 هـ / 1996 م ، 84 صفحة ، 2.8 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/97.pdf --- https://archive.org/download/xpkn6/xpkn6.pdf";

//--------------------------------------
aqida.title[] = "خذ عقيدتك من الكتاب والسنة الصحيحة - محمد بن جميل زينو";
aqida.texts[] = "خذ عقيدتك من الكتاب والسنة الصحيحة - محمد بن جميل زينو ، 31 صفحة .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/95.pdf --- https://archive.org/download/vpmn3/vpmn3.pdf";

//--------------------------------------
aqida.title[] = "منهاج الفرقة الناجية والطائفة المنصورة - محمد بن جميل زينو";
aqida.texts[] = "منهاج الفرقة الناجية والطائفة المنصورة - محمد بن جميل زينو ، ط 10 ، 143 صفحة ، 2.5 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/87.pdf --- https://archive.org/download/cvgm8/cvgm8.pdf";

//--------------------------------------
aqida.title[] = "كيف اهتديت إلى التوحيد والصراط المستقيم - محمد بن جميل زينو";
aqida.texts[] = "كيف اهتديت إلى التوحيد والصراط المستقيم - محمد بن جميل زينو ، دار الفتح ، الشارقة ، الإمارات ، ط 1 ، 1416 هـ / 1995 م ، 96 صفحة ، 2.3 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/99.pdf --- https://archive.org/download/vgtm5/vgtm5.pdf";


//--------------------------------------
aqida.title[] = "فتاوى الأئمة في النوازل المدلهمة وتبرئة دعوة وأتباع محمد بن عبد الوهاب من تهمة التطرف والإرهاب - محمد القحطاني ، تقديم سماحة مفتي عام السعودية عبد العزيز آل الشيخ ، تقديم ومراجعة وتصحيح د. صالح الفوزان";
aqida.texts[] = "فتاوى الأئمة في النوازل المدلهمة وتبرئة دعوة وأتباع محمد بن عبد الوهاب من تهمة التطرف والإرهاب - جمع وترتيب محمد بن حسين بن سعيد آل سفران القحطاني ، تقديم سماحة مفتي عام المملكة العربية السعودية الشيخ عبد العزيز بن عبد الله بن محمد آل الشيخ ، تقديم ومراجعة وتصحيح معالي الشيخ العلامة الدكتور صالح بن فوزان الفوزان ، شركة دار الأوفياء للطباعة والنشر ، الرياض ، 1424 هـ / 2003 م ، 330 صفحة ، 4.8 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a156.pdf --- https://archive.org/download/gtmp6/gtmp6.pdf";

//--------------------------------------
aqida.title[] = "فتوى اللجنة الدائمة للبحوث العلمية والإفتاء بالمملكة العربية السعودية حول الماسونية - علق عليها محمد بن إبراهيم";
aqida.texts[] = "فتوى اللجنة الدائمة للبحوث العلمية والإفتاء بالمملكة العربية السعودية حول الماسونية - علق عليها محمد بن إبراهيم ، مكتبة العقيدة الإسلامية ، القاهرة ، ط 1 ، 1435 هـ / 2014 م ، 28 صفحة ، 0.5 M ، إهداء من أخِ كريمِ - جزاه الله خيراً - .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/z0d11/z0d11.pdf ---  ";

//--------------------------------------
aqida.title[] = "القرآن والسنة عقيدة سلف الأمة - د. محمد بن خليل هراس ";
aqida.texts[] = "القرآن والسنة عقيدة سلف الأمة - د. محمد بن خليل هراس ، دار الشريعة ، القاهرة ، ط 1 ، 1424 هـ / 2004 م ، 63 صفحة ، 2.1 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a625n.pdf --- https://archive.org/download/a625n/a625n.pdf";

//--------------------------------------
aqida.title[] = "تبصير الأنام بشرح نواقض الإسلام لمحمد بن عبد الوهاب - عبد العزيز الراجحي";
aqida.texts[] = "تبصير الأنام بشرح نواقض الإسلام لشيخ الإسلام محمد بن عبد الوهاب - عبد العزيز بن عبد الله الراجحي ، دار النوادر ، الدار البيضاء ، المغرب ، الدار الأثرية ، القاهرة ، ط 1 ، 1431 هـ / 2010 م ، 61 صفحة ، 1.7 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a622n.pdf --- https://archive.org/download/a622n/a622n.pdf";

//--------------------------------------
aqida.title[] = "تيسير العزيز الحميد شرح كتاب التوحيد للإمام المجدد محمد بن عبد الوهاب - سليمان بن عبد الله بن محمد بن عبد الوهاب ، تعليق عبد العزيز الراجحي ";
aqida.texts[] = "تيسير العزيز الحميد شرح كتاب التوحيد الذي هو حق الله على العبيد للإمام المجدد محمد بن عبد الوهاب - سليمان بن عبد الله بن محمد بن عبد الوهاب ،تعليق عبد العزيز بن عبد الله الراجحي ، دار العاصمة ، الرياض ، ط 1 ، 1434 هـ / 2013 م ، 848 صفحة ، 16.7 M ، (عنوان الكتاب - في الأصل - به خطأ ، فأجرينا عليه تعديلاً) .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a618n.pdf --- https://archive.org/download/a618n/a618n.pdf";


//--------------------------------------
aqida.title[] = "الدرة العثيمينية بشرح فتح رب البرية بتلخيص الحموية - محمد بن صالح العثيمين";
aqida.texts[] = "الدرة العثيمينية بشرح فتح رب البرية بتلخيص الحموية - محمد بن صالح العثيمين ، أعده غزاي بن حمدان الأسلمي ، فهد بن أحمد بن مبارك الغامدي ، مكتبة الإمام الذهبي ، الكويت ، ط 2 ، 1433 هـ / 2012 م ، 554 صفحة ، 9 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a611n.pdf --- https://archive.org/download/a611n/a611n.pdf";


//--------------------------------------
aqida.title[] = "تعليقات سماحة الشيخ عبد العزيز ابن باز على الرسالة الحموية الكبرى لشيخ الإسلام ابن تيمية";
aqida.texts[] = "تعليقات سماحة الشيخ العلامة عبد العزيز بن عبد الله بن باز على الرسالة الحموية الكبرى لشيخ الإسلام ابن تيمية رحمه الله تعالى ، مدار الوطن للنشر ، الرياض ، ط 1 ، 1435 هـ / 2014 م ، 258 صفحة ، 5.6 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "http://www.moswarat.net/books/a696n.pdf --- https://archive.org/download/a696n/a696n.pdf";

//--------------------------------------
aqida.title[] = "فرقة الأحباش أصولها وفروعها - دراسة نقدية ، د. صالح العصيمي";
aqida.texts[] = "فرقة الأحباش أصولها وفروعها - دراسة نقدية ، د. صالح بن مقبل بن عبد الله العصيمي ، دار الصميعي ، الرياض ، ط 1 ، 1436 هـ / 2015 م ، 93 صفحة ، 2 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/a923n/a923n.pdf ---  ";

//--------------------------------------
aqida.title[] = "فضائل أهل بيت النبوة - مقبل الوادعي";
aqida.texts[] = "فضائل أهل بيت النبوة - مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 1 ، 1432 هـ / 2011 م ، 80 صفحة ، 1 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/a888n/%D9%81%D8%B6%D8%A7%D8%A6%D9%84%20%D8%A3%D9%87%D9%84%20%D8%A8%D9%8A%D8%AA%20%D8%A7%D9%84%D9%86%D8%A8%D9%88%D8%A9%20-%20%D9%85%D9%82%D8%A8%D9%84%20%D8%A7%D9%84%D9%88%D8%A7%D8%AF%D8%B9%D9%8A%20pdf.pdf ---  ";

//--------------------------------------
aqida.title[] = "اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - شيخ الإسلام ابن تيمية ـ ت الحرستاني والزغلي";
aqida.texts[] = "اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - شيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية ـ حققه وخرج أحاديثه وعلق عليه عصام فارس الحرستاني ، محمد إبراهيم الزغلي ، دار الجيل ، بيروت ، ط 1 ، 1413 هـ / 1993 م ، 544 صفحة ، 10 M .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/a1015n/a1015n.pdf ---  ";


//--------------------------------------
aqida.title[] = "أبواب وفصول في عقيدة أهل السنة والجماعة للعلامة الشيخ مقبل بن هادي الوادعي - محمد بن إبراهيم ";
aqida.texts[] = "أبواب وفصول في عقيدة أهل السنة والجماعة للعلامة الشيخ مقبل بن هادي الوادعي - رتبها واعتنى بها محمد بن إبراهيم المصري، مكتبة الإمام مسلم ، 1439 هـ / 2017 م ، 365 ص ، 10 M ، (إهداء من المؤلف - نفع الله به ، وجزاه خيراً - وقد قمنا بتنسيقه) .";
aqida.imgs[] = "/img/aqida/h.png";
aqida.url[] = "https://archive.org/download/gpmt7/gpmt7.pdf ---  ";

//--------------------------------------
aqida.title[] ="شرح عقيدة أهل السنة والجماعة - محمد بن صالح العثيمين";
aqida.texts[] ="شرح عقيدة أهل السنة والجماعة - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 549 صفحة ، 12 M .";
aqida.imgs[] ="/img/aqida/h.png";
aqida.url[] ="https://archive.org/download/a874n/a874n.pdf ---  ";


//--------------------------------------
aqida.title[] ="فتاوى العقيدة (أسئلة هامة ملحة وأجوبة نافعة في العقيدة الصحيحة) - محمد بن صالح العثيمين";
aqida.texts[] ="فتاوى العقيدة (أسئلة هامة ملحة وأجوبة نافعة في العقيدة الصحيحة) - محمد بن صالح العثيمين ، دار الجيل ، بيروت ، مكتبة السنة ، القاهرة ، ط 2 ، 1414 هـ / 1993 م ، 815 صفحة ، 12 M .";
aqida.imgs[] ="/img/aqida/h.png";
aqida.url[] ="http://www.moswarat.net/books/a823n.pdf --- https://archive.org/download/a823n/a823n.pdf";
 












let title = document.querySelector("#primary > div > div > span:nth-child(1) > ul > li:nth-child(1)");
let txt = document.querySelector("#primary > div > div > span:nth-child(1) > ul > li:nth-child(2) > span > div");
if (txt) { txt = txt.textContent; }
else {
        txt = document.querySelector("#primary > div > div > span:nth-child(1) > ul > li:nth-child(2) > span");
        if (txt) { txt = txt.textContent; } else { txt = ""; }
}
let link = document.querySelector("#primary > div > div > span:nth-child(2) > a");
let link2 = document.querySelector("#primary > div > div > span:nth-child(3) > a");
if (link) { link = link.href; } else { link = " "; }
if (link2) { link2 = link2.href; } else { link2 = " "; }
if (title) { title = title.title; } else { title = ""; }
console.log(`//--------------------------------------
aqida.title[] ="${title}";
aqida.texts[] ="${txt}";
aqida.imgs[] ="/img/aqida/h.png";
aqida.url[] ="${link} --- ${link2}";
 
`);
console.log("      ");



var Books = {
        quran,
        hadith,
        aqida,
        figh,
        tazkia,
        arabic,
        sera,
        tragim,
        coctel
};