//====================================================================================================================
// كتب العقيدة
//====================================================================================================================


export default function () {
    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================


    //--------------------------------------
    title[0] = "الأصول الثلاثة - للراجحي";
    texts[0] = "شرح الأصول الثلاثة - عبد العزيز بن عبد الله الراجحي ، مدار الوطن للنشر ، الرياض ، ط 2 ، 1434 هـ / 2013 م ، 111 صفحة .";
    imgs[0] = "/img/aqida/a0.png";
    url[0] = "https://archive.org/download/nxmd8/nxmd8.pdf";

    //--------------------------------------
    title[1] = "الأدلة على بطلان الاشتراكية - للعثيمين";
    texts[1] = "الأدلة على بطلان الاشتراكية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1430 هـ / 2009 م ، 96 صفحة .";
    imgs[1] = "/img/aqida/a1.png";
    url[1] = "https://archive.org/download/bvnf4/bvnf4.pdf";

    //--------------------------------------
    title[2] = "شرح أصول السنة للإمام أحمد بن حنبل - للراجحي";
    texts[2] = "شرح أصول السنة للإمام أحمد بن حنبل - عبد العزيز بن عبد الله الراجحي ، دار التوحيد للنشر ، الرياض ، ط 1 ، 1434 هـ ، 248 صفحة .";
    imgs[2] = "/img/aqida/a2.png";
    url[2] = "https://archive.org/download/xyhu7/xyhu7.pdf";

    //--------------------------------------
    title[3] = "شرح أصول الإيمان - صالح آل الشيخ";
    texts[3] = "شرح أصول الإيمان لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 2 ، 1433 هـ ، 448 صفحة .";
    imgs[3] = "/img/aqida/a3.png";
    url[3] = "https://archive.org/download/bgvl3/bgvl3.pdf";

    //--------------------------------------
    title[4] = "شرح الفتوى الحموية - صالح آل الشيخ";
    texts[4] = "شرح الفتوى الحموية الكبرى لشيخ الإسلام ابن تيمية - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 521 صفحة .";
    imgs[4] = "/img/aqida/a4.png";
    url[4] = "https://archive.org/download/ybhx5/ybhx5.pdf";

    //--------------------------------------
    title[5] = "اعلام العبيد بمعنى كلمة التوحيد - أبوعكرمة وليد الخالدي";
    texts[5] = "اعلام العبيد بمعنى كلمة التوحيد - قدم له معالي الشيخ العلامة الدكتور صالح بن فوزان آل فوزان والشيخ العلمة عبدالعزيز بن عبدالله الراجحي كتبه أبوعكرمة وليد الخالدي";
    imgs[5] = "/img/aqida/a5.png";
    url[5] = "http://www.waleedalkhaldi.com/sites/default/files/2018-06/ilam-alabeed_0.pdf";

    //--------------------------------------
    title[6] = "شرح كتاب الفرقان بين أولياء الرحمن وأولياء الشيطان - صالح آل الشيخ";
    texts[6] = "شرح كتاب الفرقان بين أولياء الرحمن وأولياء الشيطان لشيخ الإسلام ابن تيمية ، صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 428 صفحة .";
    imgs[6] = "/img/aqida/a6.png";
    url[6] = "https://archive.org/download/ftvm8/ftvm8.pdf";

    //--------------------------------------
    title[7] = "شرح متون العقيدة - للشثري";
    texts[7] = "شرح متون العقيدة (شرح كتب أصول السنة للإمام أحمد بن حنبل رحمه الله ، الواسطية لشيخ الإسلام ابن تيمية رحمه الله ، القواعد الأربع للشيخ محمد بن عبد الوهاب رحمه الله) - د. سعد بن ناصر الشثري ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1433 هـ / 2012 م ، 253 صفحة .";
    imgs[7] = "/img/aqida/a7.png";
    url[7] = "https://archive.org/download/ybgm8/ybgm8.pdf";



    //--------------------------------------
    title[8] = "قمع المعاند وزجر الحاقد الحاسد ، مقبل الوادعي";
    texts[8] = `قمع المعاند وزجر الحاقد الحاسد ، مقبل بن هادي الوادعي ، دار الحديث ، دماج / اليمن ، ط 1 ، 1413 هـ / 1993 م ، جزءان .`;
    imgs[8] = "/img/aqida/a8.png";
    url[8] = "http://archive.org/download/zseui/zseui.pdf";

    //--------------------------------------
    title[9] = "لماذا اخترت المنهج السلفي ؟ سليم بن عيد الهلالي";
    texts[9] = "لماذا اخترت المنهج السلفي ؟ سليم بن عيد الهلالي ، دار أهل الحديث ، ط 1 ، 1419 هـ / 1999 م ، 107 صفحات .";
    imgs[9] = "/img/aqida/a9.png";
    url[9] = "http://www.archive.org/download/uu777/uu777.pdf";

    //--------------------------------------
    title[10] = "اللالئ البهية في شرح العقيدة الواسطية ، صالح آل الشيخ ";
    texts[10] = "اللالئ البهية في شرح العقيدة الواسطية ، صالح بن عبد العزيز آل الشيخ ، تحقيق عادل بن محمد مرسي رفاعي ، دار العاصمة ، الرياض ، ط 1 ، 1431 هـ / 2010 م ، مجلدان(الأول = 631 صفحة ، الثاني = 731 صفحة)";
    imgs[10] = "/img/aqida/a10.png";
    url[10] = "http://archive.org/download/sharvm1/sharvm1.pdf";


    //--------------------------------------
    title[11] = "غارة الأشرطة على أهل الجهل والسفسطة ، مقبل بن هادي الوادعي";
    texts[11] = "غارة الأشرطة على أهل الجهل والسفسطة ، مقبل بن هادي الوادعي ، دار الحرمين ، القاهرة ، ط 1 ، 1419 هـ / 1998 م ، مجلدان.";
    imgs[11] = "/img/aqida/a11.png";
    url[11] = "http://www.archive.org/download/hyui1/hyui1.pdf";


    //--------------------------------------
    title[12] = "المخرج من الفتنة ، مقبل بن هادي الوادعي";
    texts[12] = "المخرج من الفتنة ، مقبل بن هادي الوادعي ، مكتبة صنعاء الأثرية ، صنعاء ، ط 1 ، 2002 م ، 214 صفحة.";
    imgs[12] = "/img/aqida/a12.png";
    url[12] = "http://www.archive.org/download/hupp9/hupp9.pdf";


    //--------------------------------------
    title[13] = "الإمام الأشعري حياته وأطواره العقدية (دكتوراة) ، د. صالح العصيمي ";
    texts[13] = "الإمام الأشعري حياته وأطواره العقدية(دكتوراة) ، د.صالح بن مقبل بن عبد الله العصيمي التميمي ، دار الفضيلة ، الرياض ، ط 1 ، 1432 هـ / 2011 م ، 412 صفحة.";
    imgs[13] = "/img/aqida/a13.png";
    url[13] = "http://archive.org/download/frkuy/frkuy.pdf";


    //--------------------------------------
    title[14] = "التمهيد لشرح كتاب التوحيد ، صالح آل الشيخ";
    texts[14] = "التمهيد لشرح كتاب التوحيد الذي هو حقّ الله على العبيد ، صالح بن عبد العزيز آل الشيخ ، مكتبة دار المنهاج ، الرياض ، ط 2 ، 1433 هـ ، 623 صفحة.";
    imgs[14] = "/img/aqida/a14.png";
    url[14] = "http://www.archive.org/download/ewza1/ewza1.pdf";


    //--------------------------------------
    title[15] = "التعليقات البازية على شرح الطحاوية ، عبد العزيز ابن باز";
    texts[15] = "التعليقات البازية على شرح الطحاوية ، عبد العزيز بن عبد الله بن باز ، أعده غزاي بن حمدان حسين الوهبي الأسلمي ، دار ابن الأثير ، الرياض ، ط 1 ، 1429 هـ / 2008 م ، مجلدان = 1288 صفحة.";
    imgs[15] = "/img/aqida/a15.png";
    url[15] = "http://archive.org/download/kkto0o1/kkto0o1.pdf";


    //--------------------------------------
    title[16] = "شرح العقيدة الطحاوية ، صالح آل الشيخ ";
    texts[16] = "شرح العقيدة الطحاوية(إتحاف السائل بما في الطحاوية من مسائل) ، صالح بن عبد العزيز بن محمد آل الشيخ ، خرج أحاديثه سليمان القاطوني ، دار المودة ، المنصورة / مصر ، ط 1 ، 1432 هـ / 2011 م ، مجلدان = 1210 صفحات.";
    imgs[16] = "/img/aqida/a16.png";
    url[16] = "http://archive.org/download/kktew1/kktew1.pdf";

    //------------------------------";
    title[17] = "تأسيس التقديس في كشف تلبيس داود بن جرجيس ، عبدالله أبابطين ، ت د. عبد السلام بن برجس";
    texts[17] = "تأسيس التقديس في كشف تلبيس داود بن جرجيس ، عبد الله بن عبد الرحمن أبابطين ، ت د.عبد السلام بن برجس العبد الكريم ، مؤسسة الرسالة ، بيروت ، ط 1 ، 1422 هـ / 2001 م ، 169 صفحة.";
    imgs[17] = "/img/aqida/a17.png";
    url[17] = "http://www.archive.org/download/trds2/trds2.pdf";


    //--------------------------------------
    title[18] = "الإلحاد الخميني في أرض الحرمين ، مقبل الوادعي";
    texts[18] = "الإلحاد الخميني في أرض الحرمين ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 3 ، 1428 هـ / 2007 م ، 336 صفحة";
    imgs[18] = "/img/aqida/a18.png";
    url[18] = "http://www.archive.org/download/gytr5555/gytr5555.pdf";



    //--------------------------------------
    title[19] = "شرح رسالة العبودية لشيخ الإسلام ابن تيمية - د. صالح الفوزان";
    texts[19] = "شرح رسالة العبودية لشيخ الإسلام ابن تيمية - د. صالح بن فوزان الفوزان ، اعتنى به وأعده للنشر فهد بن إبراهيم الفعيم ، دار ابن الجوزي ، السعودية ، ط 1 ، 1435 هـ ، 303 صفحات .";
    imgs[19] = "/img/aqida/a19.png";
    url[19] = "https://archive.org/download/dnbp7/dnbp7.pdf";


    //--------------------------------------
    title[20] = "تقريب التدمرية - محمد بن صالح العثيمين";
    texts[20] = "تقريب التدمرية - محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 1433 هـ ، 159 صفحة .";
    imgs[20] = "/img/aqida/a20.png";
    url[20] = "https://archive.org/download/crfp7/crfp7.pdf";

    //--------------------------------------
    title[21] = "مختارات من اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - محمد بن صالح العثيمين";
    texts[21] = "مختارات من اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 2 ، 1434 هـ ، 80 صفحة .";
    imgs[21] = "/img/aqida/a21.png";
    url[21] = "https://archive.org/download/kmbv2/kmbv2.pdf";


    //--------------------------------------
    title[22] = "شرح عقيدة الإمام المجدد محمد بن عبد الوهاب ، العلامة د. صالح بن فوزان الفوزان";
    texts[22] = "شرح عقيدة الإمام المجدد محمد بن عبد الوهاب ، العلامة د. صالح بن فوزان الفوزان ، مكتبة دار المنهاج ، الرياض ، ط 2 ، 1431 هــ .";
    imgs[22] = "/img/aqida/a22.png";
    url[22] = "http://www.archive.org/download/3aqeda_156/3aqeda.pdf";

    //--------------------------------------
    title[23] = "الرد الشافي على الجفري وبيان مخالفاته العقدية والمنهجية ، عادل الفريدان ، تقديم د. صالح الفوزان";
    texts[23] = "الرد الشافي على الجفري وبيان مخالفاته العقدية والمنهجية ، عادل الفريدان ، تقديم د. صالح الفوزان ، دار الإمام أحمد ، ط 1 ، 1426 هـ / 2005 م .";
    imgs[23] = "/img/aqida/a.png";
    url[23] = "http://www.archive.org/download/zaq24/zaq24.pdf";

    //--------------------------------------
    title[24] = "شرح العقيدة الواسطية  - عبد العزيز بن عبد الله الراجحي";
    texts[24] = "شرح العقيدة الواسطية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية  - عبد العزيز بن عبد الله الراجحي ، دار التوحيد للنشر ، الرياض ، ط 1 ، 1434 هـ ، 184 صفحة .";
    imgs[24] = "/img/aqida/a24.png";
    url[24] = "https://archive.org/download/htvf4/htvf4.pdf";


    //--------------------------------------
    title[25] = "شرح الكافية الشافية في الانتصار للفرقة الناجية (القصيدة النونية) للحافظ المحقق ابن قيم الجوزية - محمد بن صالح العثيمين";
    texts[25] = "شرح الكافية الشافية في الانتصار للفرقة الناجية للحافظ المحقق شمس الدين أبي عبد الله محمد بن أبي بكر ابن قيم الجوزية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1435 هـ ، 4 مجلدات مدمجة برابط واحد (الأول = 704 صفحات ، الثاني = 821 صفحة ، الثالث = 720 صفحة ، الرابع = 624 صفحة) .";
    imgs[25] = "/img/aqida/a25.png";
    url[25] = "https://archive.org/download/shmv4/shmv4.pdf";

    //--------------------------------------
    title[26] = "أين الله (دفاع عن حديث الجارية رواية ودراية) ـ سليم الهلالي";
    texts[26] = "أين الله (دفاع عن حديث الجارية رواية ودراية) ـ سليم الهلالي ، الدار السلفية ، حولي ، الكويت ، ط 1 ، 1408 هـ / 1988 م ، 111 صفحة ، (3.0 M) .";
    imgs[26] = "/img/aqida/a26.png";
    url[26] = "https://archive.org/download/tpvf4/tpvf4.pdf";

    //--------------------------------------
    title[27] = "شرح كشف الشبهات للإمام محمد بن عبد الوهاب التميمي ، صالح آل الشيخ ";
    texts[27] = "شرح كشف الشبهات لشيخ الإسلام محمد بن عبد الوهاب التميمي ، صالح بن عبد العزيز آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 463 صفحة .";
    imgs[27] = "/img/aqida/a27.png";
    url[27] = "https://archive.org/download/nhyv5/nhyv5.pdf";


    //--------------------------------------
    title[28] = "شرح ثلاثة الأصول للإمام محمد بن عبد الوهاب التميمي - صالح آل الشيخ";
    texts[28] = "شرح ثلاثة الأصول لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 267 صفحة .";
    imgs[28] = "/img/aqida/a28.png";
    url[28] = "https://archive.org/download/svbd4/svbd4.pdf";

    //--------------------------------------
    title[29] = "شرح القواعد الأربع للإمام محمد بن عبد الوهاب التميمي ، صالح آل الشيخ";
    texts[29] = "شرح القواعد الأربع لشيخ الإسلام محمد بن عبد الوهاب التميمي ، صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، القاهرة ، ط 1 ، 1433 هـ ، 47 صفحة .";
    imgs[29] = "/img/aqida/a29.png";
    url[29] = "https://archive.org/download/gtbv9/gtbv9.pdf";


    //--------------------------------------
    title[30] = "مطلع الفجر في فقه الزجر بالهجر ومعه بيان منهج السلف الصالح في معاملة أهل الأهواء والبدع وبذيله مذهب شيخ الإسلام ابن تيمية في الهجر ، سليم الهلالي ";
    texts[30] = "مطلع الفجر في فقه الزجر بالهجر ومعه بيان منهج السلف الصالح في معاملة أهل الأهواء والبدع وبذيله مذهب شيخ الإسلام ابن تيمية في الهجر ، سليم بن عيد الهلالي ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1426 هـ / 2005 م ، 192 صفحة ، 4.5 M .";
    imgs[30] = "/img/aqida/a30.png";
    url[30] = "https://archive.org/download/jvpn5/jvpn5.pdf";

    //--------------------------------------
    title[31] = "قرة العيون في تصحيح تفسير عبد الله بن عباس رضي الله عنهما لقوله تعالى ومن لم يحكم بما أنزل الله فأولئك هم الكافرون";
    texts[31] = "قرة العيون في تصحيح تفسير عبد الله بن عباس رضي الله عنهما لقوله تعالى : 'ومن لم يحكم بما أنزل الله فأولئك هم الكافرون' - رواية ودراية ورعاية - ، سليم بن عيد الهلالي ، مكتبة الفرقان ، عجمان ، الإمارات ، ط 1 ، 1422 هـ / 2001 م ، 259 صفحة ، 6.3 M .";
    imgs[31] = "/img/aqida/a31.png";
    url[31] = "https://archive.org/download/bkpv3/bkpv3.pdf";

    //--------------------------------------
    title[32] = "الصوفية في ميزان الكتاب والسنة - محمد بن جميل زينو";
    texts[32] = "الصوفية في ميزان الكتاب والسنة - محمد بن جميل زينو ، 64 صفحة ، 2.7 M .";
    imgs[32] = "/img/aqida/a32.png";
    url[32] = "https://archive.org/download/ftbt7/ftbt7.pdf";

    //--------------------------------------
    title[33] = "بيان وتحذير من كتاب عقيدة الإمام الحافظ ابن كثير جمع محمد عادل عزيزة - محمد بن جميل زينو";
    texts[33] = "بيان وتحذير من كتاب عقيدة الإمام الحافظ ابن كثير جمع محمد عادل عزيزة - محمد بن جميل زينو ، مكة المكرمة ، ط 1 ، 1414 هـ / 1994 م ، 34 صفحة ، 1.4 M .";
    imgs[33] = "/img/aqida/a33.png";
    url[33] = "https://archive.org/download/gujy6/gujy6.pdf";

    //--------------------------------------
    title[34] = "الواسطة بين الحق والخلق - شيخ الإسلام ابن تيمية ، تقديم محمد بن جميل زينو ، تمهيد محمود مهدي استانبولي";
    texts[34] = "الواسطة بين الحق والخلق - شيخ الإسلام ابن تيمية ، تقديم محمد بن جميل زينو ، تمهيد محمود مهدي استانبولي ، 36 صفحة .";
    imgs[34] = "/img/aqida/a34.png";
    url[34] = "https://archive.org/download/lkmg6/lkmg6.pdf";


    //--------------------------------------
    title[35] = "التحذير من فتنة الكفر والتكفير - محمد بن جميل زينو";
    texts[35] = "التحذير من فتنة الكفر والتكفير - محمد بن جميل زينو ، ط 2 ، 96 صفحة .";
    imgs[35] = "/img/aqida/a35.png";
    url[35] = "https://archive.org/download/pvgd5/pvgd5.pdf";

    //--------------------------------------
    title[36] = "أركان الإسلام والإيمان من الكتاب والسنة الصحيحة - محمد بن جميل زينو";
    texts[36] = "أركان الإسلام والإيمان من الكتاب والسنة الصحيحة - محمد بن جميل زينو ، ط 15 ، 128 صفحة ، 2.7 M .";
    imgs[36] = "/img/aqida/a36.png";
    url[36] = "https://archive.org/download/rpav5/rpav5.pdf";

    //--------------------------------------
    title[37] = "شهادة الإسلام (لا إله إلا الله محمد رسول الله) - محمد بن جميل زينو";
    texts[37] = "شهادة الإسلام (لا إله إلا الله محمد رسول الله) - محمد بن جميل زينو ، دار المحمدي ، جدة ، ط 1 ، 1417 هـ / 1996 م ، 84 صفحة ، 2.8 M .";
    imgs[37] = "/img/aqida/a37.png";
    url[37] = "https://archive.org/download/xpkn6/xpkn6.pdf";

    //--------------------------------------
    title[38] = "خذ عقيدتك من الكتاب والسنة الصحيحة - محمد بن جميل زينو";
    texts[38] = "خذ عقيدتك من الكتاب والسنة الصحيحة - محمد بن جميل زينو ، 31 صفحة .";
    imgs[38] = "/img/aqida/a38.png";
    url[38] = "https://archive.org/download/vpmn3/vpmn3.pdf";

    //--------------------------------------
    title[39] = "منهاج الفرقة الناجية والطائفة المنصورة - محمد بن جميل زينو";
    texts[39] = "منهاج الفرقة الناجية والطائفة المنصورة - محمد بن جميل زينو ، ط 10 ، 143 صفحة ، 2.5 M .";
    imgs[39] = "/img/aqida/a39.png";
    url[39] = "https://archive.org/download/cvgm8/cvgm8.pdf";

    //--------------------------------------
    title[40] = "كيف اهتديت إلى التوحيد والصراط المستقيم - محمد بن جميل زينو";
    texts[40] = "كيف اهتديت إلى التوحيد والصراط المستقيم - محمد بن جميل زينو ، دار الفتح ، الشارقة ، الإمارات ، ط 1 ، 1416 هـ / 1995 م ، 96 صفحة ، 2.3 M .";
    imgs[40] = "/img/aqida/a40.png";
    url[40] = "https://archive.org/download/vgtm5/vgtm5.pdf";


    //--------------------------------------
    title[41] = "فتاوى الأئمة في النوازل المدلهمة وتبرئة دعوة وأتباع محمد بن عبد الوهاب من تهمة التطرف والإرهاب - محمد القحطاني ، تقديم سماحة مفتي عام السعودية عبد العزيز آل الشيخ ، تقديم ومراجعة وتصحيح د. صالح الفوزان";
    texts[41] = "فتاوى الأئمة في النوازل المدلهمة وتبرئة دعوة وأتباع محمد بن عبد الوهاب من تهمة التطرف والإرهاب - جمع وترتيب محمد بن حسين بن سعيد آل سفران القحطاني ، تقديم سماحة مفتي عام المملكة العربية السعودية الشيخ عبد العزيز بن عبد الله بن محمد آل الشيخ ، تقديم ومراجعة وتصحيح معالي الشيخ العلامة الدكتور صالح بن فوزان الفوزان ، شركة دار الأوفياء للطباعة والنشر ، الرياض ، 1424 هـ / 2003 م ، 330 صفحة ، 4.8 M .";
    imgs[41] = "/img/aqida/a41.png";
    url[41] = "https://archive.org/download/gtmp6/gtmp6.pdf";

    //--------------------------------------
    title[42] = "فتوى اللجنة الدائمة للبحوث العلمية والإفتاء بالمملكة العربية السعودية حول الماسونية - علق عليها محمد بن إبراهيم";
    texts[42] = "فتوى اللجنة الدائمة للبحوث العلمية والإفتاء بالمملكة العربية السعودية حول الماسونية - علق عليها محمد بن إبراهيم ، مكتبة العقيدة الإسلامية ، القاهرة ، ط 1 ، 1435 هـ / 2014 م ، 28 صفحة ، 0.5 M ، إهداء من أخِ كريمِ - جزاه الله خيراً - .";
    imgs[42] = "/img/aqida/a42.png";
    url[42] = "https://archive.org/download/z0d11/z0d11.pdf";

    //--------------------------------------
    title[43] = "القرآن والسنة عقيدة سلف الأمة - د. محمد بن خليل هراس ";
    texts[43] = "القرآن والسنة عقيدة سلف الأمة - د. محمد بن خليل هراس ، دار الشريعة ، القاهرة ، ط 1 ، 1424 هـ / 2004 م ، 63 صفحة ، 2.1 M .";
    imgs[43] = "/img/aqida/a43.png";
    url[43] = "https://archive.org/download/a625n/a625n.pdf";

    //--------------------------------------
    title[44] = "تبصير الأنام بشرح نواقض الإسلام لمحمد بن عبد الوهاب - عبد العزيز الراجحي";
    texts[44] = "تبصير الأنام بشرح نواقض الإسلام لشيخ الإسلام محمد بن عبد الوهاب - عبد العزيز بن عبد الله الراجحي ، دار النوادر ، الدار البيضاء ، المغرب ، الدار الأثرية ، القاهرة ، ط 1 ، 1431 هـ / 2010 م ، 61 صفحة ، 1.7 M .";
    imgs[44] = "/img/aqida/a44.png";
    url[44] = "https://archive.org/download/a622n/a622n.pdf";

    //--------------------------------------
    title[45] = "تيسير العزيز الحميد شرح كتاب التوحيد للإمام المجدد محمد بن عبد الوهاب - سليمان بن عبد الله بن محمد بن عبد الوهاب ، تعليق عبد العزيز الراجحي ";
    texts[45] = "تيسير العزيز الحميد شرح كتاب التوحيد الذي هو حق الله على العبيد للإمام المجدد محمد بن عبد الوهاب - سليمان بن عبد الله بن محمد بن عبد الوهاب ،تعليق عبد العزيز بن عبد الله الراجحي ، دار العاصمة ، الرياض ، ط 1 ، 1434 هـ / 2013 م ، 848 صفحة ، 16.7 M ، (عنوان الكتاب - في الأصل - به خطأ ، فأجرينا عليه تعديلاً) .";
    imgs[45] = "/img/aqida/a45.png";
    url[45] = "https://archive.org/download/a618n/a618n.pdf";


    //--------------------------------------
    title[46] = "الدرة العثيمينية بشرح فتح رب البرية بتلخيص الحموية - محمد بن صالح العثيمين";
    texts[46] = "الدرة العثيمينية بشرح فتح رب البرية بتلخيص الحموية - محمد بن صالح العثيمين ، أعده غزاي بن حمدان الأسلمي ، فهد بن أحمد بن مبارك الغامدي ، مكتبة الإمام الذهبي ، الكويت ، ط 2 ، 1433 هـ / 2012 م ، 554 صفحة ، 9 M .";
    imgs[46] = "/img/aqida/a46.png";
    url[46] = "https://archive.org/download/a611n/a611n.pdf";


    //--------------------------------------
    title[47] = "تعليقات سماحة الشيخ عبد العزيز ابن باز على الرسالة الحموية الكبرى لشيخ الإسلام ابن تيمية";
    texts[47] = "تعليقات سماحة الشيخ العلامة عبد العزيز بن عبد الله بن باز على الرسالة الحموية الكبرى لشيخ الإسلام ابن تيمية رحمه الله تعالى ، مدار الوطن للنشر ، الرياض ، ط 1 ، 1435 هـ / 2014 م ، 258 صفحة ، 5.6 M .";
    imgs[47] = "/img/aqida/a47.png";
    url[47] = "https://archive.org/download/a696n/a696n.pdf";

    //--------------------------------------
    title[48] = "فرقة الأحباش أصولها وفروعها - دراسة نقدية ، د. صالح العصيمي";
    texts[48] = "فرقة الأحباش أصولها وفروعها - دراسة نقدية ، د. صالح بن مقبل بن عبد الله العصيمي ، دار الصميعي ، الرياض ، ط 1 ، 1436 هـ / 2015 م ، 93 صفحة ، 2 M .";
    imgs[48] = "/img/aqida/a48.png";
    url[48] = "https://archive.org/download/a923n/a923n.pdf";

    //--------------------------------------
    title[49] = "فضائل أهل بيت النبوة - مقبل الوادعي";
    texts[49] = "فضائل أهل بيت النبوة - مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 1 ، 1432 هـ / 2011 م ، 80 صفحة ، 1 M .";
    imgs[49] = "/img/aqida/a49.png";
    url[49] = "https://archive.org/download/a888n/%D9%81%D8%B6%D8%A7%D8%A6%D9%84%20%D8%A3%D9%87%D9%84%20%D8%A8%D9%8A%D8%AA%20%D8%A7%D9%84%D9%86%D8%A8%D9%88%D8%A9%20-%20%D9%85%D9%82%D8%A8%D9%84%20%D8%A7%D9%84%D9%88%D8%A7%D8%AF%D8%B9%D9%8A%20pdf.pdf";

    //--------------------------------------
    title[50] = "اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - شيخ الإسلام ابن تيمية ـ ت الحرستاني والزغلي";
    texts[50] = "اقتضاء الصراط المستقيم مخالفة أصحاب الجحيم - شيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية ـ حققه وخرج أحاديثه وعلق عليه عصام فارس الحرستاني ، محمد إبراهيم الزغلي ، دار الجيل ، بيروت ، ط 1 ، 1413 هـ / 1993 م ، 544 صفحة ، 10 M .";
    imgs[50] = "/img/aqida/a50.png";
    url[50] = "https://archive.org/download/a1015n/a1015n.pdf";


    //--------------------------------------
    title[51] = "أبواب وفصول في عقيدة أهل السنة والجماعة للعلامة الشيخ مقبل بن هادي الوادعي - محمد بن إبراهيم ";
    texts[51] = "أبواب وفصول في عقيدة أهل السنة والجماعة للعلامة الشيخ مقبل بن هادي الوادعي - رتبها واعتنى بها محمد بن إبراهيم المصري، مكتبة الإمام مسلم ، 1439 هـ / 2017 م ، 365 ص ، 10 M ، (إهداء من المؤلف - نفع الله به ، وجزاه خيراً - وقد قمنا بتنسيقه) .";
    imgs[51] = "/img/aqida/a51.png";
    url[51] = "https://archive.org/download/gpmt7/gpmt7.pdf";

    //--------------------------------------
    title[52] = "شرح عقيدة أهل السنة والجماعة - محمد بن صالح العثيمين";
    texts[52] = "شرح عقيدة أهل السنة والجماعة - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 549 صفحة ، 12 M .";
    imgs[52] = "/img/aqida/a52.png";
    url[52] = "https://archive.org/download/a874n/a874n.pdf";


    //--------------------------------------
    title[53] = "فتاوى العقيدة (أسئلة هامة ملحة وأجوبة نافعة في العقيدة الصحيحة) - محمد بن صالح العثيمين";
    texts[53] = "فتاوى العقيدة (أسئلة هامة ملحة وأجوبة نافعة في العقيدة الصحيحة) - محمد بن صالح العثيمين ، دار الجيل ، بيروت ، مكتبة السنة ، القاهرة ، ط 2 ، 1414 هـ / 1993 م ، 815 صفحة ، 12 M .";
    imgs[53] = "/img/aqida/a53.png";
    url[53] = "https://archive.org/download/a823n/a823n.pdf";


    //--------------------------------------
    title[54] = "المختار من أحاديث سيد الأبرار في المعتقد الصحيح - محمد بن علي بن حزام الفضلي البعداني";
    texts[54] = "المختار من أحاديث سيد الأبرار في المعتقد الصحيح - محمد بن علي بن حزام الفضلي البعداني ، مكتبة الفلاح ، دار كنوز دماج ، اليمن ، ط 1 ، 1432 هـ / 2011 م ، 155 صفحة ، 5.3 M .";
    imgs[54] = "/img/aqida/a55.png";
    url[54] = "https://archive.org/download/tmxn6/tmxn6.pdf";

    title[55] = "شرح فضل الإسلام - صالح آل الشيخ";
    texts[55] = "شرح فضل الإسلام لشيخ الإسلام محمد بن عبد الوهاب التميمي - صالح بن عبد العزيز بن محمد آل الشيخ ، تحقيق وعناية عادل بن محمد مرسي رفاعي ، مكتبة دار الحجاز ، مصر ، ط 1 ، 1433 هـ ، 416 صفحة .";
    imgs[55] = "/img/aqida/a.png";
    url[55] = "https://archive.org/download/vcnf4/vcnf4.pdf";





    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


