//====================================================================================================================
//  كتب اللغة
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[] = "الفتوحات الربانية على القصيدة الصبانية - محمد الأمين الهرري";
    texts[] = "الفتوحات الربانية على القصيدة الصبانية المسمى فتح الجواد المنان على منظومة الصبان - جمع وتأليف محمد الأمين بن عبد الله بن يوسف بن حسن الأرمي العلوي الأثيوبي الهرري الكري البويطي ، دار المنهاج ، جدة ، دار طوق النجاة ، بيروت ، ط 1 ، 1437 هـ / 2016 م ، 447 ص ، 5 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1757n/a1757n.pdf";

    //--------------------------------------------------------------------------
    title[] = "جواهر التعليمات في حل وفك معاني ومباني التقريظات - محمد الأمين الهرري ";
    texts[] = "جواهر التعليمات في حل وفك معاني ومباني التقريظات - جمع وتأليف محمد الأمين بن عبد الله بن يوسف بن حسن الأرمي العلوي الأثيوبي الهرري الكري البويطي ، دار المنهاج ، جدة ، دار طوق النجاة ، بيروت ، ط 1 ، 1432 هـ / 2011 م ، 271 ص ، 5 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1754n/a1754n.pdf";

    //--------------------------------------------------------------------------
    title[] = "صناعة التفكير اللغوي - تحرير مقبل الدعدي";
    texts[] = "صناعة التفكير اللغوي - د. أحمد بن جار الله الزهراني ،  أ.د. صالح بن سعيد الزهراني ، د. عبد الله بن محمد المسملي ، أبو مالك العوضي ، أ.د. سليمان بن إبراهيم العايد ، تحرير مقبل بن علي الدعدي ، تكوين للدراسات والأبحاث ، الخبر ، السعودية ، ط 1 ، 1435 هـ / 2014 م ، 223 ص ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1709n/a1709n.pdf";

    //--------------------------------------------------------------------------
    title[] = "معجم أسماء سيوف العرب وأصحابها ، د. زيد عبد الله الزيد";
    texts[] = "معجم أسماء سيوف العرب وأصحابها (معانيها ، ما قيل فيها أو في أسمائها من الشعر والنثر القديم) ، د. زيد عبد الله الزيد ، مؤسسة الرسالة ، بيروت ، الدارة العامرة ، دمشق ، 1430 هـ / 2009 م ، 208 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/ubran/ubran.pdf";

    //--------------------------------------------------------------------------
    title[] = "تسهيل البلاغة ، فيصل بن عبده قائد الحاشدي";
    texts[] = "تسهيل البلاغة ، فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 160 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/yerf31/yerf31.pdf";

    //--------------------------------------------------------------------------
    title[] = "مختصر مغني اللبيب عن كتب الأعاريب لابن هشام الأنصاري - محمد بن صالح العثيمين";
    texts[] = "مختصر مغني اللبيب عن كتب الأعاريب لابن هشام الأنصاري - محمد بن صالح العثيمين ، مكتبة الرشد ، الرياض ، ط 3 ، 1433 هـ / 2012 م ، 217 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/nhvf3/nhvf3.pdf";


    //--------------------------------------------------------------------------
    title[] = "شرح ألفية ابن مالك - محمد بن صالح العثيمين (3 مجلدات)";
    texts[] = "شرح ألفية ابن مالك - محمد بن صالح العثيمين ، مكتبة الرشد ، السعودية ، ط 1 ، 1434 هـ ، 3 مجلدات مدمجة برابط واحد  (الأول = 622 صفحة ، الثاني = 571 صفحة ، الثالث = 727 صفحة) .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/hlgv8/hlgv8.pdf";



    //--------------------------------------------------------------------------
    title[] = "شرح البلاغة من كتاب قواعد اللغة العربية - محمد بن صالح العثيمين ";
    texts[] = "شرح البلاغة من كتاب قواعد اللغة العربية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 391 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/sbcg6/sbcg6.pdf";

    //--------------------------------------------------------------------------
    title[] = "متن قطر الندى وبل الصدى - ابن هشام  (ط. دار السلام)";
    texts[] = "متن قطر الندى وبل الصدى - عبد الله بن يوسف بن أحمد بن هشام ، دار السلام ، القاهرة ، الإسكندرية ، ط 5 ، 1433 هـ / 2012 م ، 94 صفحة ، 1.2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a546n/a546n.pdf";

    //--------------------------------------------------------------------------
    title[] = "الممتع في شرح الآجرّومية - مالك المهذري";
    texts[] = "الممتع في شرح الآجرومية - مالك بن سالم بن مطر المهذري ، تقديم مقبل بن هادي الوادعي ، مكتبة دار الحديث ، دماج ، صنعاء ، مكتبة الإمام مسلم ، ط 9 ، 1435 هـ ، 221 صفحة ، 4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a947n/a947n.pdf";







    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


