//====================================================================================================================
//  كتب اللغة
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[0] = "الفتوحات الربانية على القصيدة الصبانية - محمد الأمين الهرري";
    texts[0] = "الفتوحات الربانية على القصيدة الصبانية المسمى فتح الجواد المنان على منظومة الصبان - جمع وتأليف محمد الأمين بن عبد الله بن يوسف بن حسن الأرمي العلوي الأثيوبي الهرري الكري البويطي ، دار المنهاج ، جدة ، دار طوق النجاة ، بيروت ، ط 1 ، 1437 هـ / 2016 م ، 447 ص ، 5 M .";
    imgs[0] = "/img/arabic/a0.png";
    url[0] = "https://archive.org/download/a1757n/a1757n.pdf";

    //--------------------------------------------------------------------------
    title[1] = "جواهر التعليمات في حل وفك معاني ومباني التقريظات - محمد الأمين الهرري ";
    texts[1] = "جواهر التعليمات في حل وفك معاني ومباني التقريظات - جمع وتأليف محمد الأمين بن عبد الله بن يوسف بن حسن الأرمي العلوي الأثيوبي الهرري الكري البويطي ، دار المنهاج ، جدة ، دار طوق النجاة ، بيروت ، ط 1 ، 1432 هـ / 2011 م ، 271 ص ، 5 M .";
    imgs[1] = "/img/arabic/a1.png";
    url[1] = "https://archive.org/download/a1754n/a1754n.pdf";

    //--------------------------------------------------------------------------
    title[2] = "صناعة التفكير اللغوي - تحرير مقبل الدعدي";
    texts[2] = "صناعة التفكير اللغوي - د. أحمد بن جار الله الزهراني ،  أ.د. صالح بن سعيد الزهراني ، د. عبد الله بن محمد المسملي ، أبو مالك العوضي ، أ.د. سليمان بن إبراهيم العايد ، تحرير مقبل بن علي الدعدي ، تكوين للدراسات والأبحاث ، الخبر ، السعودية ، ط 1 ، 1435 هـ / 2014 م ، 223 ص ، 3 M .";
    imgs[2] = "/img/arabic/a2.png";
    url[2] = "https://archive.org/download/a1709n/a1709n.pdf";

    //--------------------------------------------------------------------------
    title[3] = "معجم أسماء سيوف العرب وأصحابها ، د. زيد عبد الله الزيد";
    texts[3] = "معجم أسماء سيوف العرب وأصحابها (معانيها ، ما قيل فيها أو في أسمائها من الشعر والنثر القديم) ، د. زيد عبد الله الزيد ، مؤسسة الرسالة ، بيروت ، الدارة العامرة ، دمشق ، 1430 هـ / 2009 م ، 208 صفحات .";
    imgs[3] = "/img/arabic/a3.png";
    url[3] = "http://archive.org/download/ubran/ubran.pdf";

    //--------------------------------------------------------------------------
    title[4] = "تسهيل البلاغة ، فيصل بن عبده قائد الحاشدي";
    texts[4] = "تسهيل البلاغة ، فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 160 صفحة .";
    imgs[4] = "/img/arabic/a4.png";
    url[4] = "http://www.archive.org/download/yerf31/yerf31.pdf";

    //--------------------------------------------------------------------------
    title[5] = "مختصر مغني اللبيب عن كتب الأعاريب لابن هشام الأنصاري - محمد بن صالح العثيمين";
    texts[5] = "مختصر مغني اللبيب عن كتب الأعاريب لابن هشام الأنصاري - محمد بن صالح العثيمين ، مكتبة الرشد ، الرياض ، ط 3 ، 1433 هـ / 2012 م ، 217 صفحة .";
    imgs[5] = "/img/arabic/a5.png";
    url[5] = "https://archive.org/download/nhvf3/nhvf3.pdf";


    //--------------------------------------------------------------------------
    title[6] = "شرح ألفية ابن مالك - محمد بن صالح العثيمين (3 مجلدات)";
    texts[6] = "شرح ألفية ابن مالك - محمد بن صالح العثيمين ، مكتبة الرشد ، السعودية ، ط 1 ، 1434 هـ ، 3 مجلدات مدمجة برابط واحد  (الأول = 622 صفحة ، الثاني = 571 صفحة ، الثالث = 727 صفحة) .";
    imgs[6] = "/img/arabic/a6.png";
    url[6] = "https://archive.org/download/hlgv8/hlgv8.pdf";



    //--------------------------------------------------------------------------
    title[7] = "شرح البلاغة من كتاب قواعد اللغة العربية - محمد بن صالح العثيمين ";
    texts[7] = "شرح البلاغة من كتاب قواعد اللغة العربية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 391 صفحة .";
    imgs[7] = "/img/arabic/a7.png";
    url[7] = "https://archive.org/download/sbcg6/sbcg6.pdf";

    //--------------------------------------------------------------------------
    title[8] = "متن قطر الندى وبل الصدى - ابن هشام  (ط. دار السلام)";
    texts[8] = "متن قطر الندى وبل الصدى - عبد الله بن يوسف بن أحمد بن هشام ، دار السلام ، القاهرة ، الإسكندرية ، ط 5 ، 1433 هـ / 2012 م ، 94 صفحة ، 1.2 M .";
    imgs[8] = "/img/arabic/a8.png";
    url[8] = "https://archive.org/download/a546n/a546n.pdf";

    //--------------------------------------------------------------------------
    title[9] = "الممتع في شرح الآجرّومية - مالك المهذري";
    texts[9] = "الممتع في شرح الآجرومية - مالك بن سالم بن مطر المهذري ، تقديم مقبل بن هادي الوادعي ، مكتبة دار الحديث ، دماج ، صنعاء ، مكتبة الإمام مسلم ، ط 9 ، 1435 هـ ، 221 صفحة ، 4 M .";
    imgs[9] = "/img/arabic/a9.png";
    url[9] = "https://archive.org/download/a947n/a947n.pdf";


    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


