//====================================================================================================================
//  كتب منوعة
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[0] = "المصارعة ، مقبل الوادعي";
    texts[0] = "المصارعة ، مقبل بن هادي الوادعي ، مكتبة الإمام مالك ، ط 1 ، 1413 هـ / 1992 م ، 548 صفحة .";
    imgs[0] = "./img/coctel/a0.png";
    url[0] = "http://www.archive.org/download/kjurc/kjurc.pdf";

    //--------------------------------------------------------------------------
    title[1] = "الصفحات الناضرة في الأبيات الحاصرة ، د. عبد السلام بن برجس آل عبد الكريم";
    texts[1] = "الصفحات الناضرة في الأبيات الحاصرة ، د. عبد السلام بن برجس آل عبد الكريم ، دار الصميعي ، الرياض ، ط 1 ، 1412 هـ / 1991 م ، 321 صفحة .";
    imgs[1] = "./img/coctel/a1.png";
    url[1] = "http://www.archive.org/download/ssaa3/ssaa3.pdf";


    //--------------------------------------------------------------------------
    title[2] = "تحفة المجيب على أسئلة الحاضر والغريب ، مقبل بن هادي الوادعي ";
    texts[2] = "تحفة المجيب على أسئلة الحاضر والغريب ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 1 ، 1421 هـ / 2000 م ، 504 صفحات .";
    imgs[2] = "./img/coctel/a2.png";
    url[2] = "http://www.archive.org/download/frrty/frrty.pdf";

    //--------------------------------------------------------------------------
    title[3] = "قرة العين في أجوبة قائد العلابي وصاحب العدين ، مقبل بن هادي الوادعي";
    texts[3] = "قرة العين في أجوبة قائد العلابي وصاحب العدين ، مقبل بن هادي الوادعي ، مكتبة دار القدس ، صنعاء ، ط 1 ، 1411 هـ / 1991 م ، 89 صفحة .";
    imgs[3] = "./img/coctel/a3.png";
    url[3] = "http://www.archive.org/download/pliuk/pliuk.pdf";

    //--------------------------------------------------------------------------
    title[4] = "مقتل الشيخ جميل الرحمن الأفغاني ومعه ( حول كلمة وهابي ) ، مقبل بن هادي الوادعي";
    texts[4] = "مقتل الشيخ جميل الرحمن الأفغاني ومعه ( حول كلمة وهابي ) ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 2 ، 1421 هـ / 2000 م ، 102 صفحة .";
    imgs[4] = "./img/coctel/a4.png";
    url[4] = "http://www.archive.org/download/ghu12/ghu12.pdf";


    //--------------------------------------------------------------------------
    title[5] = "فضائح ونصائح ، مقبل بن هادي الوادعي";
    texts[5] = "فضائح ونصائح ، مقبل بن هادي الوادعي ، دار الحرمين ، القاهرين ، ط 1 ، 1419 هـ / 1999 م ، 288 صفحة .";
    imgs[5] = "./img/coctel/a5.png";
    url[5] = "http://www.archive.org/download/saer6/saer6.pdf";

    //--------------------------------------------------------------------------
    title[6] = "المنتقى من فرائد الفوائد ، محمد بن صالح العثيمين";
    texts[6] = "المنتقى من فرائد الفوائد ، محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 1424 هـ ، 264 صفحة .";
    imgs[6] = "./img/coctel/a6.png";
    url[6] = "http://www.archive.org/download/xfty6/xfty6.pdf";

    //--------------------------------------------------------------------------
    title[7] = "الباعث على شرح الحوادث ، مقبل بن هادي الوادعي ";
    texts[7] = "الباعث على شرح الحوادث ، مقبل بن هادي الوادعي ، مكتبة صنعاء الأثرية ، صنعاء ، ط 2 ، 1425 هـ / 2004 م ، 127 صفحة .";
    imgs[7] = "./img/coctel/a7.png";
    url[7] = "http://www.archive.org/download/erbok/erbok.pdf";

    //--------------------------------------------------------------------------
    title[8] = "الفوائد العلمية من الدروس البازية - دروس علمية شرحها سماحة الشيخ ابن باز   (8 مجلدات مدمجة برابط واحد ، تتضمن 10 أجزاء)";
    texts[8] = "الفوائد العلمية من الدروس البازية - دروس علمية شرحها سماحة الشيخ العلامة عبد العزيز بن عبد الله بن باز ، راجعه وقدم له معالي الشيخ العلامة صالح بن فوزان الفوزان ، اعتنى بإخراجه وأشرف على طبعه عبد السلام بن عبد الله السليمان ، دار الرسالة العالمية ، دمشق ، بيروت ، ط 1 ، 1430 هـ / 2009 م ، (8 مجلدات مدمجة برابط واحد ، تتضمن 10 أجزاء) ، (64.2 M) .";
    imgs[8] = "./img/coctel/a8.png";
    url[8] = "https://archive.org/download/gbyv1/gbyv1.pdf";






    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


