//====================================================================================================================
//  كتب الفقه
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================


    title[0] = "اللقاءات الشهرية - ابن عثيمين";
    texts[0] = "اللقاءات الشهرية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 4 مجلدات مدمجة برابط واحد (الأول = 639 ص ، الثاني = 695 ص ، الثالث = 758 ص ، الرابع = 605 ص) ، 56 M .";
    imgs[0] = "/img/figh/a0.png";
    url[0] = "https://archive.org/download/a1648n/a1648n.pdf";



    title[1] = "الدروس الفقهية من المحاضرات الجامعية - ابن عثيمين";
    texts[1] = "الدروس الفقهية من المحاضرات الجامعية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1438 هـ ، 3 مجلدات مدمجة برابط واحد ( الأول = 767 ص ، الثاني = 648 ص ، الثالث = 848 ص ) ، 48 M .";
    imgs[1] = "/img/figh/a1.png";
    url[1] = "https://archive.org/download/a1647n/a1647n.pdf";

    title[2] = " فتاوى سؤال على الهاتف - ابن عثيمين";
    texts[2] = "فتاوى سؤال على الهاتف - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، مجلدان مدمجان برابط واحد (الأول = 1055 ص ، الثاني = 912 ص) ، 41 M .";
    imgs[2] = "/img/figh/a2.png";
    url[2] = "https://archive.org/download/a1646n/a1646n.pdf";


    title[3] = "فتاوى على الطريق - ابن عثيمين";
    texts[3] = "فتاوى على الطريق في مسائل متنوعة -  محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 1004 ص ، 19 M .";
    imgs[3] = "/img/figh/a3.png";
    url[3] = "https://archive.org/download/a1645n/a1645n.pdf";

    title[4] = "لقاءات وفتاوى الأقليات المسلمة - ابن عثيمين";
    texts[4] = "لقاءات وفتاوى الأقليات المسلمة - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1440 هـ ، 758 ص ، 17 M .";
    imgs[4] = "/img/figh/a4.png";
    url[4] = "https://archive.org/download/a1644n/a1644n.pdf";

    //--------------------------------------------------------------------------
    title[5] = "التعليق على الروض المربع - ابن عثيمين";
    texts[5] = "التعليق على الروض المربع للشيخ العلامة المحقق أبي السعادات منصور بن يونس البهوتي الحنبلي - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 761 ص ، الثاني = 724 ص) ، 30 M .";
    imgs[5] = "/img/figh/a5.png";
    url[5] = "https://archive.org/download/a1641n/a1641n.pdf";


    //--------------------------------------------------------------------------
    title[6] = "تعليقات على الاختيارات الفقهية - ابن عثيمين";
    texts[6] = "تعليقات على الاختيارات الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 579 ص ، 11 M .";
    imgs[6] = "/img/figh/a6.png";
    url[6] = "https://archive.org/download/a1638n/a1638n.pdf";


    //--------------------------------------------------------------------------
    title[7] = "التعليق على القواعد النورانية الفقهية - ابن عثيمين";
    texts[7] = "التعليق على القواعد النورانية الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 701 ص ، 15 M .";
    imgs[7] = "/img/figh/a7.png";
    url[7] = "https://archive.org/download/a1637n/a1637n.pdf";

    //--------------------------------------------------------------------------
    title[8] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد الشثري";
    texts[8] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد بن ناصر الشثري ، تخريج عبد الله بن عمر بن طاهر ، دار إشبيليا ، الرياض ، ط 2 ، 1426 هـ / 2005 م ، 159 صفحة .";
    imgs[8] = "/img/figh/a8.png";
    url[8] = "http://archive.org/download/monrl/monrl.pdf";

    //--------------------------------------------------------------------------
    title[9] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، ( ط. دار ابن الجوزي ) ";
    texts[9] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1433 هـ ، 871 صفحة .";
    imgs[9] = "/img/figh/a9.png";
    url[9] = "http://archive.org/download/vftbn/vftbn.pdf";

    //--------------------------------------------------------------------------
    title[10] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ";
    texts[10] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، ط 1 ، 1427 هـ ، 504 صفحات .";
    imgs[10] = "/img/figh/a10.png";
    url[10] = "http://www.archive.org/download/bhqrn/bhqrn.pdf";


    //--------------------------------------------------------------------------
    title[11] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد العجمي ";
    texts[11] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد بن سعود بن عامر العجمي ، ط 5 ، 1430 هـ .";
    imgs[11] = "/img/figh/a11.png";
    url[11] = "http://www.archive.org/download/tyrbs19/tyrbs19.pdf";

    //--------------------------------------------------------------------------
    title[12] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين";
    texts[12] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين ، إصدارات مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، عنيزة / السعودية ، ط 1 ، 1428 هـ ، 405 صفحات .";
    imgs[12] = "/img/figh/a12.png";
    url[12] = "http://archive.org/download/lmuyt/lmuyt.pdf";

    //--------------------------------------------------------------------------
    title[13] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان";
    texts[13] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان ، دار الصميعي ، الرياض ، ط 2 ، 1433 هـ / 2012 م ، 255 صفحة .";
    imgs[13] = "/img/figh/a13.png";
    url[13] = "http://archive.org/download/gtryn/gtryn.pdf";

    //--------------------------------------------------------------------------
    title[14] = "شرح مختصر روضة الناظر للطوفي ، د. سعد بن ناصر الشثري (مجلدان)";
    texts[14] = "شرح مختصر روضة الناظر لنجم الدين أبي الربيع سليمان بن عبد القوي الطوفي ت 716 هـ ، تأليف د. سعد بن ناصر الشثري ، مجلدان = 1053 صفحة ، دار التدمرية ، الرياض ، ط 1 ، 1431 هـ / 2010 م .";
    imgs[14] = "/img/figh/a14.png";
    url[14] = "http://www.archive.org/download/M-rawda/M-rawda.pdf";

    //--------------------------------------------------------------------------
    title[15] = "المسح على الخفين المنخرقين ، ابن تيمية ت سفيان بن عايش و فارس مشعل";
    texts[15] = "المسح على الخفين المنخرقين ، ابن تيمية ت سفيان بن عايش ، فراس مشعل ، الدار العثمانيّة ، عمّان ، ط 1 ، 1425 هـ / 2005 م .";
    imgs[15] = "/img/figh/a15.png";
    url[15] = "http://www.archive.org/download/almas7_7/almas7.pdf";

    //--------------------------------------------------------------------------
    title[16] = "شرح الورقات في أصول الفقه ـ د . سعد بن ناصر الشثري";
    texts[16] = "شرح الورقات في أصول الفقه ـ لفضيلة الشيخ د . سعد بن ناصر الشثري ـ اعتنى به وخرّج أحاديثه عبد الناصر البشبيشي ـ دار كنوز إشبيليا ـ الرياض ـ ط 1 ، 1425 هــ ـ 2004 م ـ 196 صفحة ـ";
    imgs[16] = "/img/figh/a16.png";
    url[16] = "http://www.archive.org/download/tgij7/hbp84.pdf";

    //--------------------------------------------------------------------------
    title[17] = "مختارات من الطرق الحكمية في السياسة الشرعية - محمد بن صالح العثيمين";
    texts[17] = "مختارات من الطرق الحكمية في السياسة الشرعية - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 120 صفحة .";
    imgs[17] = "/img/figh/a17.png";
    url[17] = "https://archive.org/download/vgtm6/vgtm6.pdf";

    //--------------------------------------------------------------------------
    title[18] = "مختارات من إعلام الموقعين عن رب العالمين  -  محمد بن صالح العثيمين ";
    texts[18] = "مختارات من إعلام الموقعين عن رب العالمين  -  محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، ط 2 ، 1434 هـ ، 264 صفحة .";
    imgs[18] = "/img/figh/a18.png";
    url[18] = "https://archive.org/download/ytbf5/ytbf5.pdf";


    //--------------------------------------------------------------------------
    title[19] = "منظومة أصول الفقه وقواعده (النظم والشرح) - محمد بن صالح العثيمين";
    texts[19] = "منظومة أصول الفقه وقواعده (النظم والشرح) - محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1434 هـ ، 384 صفحة .";
    imgs[19] = "/img/figh/a19.png";
    url[19] = "https://archive.org/download/bygv7/bygv7.pdf";

    //--------------------------------------------------------------------------
    title[20] = "شرح مختصر التحرير - محمد بن صالح العثيمين ";
    texts[20] = "شرح مختصر التحرير - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 816 صفحة .";
    imgs[20] = "/img/figh/a20.png";
    url[20] = "https://archive.org/download/nhxv8/nhxv8.pdf";

    //--------------------------------------------------------------------------
    title[21] = "العلماء الذين لهم إسهام في علم الأصول والقواعد الفقهية من عام 1300 - 1375 هـ  - د. سعد بن ناصر الشثري";
    texts[21] = "العلماء الذين لهم إسهام في علم الأصول والقواعد الفقهية من عام 1300 - 1375 هـ  - د. سعد بن ناصر الشثري ، دار إشبيليا ، الرياض ، ط 1 ، 1425 هـ / 2004 م ، 98 صفحة .";
    imgs[21] = "/img/figh/a21.png";
    url[21] = "https://archive.org/download/omju9/omju7.pdf";


    //--------------------------------------------------------------------------
    title[22] = "سجود السهو في ضوء السنة المطهرة - أ.د. عبد الله الطيار ، قرأه وعلق عليه ابن باز ";
    texts[22] = "سجود السهو في ضوء السنة المطهرة (موضحاً بالأمثلة : حكمه ، حكمته ، صفته ، أسبابه ، أقسامه) - أ.د. عبد الله بن محمد بن أحمد الطيار ، قرأه وعلق عليه سماحة الشيخ عبد العزيز ابن باز ، ويشتمل على رسالة سجود السهو لسماحة الشيخ محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 166 صفحة .";
    imgs[22] = "/img/figh/a22.png";
    url[22] = "https://archive.org/download/cgui8/cgui8.pdf";

    //--------------------------------------------------------------------------
    title[23] = "الكوكب الساطع نظم جمع الجوامع للسيوطي ومعه شرحه المسمى الجليس الصالح النافع بتوضيح معاني الكوكب الساطع - محمد بن علي الإتيوبي الولوي";
    texts[23] = "الكوكب الساطع نظم جمع الجوامع للسيوطي ومعه شرحه المسمى الجليس الصالح النافع بتوضيح معاني الكوكب الساطع - محمد بن علي بن آدم موسى الإتيوبي الولوي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1431 هـ ، 664 صفحة .";
    imgs[23] = "/img/figh/a23.png";
    url[23] = "https://archive.org/download/frvt6/frvt6.pdf";

    //--------------------------------------------------------------------------
    title[24] = "نيل الأرب من قواعد ابن رجب - محمد بن صالح العثيمين";
    texts[24] = "نيل الأرب من قواعد ابن رجب - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 72 صفحة .";
    imgs[24] = "/img/figh/a24.png";
    url[24] = "https://archive.org/download/jgvf6/jgvf6.pdf";

    //--------------------------------------------------------------------------
    title[25] = "الربا (طريق التخلص منه في المصارف) - محمد بن صالح العثيمين ";
    texts[25] = "الربا طريق التخلص منه في المصارف - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1429 هـ ، 40 صفحة .";
    imgs[25] = "/img/figh/a25.png";
    url[25] = "https://archive.org/download/rgvt7/rgvt7.pdf";

    //--------------------------------------------------------------------------
    title[26] = "تلخيص فقه الفرائض -  محمد بن صالح العثيمين";
    texts[26] = "تلخيص فقه الفرائض -  محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 1423 هـ ، 56 صفحة .";
    imgs[26] = "/img/figh/a26.png";
    url[26] = "https://archive.org/download/tvfy9/tvfy9.pdf";

    //--------------------------------------------------------------------------
    title[27] = "الزواج ومجموعة أسئلة في أحكامه - محمد بن صالح العثيمين";
    texts[27] = "الزواج ومجموعة أسئلة في أحكامه - محمد بن صالح العثيمين ، مدار الوطن للنشر ، 1432 هـ ، 128 صفحة .";
    imgs[27] = "/img/figh/a27.png";
    url[27] = "https://archive.org/download/vbfl9/vbfl9.pdf";

    //--------------------------------------------------------------------------
    title[28] = "شرح رسالة لطيفة في أصول الفقه للشيخ عبد الرحمن السعدي - د. سعد الشثري ";
    texts[28] = "شرح رسالة لطيفة في أصول الفقه للشيخ عبد الرحمن بن ناصر السعدي - د. سعد بن ناصر الشثري ، اعتنى به فهد بن سعيد الجهضمي و عبد الناصر بن عبد القادر البشبيشي ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1434 هـ / 2013 م ، 199 صفحة .";
    imgs[28] = "/img/figh/a28.png";
    url[28] = "https://archive.org/download/noyu8/noyu8.pdf";

    //--------------------------------------------------------------------------
    title[29] = "حل العقدة في شرح العمدة (العمدة في الفقه لابن قدامة) ، عبد العزيز بن عبد الله الراجحي (مجلدان)";
    texts[29] = "حل العقدة في شرح العمدة ، عبد العزيز بن عبد الله الراجحي ، دار التوحيد ، الرياض ، ط 1 ، 1432 هـ / 2011 م ، مجلدان مدمجان برابط واحد = 1563 صفحة .";
    imgs[29] = "/img/figh/a29.png";
    url[29] = "http://archive.org/download/hdbp9/hdbp9.pdf";

    //--------------------------------------------------------------------------
    title[30] = "شرح المختصر في أصول الفقه لأبي الحسن علي البعلي الحنبلي (ابن اللحام) ، شرح د. سعد الشثري";
    texts[30] = "شرح المختصر في أصول الفقه لأبي الحسن علي بن محمد بن علي البعلي الحنبلي المعروف بابن اللحام ، شرح د. سعد بن ناصر الشثري ، اعتنى به عبد الناصر بن عبد القادر البشبيشي، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1428 هـ / 2007 م ، 806 صفحات .";
    imgs[30] = "/img/figh/a30.png";
    url[30] = "http://www.archive.org/download/onj47/onj47.pdf";


    //--------------------------------------------------------------------------
    title[31] = "الشرح المختصر على متن زاد المستقنع بتحليل ألفاظه وتقريب معانيه ، د. صالح الفوزان (4 مجلدات)";
    texts[31] = "الشرح المختصر على متن زاد المستقنع بتحليل ألفاظه وتقريب معانيه ، د. صالح بن فوزان الفوزان ، دار العاصمة ، ط 1 ، 1424 هـ / 2004 م ، 4 مجلدات .";
    imgs[31] = "/img/figh/a31.png";
    url[31] = "http://archive.org/download/zad71/shr7-01.pdf";

    //--------------------------------------------------------------------------
    title[32] = "المنحة الرضية في شرح التحفة المرضية في نظم المسائل الأصولية على طريقة أهل السنة السنية ، محمد بن علي الإثيوبي (3 مجلدات)";
    texts[32] = "المنحة الرضية في شرح التحفة المرضية في نظم المسائل الأصولية على طريقة أهل السنة السنية ، محمد بن علي بن آدم بن موسى الإثيوبي ، مكتبة الرشد ، السعودية ، ط 2 ، 1427 هـ / 2006 م ، 3 مجلدات مدمجة برابط واحد ، المجلد الأول = 806 صفحات ، المجلد الثاني = 759 صفحة ، المجلد الثالث = 692 صفحة .";
    imgs[32] = "/img/figh/a32.png";
    url[32] = "http://archive.org/download/dmnq66/dmnq66.pdf";



    //--------------------------------------------------------------------------
    title[33] = "إيقاف النبيل على حكم التمثيل ، د. عبد السلام بن برجس آل عبد الكريم ";
    texts[33] = "إيقاف النبيل على حكم التمثيل ، د. عبد السلام بن برجس آل عبد الكريم ، تقديم د. صالح الفوزان و د. ربيع المدخلي ، دار الفتح ، الشارقة / الإمارات ، ط 1 ، 1416 هـ / 1995 م ، 90 صفحة .";
    imgs[33] = "/img/figh/a33.png";
    url[33] = "http://www.archive.org/download/ttdd3/ttdd3.pdf";

    //--------------------------------------------------------------------------
    title[34] = "تسهيل الإلمام بفقه الأحاديث من بلوغ المرام لابن حجر العسقلاني ، د. صالح الفوزان ، ت عبد السلام السليمان (7 مجلدات)";
    texts[34] = "تسهيل الإلمام بفقه الأحاديث من بلوغ المرام للحافظ أحمد بن علي بن حجر العسقلاني ، شرحه الشيخ د. صالح بن فوزان الفوزان ، اعتنى بإخراجه : عبد السلام السليمان ، ط 1 ، 1427 هـ / 2006 م، 7 مجلدات  ، المجلد الأول ( الطهارة ) = 350 صفحة ، المجلد الثاني ( الصلاة ) = 659 صفحة ، المجلد الثالث ( الجنائز ، الزكاة ، الصيام ، الحج ) = 424 صفحة ، المجلد الرابع ( البيوع ـ النكاح ) = 450 صفحة ، المجلد الخامس ( الطلاق ، الجنايات ، الحدود ، الجهاد ) = 421 صفحة ، المجلد السادس ( الأطعمة ، الأيمان والنذور ، القضاء ، العتق ، الجامع ) = 365 صفحة ، الجزء السابع والأخير ( الفهارس ) = 251 صفحة .";
    imgs[34] = "/img/figh/a34.png";
    url[34] = "http://www.archive.org/download/ilm01/ilm01.pdf";

    //--------------------------------------------------------------------------
    title[35] = "شرح الأصول في علم الأصول لمحمد بن صالح العثيمين ، د. سعد بن ناصر الشثري";
    texts[35] = "شرح الأصول في علم الأصول لمحمد بن صالح العثيمين ، د. سعد بن ناصر الشثري ، اعتنى به عبد الناصر البشبيشي و فهد بن علوش العتيبي ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1430 هـ / 2009 م ، 339 صفحة .";
    imgs[35] = "/img/figh/a35.png";
    url[35] = "http://www.archive.org/download/yopn1/yopn1.pdf";

    //--------------------------------------------------------------------------
    title[36] = "إجابة السائل على أهم المسائل ، مقبل بن هادي الوادعي";
    texts[36] = "إجابة السائل على أهم المسائل ، مقبل بن هادي الوادعي ، دار الحرمين ، القاهرة ، ط 2 ، 1420 هـ / 1999 م ، 720 صفحة .";
    imgs[36] = "/img/figh/a36.png";
    url[36] = "http://www.archive.org/download/tghu6/tghu6.pdf";

    //--------------------------------------------------------------------------
    title[37] = "روضة الناظر وجنة المناظر - ابن قدامة (ط. الرسالة)";
    texts[37] = "روضة الناظر وجنة المناظر في أصول الفقه على مذهب الإمام أحمد بن حنبل  - موفق الدين عبد الله بن أحمد بن قدامة المقدسي ، اعتنى به وعلق عليه محمد مرابي ، مؤسسة الرسالة ناشرون ، دمشق ، بيروت ، ط 1 ، 1430 هـ / 2009 م ، 496 صفحة .";
    imgs[37] = "/img/figh/a37.png";
    url[37] = "https://archive.org/download/rvtp4/rvtp4.pdf";

    //--------------------------------------------------------------------------
    title[38] = "أحكام اللباس المتعلقة بالصلاة والحج  (ماجستير) - أ.د. سعد بن تركي الخثلان";
    texts[38] = "أحكام اللباس المتعلقة بالصلاة والحج  (ماجستير) - أ.د. سعد بن تركي الخثلان ، مكتبة الرشد ، الرياض ، ط 1 ، 1422 هـ / 2001 م ، 648 صفحة .";
    imgs[38] = "/img/figh/a38.png";
    url[38] = "https://archive.org/download/vmng2/vmng2.pdf";


    //--------------------------------------------------------------------------
    title[39] = "الحج المبرور (معلومات مهمة عن العمرة والحج) - محمد بن جميل زينو ";
    texts[39] = "الحج المبرور (معلومات مهمة عن العمرة والحج) - محمد بن جميل زينو ، من إصدار جمعية دار البر ، دبي ، 42 صفحة ، 1.4 M .";
    imgs[39] = "/img/figh/a39.png";
    url[39] = "https://archive.org/download/hvgn4/hvgn4.pdf";


    //--------------------------------------------------------------------------
    title[40] = "صيام رمضان (فضائله - آدابه - أحكامه - قيامه) ، محمد بن جميل زينو ";
    texts[40] = "صيام رمضان (فضائله - آدابه - أحكامه - قيامه) ، محمد بن جميل زينو ، مطبعة دار المجمع العلمي ، جدة ، ط 4 ، 40 صفحة ، 3 M .";
    imgs[40] = "/img/figh/a40.png";
    url[40] = "https://archive.org/download/vgpn5/vgpn5.pdf";

    //--------------------------------------------------------------------------
    title[41] = "الصلاة نور (وهي الركن الثاني من أركان الإسلام) - محمد بن جميل زينو";
    texts[41] = "الصلاة نور (وهي الركن الثاني من أركان الإسلام) - محمد بن جميل زينو ، ط 1 ، 48 صفحة .";
    imgs[41] = "/img/figh/a41.png";
    url[41] = "https://archive.org/download/vfmo5/vfmo5.pdf";

    //--------------------------------------------------------------------------
    title[42] = "صفة حجة النبي - صلى الله عليه وسلم - (مسائل مهمة عن العمرة والحج) - محمد بن جميل زينو";
    texts[42] = "صفة حجة النبي - صلى الله عليه وسلم - (مسائل مهمة عن العمرة والحج) - محمد بن جميل زينو ، مطابع ابن تيمية ، القاهرة ، ط 2 ، 40 صفحة ، 1.3 M .";
    imgs[42] = "/img/figh/a42.png";
    url[42] = "https://archive.org/download/hvgm4/hvgm4.pdf";


    //--------------------------------------------------------------------------
    title[43] = "شرح قواعد الأصول ومعاقد الفصول - محمد بن صالح العثيمين";
    texts[43] = "شرح قواعد الأصول ومعاقد الفصول - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 456 صفحة ، 10.6 M .";
    imgs[43] = "/img/figh/a43.png";
    url[43] = "https://archive.org/download/a600n/a600n.pdf";

    //--------------------------------------------------------------------------
    title[44] = "تغير الفتوى - محمد بن عمر بازمول ";
    texts[44] = "تغير الفتوى - محمد بن عمر بن سالم بازمول ، دار الهجرة ، الرياض ، ط 1 ، 1415 هـ / 1995 م ، 66 صفحة ، 1.8 M .";
    imgs[44] = "/img/figh/a44.png";
    url[44] = "https://archive.org/download/a704n/a704n.pdf";

    //--------------------------------------------------------------------------
    title[45] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح الفوزان";
    texts[45] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح بن محمد الفوزان ، دار التدمرية ، الرياض ، ط 2 ، 1429 هـ / 2008 م ، 703 صفحات ، 13 M .";
    imgs[45] = "/img/figh/a45.png";
    url[45] = "https://archive.org/download/a890n/a890n.pdf";


    //--------------------------------------------------------------------------
    title[46] = "شرح نظم قواعد الإعراب - ابن عثيمين";
    texts[46] = "شرح نظم قواعد الإعراب - محمد بن صالح العثيمين -  مؤسسة الشيخ محمد بن صالح العثيمين الخيرية - القصيم ، السعودية ، ط 1 ، 1438 هـ ، 95 ص ، 2 M .";
    imgs[46] = "/img/figh/a46.png";
    url[46] = "https://archive.org/download/a1632n/a1632n.pdf";

        //--------------------------------------------------------------------------
        title[47] = "التعليق على القواعد والأصول الجامعة - ابن عثيمين";
        texts[47] = "التعليق على القواعد والأصول الجامعة والفروق والتقاسيم البديعة النافعة - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 3 ، 1436 هـ ، 451 ص ، 8 M .";
        imgs[47] = "/img/figh/a47.png";
        url[47] = "https://archive.org/download/a1636n/a1636n.pdf";
   

   








    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


