//====================================================================================================================
//  كتب الفقه
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================


    title[] = "اللقاءات الشهرية - ابن عثيمين";
    texts[] = "اللقاءات الشهرية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 4 مجلدات مدمجة برابط واحد (الأول = 639 ص ، الثاني = 695 ص ، الثالث = 758 ص ، الرابع = 605 ص) ، 56 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1648n/a1648n.pdf";



    title[] = "الدروس الفقهية من المحاضرات الجامعية - ابن عثيمين";
    texts[] = "الدروس الفقهية من المحاضرات الجامعية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1438 هـ ، 3 مجلدات مدمجة برابط واحد ( الأول = 767 ص ، الثاني = 648 ص ، الثالث = 848 ص ) ، 48 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1647n/a1647n.pdf";

    title[] = " فتاوى سؤال على الهاتف - ابن عثيمين";
    texts[] = "فتاوى سؤال على الهاتف - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، مجلدان مدمجان برابط واحد (الأول = 1055 ص ، الثاني = 912 ص) ، 41 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1646n/a1646n.pdf";


    title[] = "فتاوى على الطريق - ابن عثيمين";
    texts[] = "فتاوى على الطريق في مسائل متنوعة -  محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 1004 ص ، 19 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1645n/a1645n.pdf";

    title[] = "لقاءات وفتاوى الأقليات المسلمة - ابن عثيمين";
    texts[] = "لقاءات وفتاوى الأقليات المسلمة - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1440 هـ ، 758 ص ، 17 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1644n/a1644n.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على الروض المربع - ابن عثيمين";
    texts[] = "التعليق على الروض المربع للشيخ العلامة المحقق أبي السعادات منصور بن يونس البهوتي الحنبلي - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 761 ص ، الثاني = 724 ص) ، 30 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1641n/a1641n.pdf";


    //--------------------------------------------------------------------------
    title[] = "تعليقات على الاختيارات الفقهية - ابن عثيمين";
    texts[] = "تعليقات على الاختيارات الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 579 ص ، 11 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1638n/a1638n.pdf";


    //--------------------------------------------------------------------------
    title[] = "التعليق على القواعد النورانية الفقهية - ابن عثيمين";
    texts[] = "التعليق على القواعد النورانية الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 701 ص ، 15 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1637n/a1637n.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد الشثري";
    texts[] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد بن ناصر الشثري ، تخريج عبد الله بن عمر بن طاهر ، دار إشبيليا ، الرياض ، ط 2 ، 1426 هـ / 2005 م ، 159 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/monrl/monrl.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، ( ط. دار ابن الجوزي ) ";
    texts[] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1433 هـ ، 871 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/vftbn/vftbn.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ";
    texts[] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، ط 1 ، 1427 هـ ، 504 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/bhqrn/bhqrn.pdf";


    //--------------------------------------------------------------------------
    title[] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد العجمي ";
    texts[] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد بن سعود بن عامر العجمي ، ط 5 ، 1430 هـ .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/tyrbs19/tyrbs19.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين";
    texts[] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين ، إصدارات مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، عنيزة / السعودية ، ط 1 ، 1428 هـ ، 405 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/lmuyt/lmuyt.pdf";

    //--------------------------------------------------------------------------
    title[] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان";
    texts[] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان ، دار الصميعي ، الرياض ، ط 2 ، 1433 هـ / 2012 م ، 255 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/gtryn/gtryn.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح مختصر روضة الناظر للطوفي ، د. سعد بن ناصر الشثري (مجلدان)";
    texts[] = "شرح مختصر روضة الناظر لنجم الدين أبي الربيع سليمان بن عبد القوي الطوفي ت 716 هـ ، تأليف د. سعد بن ناصر الشثري ، مجلدان = 1053 صفحة ، دار التدمرية ، الرياض ، ط 1 ، 1431 هـ / 2010 م .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/M-rawda/M-rawda.pdf";

    //--------------------------------------------------------------------------
    title[] = "المسح على الخفين المنخرقين ، ابن تيمية ت سفيان بن عايش و فارس مشعل";
    texts[] = "المسح على الخفين المنخرقين ، ابن تيمية ت سفيان بن عايش ، فراس مشعل ، الدار العثمانيّة ، عمّان ، ط 1 ، 1425 هـ / 2005 م .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/almas7_7/almas7.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح الورقات في أصول الفقه ـ د . سعد بن ناصر الشثري";
    texts[] = "شرح الورقات في أصول الفقه ـ لفضيلة الشيخ د . سعد بن ناصر الشثري ـ اعتنى به وخرّج أحاديثه عبد الناصر البشبيشي ـ دار كنوز إشبيليا ـ الرياض ـ ط 1 ، 1425 هــ ـ 2004 م ـ 196 صفحة ـ";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/tgij7/hbp84.pdf";

    //--------------------------------------------------------------------------
    title[] = "مختارات من الطرق الحكمية في السياسة الشرعية - محمد بن صالح العثيمين";
    texts[] = "مختارات من الطرق الحكمية في السياسة الشرعية - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 120 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/vgtm6/vgtm6.pdf";

    //--------------------------------------------------------------------------
    title[] = "مختارات من إعلام الموقعين عن رب العالمين  -  محمد بن صالح العثيمين ";
    texts[] = "مختارات من إعلام الموقعين عن رب العالمين  -  محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، ط 2 ، 1434 هـ ، 264 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/ytbf5/ytbf5.pdf";


    //--------------------------------------------------------------------------
    title[] = "منظومة أصول الفقه وقواعده (النظم والشرح) - محمد بن صالح العثيمين";
    texts[] = "منظومة أصول الفقه وقواعده (النظم والشرح) - محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1434 هـ ، 384 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/bygv7/bygv7.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح مختصر التحرير - محمد بن صالح العثيمين ";
    texts[] = "شرح مختصر التحرير - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 816 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/nhxv8/nhxv8.pdf";

    //--------------------------------------------------------------------------
    title[] = "العلماء الذين لهم إسهام في علم الأصول والقواعد الفقهية من عام 1300 - 1375 هـ  - د. سعد بن ناصر الشثري";
    texts[] = "العلماء الذين لهم إسهام في علم الأصول والقواعد الفقهية من عام 1300 - 1375 هـ  - د. سعد بن ناصر الشثري ، دار إشبيليا ، الرياض ، ط 1 ، 1425 هـ / 2004 م ، 98 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/omju9/omju7.pdf";


    //--------------------------------------------------------------------------
    title[] = "سجود السهو في ضوء السنة المطهرة - أ.د. عبد الله الطيار ، قرأه وعلق عليه ابن باز ";
    texts[] = "سجود السهو في ضوء السنة المطهرة (موضحاً بالأمثلة : حكمه ، حكمته ، صفته ، أسبابه ، أقسامه) - أ.د. عبد الله بن محمد بن أحمد الطيار ، قرأه وعلق عليه سماحة الشيخ عبد العزيز ابن باز ، ويشتمل على رسالة سجود السهو لسماحة الشيخ محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 166 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/cgui8/cgui8.pdf";

    //--------------------------------------------------------------------------
    title[] = "الكوكب الساطع نظم جمع الجوامع للسيوطي ومعه شرحه المسمى الجليس الصالح النافع بتوضيح معاني الكوكب الساطع - محمد بن علي الإتيوبي الولوي";
    texts[] = "الكوكب الساطع نظم جمع الجوامع للسيوطي ومعه شرحه المسمى الجليس الصالح النافع بتوضيح معاني الكوكب الساطع - محمد بن علي بن آدم موسى الإتيوبي الولوي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1431 هـ ، 664 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/frvt6/frvt6.pdf";

    //--------------------------------------------------------------------------
    title[] = "نيل الأرب من قواعد ابن رجب - محمد بن صالح العثيمين";
    texts[] = "نيل الأرب من قواعد ابن رجب - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 72 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/jgvf6/jgvf6.pdf";

    //--------------------------------------------------------------------------
    title[] = "الربا (طريق التخلص منه في المصارف) - محمد بن صالح العثيمين ";
    texts[] = "الربا طريق التخلص منه في المصارف - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1429 هـ ، 40 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/rgvt7/rgvt7.pdf";

    //--------------------------------------------------------------------------
    title[] = "تلخيص فقه الفرائض -  محمد بن صالح العثيمين";
    texts[] = "تلخيص فقه الفرائض -  محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، 1423 هـ ، 56 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/tvfy9/tvfy9.pdf";

    //--------------------------------------------------------------------------
    title[] = "الزواج ومجموعة أسئلة في أحكامه - محمد بن صالح العثيمين";
    texts[] = "الزواج ومجموعة أسئلة في أحكامه - محمد بن صالح العثيمين ، مدار الوطن للنشر ، 1432 هـ ، 128 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/vbfl9/vbfl9.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح رسالة لطيفة في أصول الفقه للشيخ عبد الرحمن السعدي - د. سعد الشثري ";
    texts[] = "شرح رسالة لطيفة في أصول الفقه للشيخ عبد الرحمن بن ناصر السعدي - د. سعد بن ناصر الشثري ، اعتنى به فهد بن سعيد الجهضمي و عبد الناصر بن عبد القادر البشبيشي ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1434 هـ / 2013 م ، 199 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/noyu8/noyu8.pdf";

    //--------------------------------------------------------------------------
    title[] = "حل العقدة في شرح العمدة (العمدة في الفقه لابن قدامة) ، عبد العزيز بن عبد الله الراجحي (مجلدان)";
    texts[] = "حل العقدة في شرح العمدة ، عبد العزيز بن عبد الله الراجحي ، دار التوحيد ، الرياض ، ط 1 ، 1432 هـ / 2011 م ، مجلدان مدمجان برابط واحد = 1563 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/hdbp9/hdbp9.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح المختصر في أصول الفقه لأبي الحسن علي البعلي الحنبلي (ابن اللحام) ، شرح د. سعد الشثري";
    texts[] = "شرح المختصر في أصول الفقه لأبي الحسن علي بن محمد بن علي البعلي الحنبلي المعروف بابن اللحام ، شرح د. سعد بن ناصر الشثري ، اعتنى به عبد الناصر بن عبد القادر البشبيشي، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1428 هـ / 2007 م ، 806 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/onj47/onj47.pdf";


    //--------------------------------------------------------------------------
    title[] = "الشرح المختصر على متن زاد المستقنع بتحليل ألفاظه وتقريب معانيه ، د. صالح الفوزان (4 مجلدات)";
    texts[] = "الشرح المختصر على متن زاد المستقنع بتحليل ألفاظه وتقريب معانيه ، د. صالح بن فوزان الفوزان ، دار العاصمة ، ط 1 ، 1424 هـ / 2004 م ، 4 مجلدات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/zad71/shr7-01.pdf";

    //--------------------------------------------------------------------------
    title[] = "المنحة الرضية في شرح التحفة المرضية في نظم المسائل الأصولية على طريقة أهل السنة السنية ، محمد بن علي الإثيوبي (3 مجلدات)";
    texts[] = "المنحة الرضية في شرح التحفة المرضية في نظم المسائل الأصولية على طريقة أهل السنة السنية ، محمد بن علي بن آدم بن موسى الإثيوبي ، مكتبة الرشد ، السعودية ، ط 2 ، 1427 هـ / 2006 م ، 3 مجلدات مدمجة برابط واحد ، المجلد الأول = 806 صفحات ، المجلد الثاني = 759 صفحة ، المجلد الثالث = 692 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/dmnq66/dmnq66.pdf";



    //--------------------------------------------------------------------------
    title[] = "إيقاف النبيل على حكم التمثيل ، د. عبد السلام بن برجس آل عبد الكريم ";
    texts[] = "إيقاف النبيل على حكم التمثيل ، د. عبد السلام بن برجس آل عبد الكريم ، تقديم د. صالح الفوزان و د. ربيع المدخلي ، دار الفتح ، الشارقة / الإمارات ، ط 1 ، 1416 هـ / 1995 م ، 90 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/ttdd3/ttdd3.pdf";

    //--------------------------------------------------------------------------
    title[] = "تسهيل الإلمام بفقه الأحاديث من بلوغ المرام لابن حجر العسقلاني ، د. صالح الفوزان ، ت عبد السلام السليمان (7 مجلدات)";
    texts[] = "تسهيل الإلمام بفقه الأحاديث من بلوغ المرام للحافظ أحمد بن علي بن حجر العسقلاني ، شرحه الشيخ د. صالح بن فوزان الفوزان ، اعتنى بإخراجه : عبد السلام السليمان ، ط 1 ، 1427 هـ / 2006 م، 7 مجلدات  ، المجلد الأول ( الطهارة ) = 350 صفحة ، المجلد الثاني ( الصلاة ) = 659 صفحة ، المجلد الثالث ( الجنائز ، الزكاة ، الصيام ، الحج ) = 424 صفحة ، المجلد الرابع ( البيوع ـ النكاح ) = 450 صفحة ، المجلد الخامس ( الطلاق ، الجنايات ، الحدود ، الجهاد ) = 421 صفحة ، المجلد السادس ( الأطعمة ، الأيمان والنذور ، القضاء ، العتق ، الجامع ) = 365 صفحة ، الجزء السابع والأخير ( الفهارس ) = 251 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/ilm01/ilm01.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح الأصول في علم الأصول لمحمد بن صالح العثيمين ، د. سعد بن ناصر الشثري";
    texts[] = "شرح الأصول في علم الأصول لمحمد بن صالح العثيمين ، د. سعد بن ناصر الشثري ، اعتنى به عبد الناصر البشبيشي و فهد بن علوش العتيبي ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1430 هـ / 2009 م ، 339 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/yopn1/yopn1.pdf";

    //--------------------------------------------------------------------------
    title[] = "إجابة السائل على أهم المسائل ، مقبل بن هادي الوادعي";
    texts[] = "إجابة السائل على أهم المسائل ، مقبل بن هادي الوادعي ، دار الحرمين ، القاهرة ، ط 2 ، 1420 هـ / 1999 م ، 720 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/tghu6/tghu6.pdf";

    //--------------------------------------------------------------------------
    title[] = "روضة الناظر وجنة المناظر - ابن قدامة (ط. الرسالة)";
    texts[] = "روضة الناظر وجنة المناظر في أصول الفقه على مذهب الإمام أحمد بن حنبل  - موفق الدين عبد الله بن أحمد بن قدامة المقدسي ، اعتنى به وعلق عليه محمد مرابي ، مؤسسة الرسالة ناشرون ، دمشق ، بيروت ، ط 1 ، 1430 هـ / 2009 م ، 496 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/rvtp4/rvtp4.pdf";

    //--------------------------------------------------------------------------
    title[] = "أحكام اللباس المتعلقة بالصلاة والحج  (ماجستير) - أ.د. سعد بن تركي الخثلان";
    texts[] = "أحكام اللباس المتعلقة بالصلاة والحج  (ماجستير) - أ.د. سعد بن تركي الخثلان ، مكتبة الرشد ، الرياض ، ط 1 ، 1422 هـ / 2001 م ، 648 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/vmng2/vmng2.pdf";


    //--------------------------------------------------------------------------
    title[] = "الحج المبرور (معلومات مهمة عن العمرة والحج) - محمد بن جميل زينو ";
    texts[] = "الحج المبرور (معلومات مهمة عن العمرة والحج) - محمد بن جميل زينو ، من إصدار جمعية دار البر ، دبي ، 42 صفحة ، 1.4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/hvgn4/hvgn4.pdf";


    //--------------------------------------------------------------------------
    title[] = "صيام رمضان (فضائله - آدابه - أحكامه - قيامه) ، محمد بن جميل زينو ";
    texts[] = "صيام رمضان (فضائله - آدابه - أحكامه - قيامه) ، محمد بن جميل زينو ، مطبعة دار المجمع العلمي ، جدة ، ط 4 ، 40 صفحة ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/vgpn5/vgpn5.pdf";

    //--------------------------------------------------------------------------
    title[] = "الصلاة نور (وهي الركن الثاني من أركان الإسلام) - محمد بن جميل زينو";
    texts[] = "الصلاة نور (وهي الركن الثاني من أركان الإسلام) - محمد بن جميل زينو ، ط 1 ، 48 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/vfmo5/vfmo5.pdf";

    //--------------------------------------------------------------------------
    title[] = "صفة حجة النبي - صلى الله عليه وسلم - (مسائل مهمة عن العمرة والحج) - محمد بن جميل زينو";
    texts[] = "صفة حجة النبي - صلى الله عليه وسلم - (مسائل مهمة عن العمرة والحج) - محمد بن جميل زينو ، مطابع ابن تيمية ، القاهرة ، ط 2 ، 40 صفحة ، 1.3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/hvgm4/hvgm4.pdf";


    //--------------------------------------------------------------------------
    title[] = "شرح قواعد الأصول ومعاقد الفصول - محمد بن صالح العثيمين";
    texts[] = "شرح قواعد الأصول ومعاقد الفصول - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 456 صفحة ، 10.6 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a600n/a600n.pdf";

    //--------------------------------------------------------------------------
    title[] = "تغير الفتوى - محمد بن عمر بازمول ";
    texts[] = "تغير الفتوى - محمد بن عمر بن سالم بازمول ، دار الهجرة ، الرياض ، ط 1 ، 1415 هـ / 1995 م ، 66 صفحة ، 1.8 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a704n/a704n.pdf";

    //--------------------------------------------------------------------------
    title[] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح الفوزان";
    texts[] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح بن محمد الفوزان ، دار التدمرية ، الرياض ، ط 2 ، 1429 هـ / 2008 م ، 703 صفحات ، 13 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a890n/a890n.pdf";

    //--------------------------------------------------------------------------
    title[] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح الفوزان";
    texts[] = "الجراحة التجميلية - عرض طبي ودراسة فقهية مفصلة (دكتوراه) - د. صالح بن محمد الفوزان ، دار التدمرية ، الرياض ، ط 2 ، 1429 هـ / 2008 م ، 703 صفحات ، 13 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a890n/a890n.pdf";


    //--------------------------------------------------------------------------
    title[] = "التعليق على القواعد والأصول الجامعة - ابن عثيمين";
    texts[] = "التعليق على القواعد والأصول الجامعة والفروق والتقاسيم البديعة النافعة - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 3 ، 1436 هـ ، 451 ص ، 8 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1636n/a1636n.pdf";


    //--------------------------------------------------------------------------
    title[] = "شرح نظم قواعد الإعراب - ابن عثيمين";
    texts[] = "شرح نظم قواعد الإعراب - محمد بن صالح العثيمين -  مؤسسة الشيخ محمد بن صالح العثيمين الخيرية - القصيم ، السعودية ، ط 1 ، 1438 هـ ، 95 ص ، 2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1632n/a1632n.pdf";

    






    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


