//====================================================================================================================
//  كتب الفقه
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================


    title[] = "اللقاءات الشهرية - ابن عثيمين";
    texts[] = "اللقاءات الشهرية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 4 مجلدات مدمجة برابط واحد (الأول = 639 ص ، الثاني = 695 ص ، الثالث = 758 ص ، الرابع = 605 ص) ، 56 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1648n/a1648n.pdf";



    title[] = "الدروس الفقهية من المحاضرات الجامعية - ابن عثيمين";
    texts[] = "الدروس الفقهية من المحاضرات الجامعية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1438 هـ ، 3 مجلدات مدمجة برابط واحد ( الأول = 767 ص ، الثاني = 648 ص ، الثالث = 848 ص ) ، 48 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1647n/a1647n.pdf";

    title[] = " فتاوى سؤال على الهاتف - ابن عثيمين";
    texts[] = "فتاوى سؤال على الهاتف - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، مجلدان مدمجان برابط واحد (الأول = 1055 ص ، الثاني = 912 ص) ، 41 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1646n/a1646n.pdf";


    title[] = "فتاوى على الطريق - ابن عثيمين";
    texts[] = "فتاوى على الطريق في مسائل متنوعة -  محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 1004 ص ، 19 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1645n/a1645n.pdf";

    title[] = "لقاءات وفتاوى الأقليات المسلمة - ابن عثيمين";
    texts[] = "لقاءات وفتاوى الأقليات المسلمة - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1440 هـ ، 758 ص ، 17 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1644n/a1644n.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على الروض المربع - ابن عثيمين";
    texts[] = "التعليق على الروض المربع للشيخ العلامة المحقق أبي السعادات منصور بن يونس البهوتي الحنبلي - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 761 ص ، الثاني = 724 ص) ، 30 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1641n/a1641n.pdf";


    //--------------------------------------------------------------------------
    title[] = "تعليقات على الاختيارات الفقهية - ابن عثيمين";
    texts[] = "تعليقات على الاختيارات الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 579 ص ، 11 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1638n/a1638n.pdf";


    //--------------------------------------------------------------------------
    title[] = "التعليق على القواعد النورانية الفقهية - ابن عثيمين";
    texts[] = "التعليق على القواعد النورانية الفقهية لشيخ الإسلام أحمد بن عبد الحليم بن عبد السلام بن تيمية - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 701 ص ، 15 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1637n/a1637n.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد الشثري";
    texts[] = "شرح المنظومة السعدية في القواعد الفقهية ، د. سعد بن ناصر الشثري ، تخريج عبد الله بن عمر بن طاهر ، دار إشبيليا ، الرياض ، ط 2 ، 1426 هـ / 2005 م ، 159 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/monrl/monrl.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، ( ط. دار ابن الجوزي ) ";
    texts[] = "شرح الأصول من علم الأصول ، محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1433 هـ ، 871 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/vftbn/vftbn.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ";
    texts[] = "التعليق على السياسة الشرعية في إصلاح الراعي والرعية لشيخ الإسلام بن تيمية ، محمد بن صالح العثيمين ، مدار الوطن للنشر ، الرياض ، ط 1 ، 1427 هـ ، 504 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/bhqrn/bhqrn.pdf";


    //--------------------------------------------------------------------------
    title[] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد العجمي ";
    texts[] = "الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى سماحة العلامة الإمام عبد العزيز بن عبد الله بن باز ، خالد بن سعود بن عامر العجمي ، ط 5 ، 1430 هـ .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/tyrbs19/tyrbs19.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين";
    texts[] = "التعليق على رسالة حقيقة الصيام وكتاب الصيام من الفروع ومسائل مختارة منه ، محمد بن صالح العثيمين ، إصدارات مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، عنيزة / السعودية ، ط 1 ، 1428 هـ ، 405 صفحات .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/lmuyt/lmuyt.pdf";

    //--------------------------------------------------------------------------
    title[] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان";
    texts[] = "فقه المعاملات المالية المعاصرة ، أ.د. سعد بن تركي الخثلان ، دار الصميعي ، الرياض ، ط 2 ، 1433 هـ / 2012 م ، 255 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/gtryn/gtryn.pdf";

    https://www.moswarat.com/books_dept_7_24.html






    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


