//====================================================================================================================
//  كتب الحديث
//====================================================================================================================


export default function () {
   
    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];


    //====================================================================================================================
    //  الحديث
    //====================================================================================================================

    //--------------------------------------
    title[0] = "شرح الأربعين النووية - لصالح آل الشيخ";
    texts[0] = "شرح الأربعين النووية للإمام يحيى بن شرف النووي ، صالح بن عبد العزيز آل الشيخ ، ت عادل رفاعي ،دار العاصمة ، الرياض ، ط 1 ، 1431 هـ ، 2010 م ، 608 صفحات .";
    imgs[0] = "/img/hadith/h0.png";
    url[0] = "http://www.archive.org/download/jjug6/jjug6.pdf";

    //--------------------------------------
    title[1] = "شرح عمدة الأحكام - للعثيمين";
    texts[1] = "شرح عمدة الأحكام - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، مجلدان مدمجان بربط واحد (الأول = 880 ص ، الثاني = 820 ص) ، 37 M .";
    imgs[1] = "/img/hadith/h1.png";
    url[1] = "https://archive.org/download/a1640n/a1640n.pdf";

    //--------------------------------------
    title[2] = "شرح بلوغ المرام - للشثري";
    texts[2] = "شرح بلوغ المرام من أدلة الأحكام - د. سعد بن ناصر الشثري ، دار كنوز إشبيليا ، الرياض ، ط 1 ، 1435 هـ / 2014 م ، 3 مجلدات مدمجات برابط واحد (الأول = 548 صفحة ، الثاني = 591 صفحة ، الثالث = 502 صفحة) ، 31.8 M .";
    imgs[2] = "/img/hadith/h2.png";
    url[2] = "https://archive.org/download/fmgx3/fmgx3.pdf";

    //--------------------------------------
    title[3] = "فتح العلام في دراسة أحاديث بلوغ المرام - لابن حزام البعداني";
    texts[3] = "فتح العلام في دراسة أحاديث بلوغ المرام حديثياً وفقهياً مع ذكر بعض المسائل الملحقة - أبو عبد الله محمد بن علي بن حزام الفضلي البعداني ، دار العاصمة ، صنعاء ، ط 4 ، 10 مجلدات مدمجة برابط واحد (الأول = 578 ص ، الثاني = 731 ص ، الثالث = 616 ص ، الرابع = 558 ص ، الخامس = 730 ص ، السادس = 574 ص ، السابع = 520 ص ، الثامن = 750 ص ، التاسع = 651 ص ، العاشر = 696 ص) ، 99 M ، إهداء من أخ كريم - جزاه الله خيراً - وقد قمنا بتنسيقه.";
    imgs[3] = "/img/hadith/h3.png";
    url[3] = "https://archive.org/download/tdso7/tdso7.pdf";
    //--------------------------------------
    title[4] = "شرح مختصر لحديث سيد الاستغفار - لابن تيمية";
    texts[4] = "شرح مختصر لحديث سيد الاستغفار - ابن تيمية ، 7 صفحات ، 2 M .";
    imgs[4] = "/img/hadith/h4.png";
    url[4] = "https://archive.org/download/ysqq2/ysqq2.pdf";
    //--------------------------------------
    title[5] = "الجامع الصحيح مما ليس في الصحيحين - لمقبل الوادعي";
    texts[5] = "الجامع الصحيح مما ليس في الصحيحين (طبعة جديدة منقحة ومفهرسة ومزيدة بزيادات تنشر لأول مرة مع تنبيهات على الأحاديث التي تراجع عنها الشيخ رحمه الله) - مقبل بن هادي الوادعي ، دار الآثار ، اليمن ، ط 4 ، 1434 هـ / 2013 م ، ستة مجلدات مدمجة برابط واحد (الأول = 624 صفحة ، الثاني = 664 صفحة ، الثالث = 600 صفحة ، الرابع = 648 صفحة ، الخامس = 720 صفحة ، السادس = 720 صفحة) ، 77 M .";
    imgs[5] = "/img/hadith/h5.png";
    url[5] = "https://archive.org/download/a878n/a878n.pdf";
    //--------------------------------------
    title[6] = "خطبة الحاجة - لابن تيمية والألباني - بقلم سليم الهلالي";
    texts[6] = "خطبة الحاجة التي كان رسول الله صلى الله عليه وسلم يعلمها أصحابه وبيان أنها سنة في مستهل الخطب والكتب - شرح شيخ الإسلام أبي العباس تقي الدين أحمد بن عبد الحليم ابن تيمية الحراني ، ومحلاة بحواش نفيسة وتعليقات منيفة من كتب الإمام المحدث الشيخ محمد ناصر الدين الألباني وبذيلها كسر القيد لكلام الشيخ بكر أبي زيد والعمدة في رد شبهات أبي غدة - بقلم سليم بن عيد الهلالي ، الدار الأثرية ، عمّان ، ط 2 ، 1425 هـ / 2004 م ، 74 ص ، 1 M .";
    imgs[6] = "/img/hadith/h6.png";
    url[6] = "https://archive.org/download/a1475n/a1475n.pdf";

    //--------------------------------------
    title[7] = "كتاب الإمارة من صحيح مسلم";
    texts[7] = "كتاب الإمارة من صحيح مسلم - الهيئة العامة للعناية بطباعة ونشر القرآن الكريم والسنة النبوية وعلومهما ، الكويت ، ط 1 ، 1436 هـ / 2014 م ، 71 ص ، 2 M .";
    imgs[7] = "/img/hadith/h7.png";
    url[7] = "https://archive.org/download/a1527n/a1527n.pdf";

    //--------------------------------------
    title[8] = "الصحيح المسند مما ليس في الصحيحين - لمقبل الوادعي";
    texts[8] = "الصحيح المسند مما ليس في الصحيحين - طبعة جديدة منقحة وتحوي زيادات وتراجعات تنشر لأول مرة ، مقبل بن هادي الوادعي ، دار الآثار ، صنعاء ، ط 4 ، 1433 هـ / 2012 م ، مجلدان مدمجان برابط واحد (الأول = 701 صفحة ، الثاني = 680 صفحة) ، 29 M .";
    imgs[8] = "/img/hadith/h8.png";
    url[8] = "https://archive.org/download/a928n/a928n.pdf";

    //--------------------------------------
    title[9] = "الدرر النقية في شرح البيقونية - تركي العبديني ";
    texts[9] = "الدرر النقية في شرح المنظومة البيقونية - تركي بن مسفر بن هادي العبديني ، 152 ص ، 2 M";
    imgs[9] = "/img/hadith/h9.png";
    url[9] = "https://archive.org/download/tvdx5/tvdx5.pdf";

    //--------------------------------------
    title[10] = "السير الحثيث شرح اختصار علوم الحديث - لمقبل الوادعي ";
    texts[10] = "السير الحثيث شرح اختصار علوم الحديث - مقبل بن هادي الوادعي ، فرّغه وعلق عليه عبد الله بن محمد بن عبد الله الحمادي ، دار الآثار ، صنعاء ، ط 1 ، 1428 هـ / 2007 م ، 495 صفحة ، 8.8 M .";
    imgs[10] = "/img/hadith/h10.png";
    url[10] = "https://archive.org/download/bvgm3/bvgm3.pdf";

    //--------------------------------------
    title[11] = "شرح نزهة النظر في توضيح نخبة الفكر - للعثيمين";
    texts[11] = "شرح نزهة النظر في توضيح نخبة الفكر - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1437 هـ ، 531 ص ، 10 M .";
    imgs[11] = "/img/hadith/h11.png";
    url[11] = "https://archive.org/download/a1642n/a1642n.pdf";

    //--------------------------------------
    title[12] = "المحدث الفاصل بين الراوي والواعي - الرامهرمزي";
    texts[12] = "المحدث الفاصل بين الراوي والواعي - الحسن بن عبد الرحمن الرامهرمزي - دراسة وتحقيق محمد بن علي الصومعي البيضاني ، الناشر المتميز ، المدينة النبوية ، ط 1 ، 1438 هـ / 2017 م ، 821 ص ، 15 M .";
    imgs[12] = "/img/hadith/h12.png";
    url[12] = "https://archive.org/download/a1705n/a1705n.pdf";

    //--------------------------------------
    title[13] = "المزيد في متصل الأسانيد دراسة نظرية وتطبيقية";
    texts[13] = "المزيد في متصل الأسانيد دراسة نظرية وتطبيقية (ماجستير) - سميرة محمد سلامة عمرو ، مكتبة الرشد ، السعودية ، ط 1 ، 1426 هـ / 2005 م ، 254 ص ، 4 M .";
    imgs[13] = "/img/hadith/h13.png";
    url[13] = "https://archive.org/download/a1695n/a1695n.pdf";

    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};
// export default Quran;
// export default Quran;