//====================================================================================================================
//  القران وعلومه
//====================================================================================================================


export default function () {
    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];



    //--------------------------------------
    title[0] = "كيف نفهم القران - لمحمد جميل زينو";
    texts[0] = "كيف نفهم القرآن (أنواع التفسير وشرح بعض آي القرآن) - محمد بن جميل زينو ، مطبعة دار المجمع العلمي ، جدة ، ط 6 ، 144 صفحة ، 4 M .";
    imgs[0] = "./img/quran/q0.png";
    url[0] = "https://ia601308.us.archive.org/20/items/nlpx2/nlpx2.pdf";

    //--------------------------------------
    title[1] = "معارج الصعود إلى تفسير سورة هود - للشنقيطي";
    texts[1] = `معارج الصعود إلى تفسير سورة هود - محمد الأمين بن محمد المختار الجكني الشنقيطي ، كتب عن فضيلة المسفر هذا التفسير تلميذه عبد الله بن أحمد قادري ، دار المجتمع ، جدة ، ط 1 ، 1408 هـ / 1988 م ، 316 ص ، 5 M.`;
    imgs[1] = "./img/quran/q1.png";
    url[1] = "https://archive.org/download/a1651n/a1651n.pdf";

    //--------------------------------------
    title[2] = "الإلمام ببعض آيات الأحكام - للعثيمين";
    texts[2] = "الإلمام ببعض آيات الأحكام (تفسيراً واستنباطاً) - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 823 صفحة ، 12.8 M .";
    imgs[2] = "./img/quran/q2.png";
    url[2] = "https://archive.org/download/zoju7/zoju7.pdf";

    //--------------------------------------
    title[3] = "ايسر التفاسير - للجزائري";
    texts[3] = "أيسر التفاسير لكلام العلي الكبير وبهامشه نهير الخير على أيسر التفاسير - أبو بكر جابر الجزائري ، مكتبة العلوم والحكم ، المدينة المنورة ، دار الحديث ، القاهرة ، 1806 صفحة ، (63.5 M) .";
    imgs[3] = "./img/quran/q3.png";
    url[3] = "https://archive.org/download/hymp5/hymp5.pdf";
    //--------------------------------------
    title[4] = "المصباح المنير في تهذيب تفسير ابن كثير";
    texts[4] = "المصباح المنير في تهذيب تفسير ابن كثير - إعداد جماعة من العلماء ، بإشراف صفي الرحمن المباركفوري ، دار السلام ، الرياض ، 1434 هـ / 2013 م ، 1646 صفحة ، (76.7 M) .";
    imgs[4] = "./img/quran/q4.png";
    url[4] = "https://archive.org/download/tvfxb3/tvfxb3.pdf";
    //--------------------------------------
    title[5] = "شرح أصول في التفسير - للعثيمين";
    texts[5] = "شرح أصول في التفسير ـ المتن والشرح لفضيلة الشيخ العلامة محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 463 صفحة ، (8.4 M) .";
    imgs[5] = "./img/quran/q5.png";
    url[5] = "https://archive.org/download/ybvg6/ybvg6.pdf";
    //--------------------------------------
    title[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم - للشثري";
    texts[6] = "شرح مقدمة التفسير للشيخ عبد الرحمن بن محمد بن قاسم ، شرح د. سعد بن ناصر بن عبد العزيز الشثري ، اعتنى به عبد المجيد بن غيث الغيث و عبد العزيز بن محمد الصديقي ، دار كنوز إشبيليا ، الرياض ، ط 2 ، 1432 هـ / 2011 م ، 227 صفحة .";
    imgs[6] = "./img/quran/q6.png";
    url[6] = "http://archive.org/download/nbhyg/nbhyg.pdf";

    //--------------------------------------
    title[7] = "شرح مقدمة في أصول التفسير لابن تيمية - صالح آل الشيخ";
    texts[7] = "شرح مقدمة في أصول التفسير لابن تيمية ، صالح بن عبد العزيز بن محمد آل الشيخ ، مكتبة دار المنهاج ، الرياض ، ط 1 ، 1432 هـ ، 207 صفحات .";
    imgs[7] = "./img/quran/q7.png";
    url[7] = "http://www.archive.org/download/jtrye/jtrye.pdf";

    //--------------------------------------
    title[8] = "تفسير سورة آل عمران - للعثيمين";
    texts[8] = "تفسير سورة آل عمران - محمد بن صالح العثيمين ، دار ابن الجوزي ، السعودية ، ط 3 ، 1435 هـ ، مجلدان مدمجان برابط واحد (الأول = 612 صفحة ، الثاني = 608 صفحات) ، (25.0 M) .";
    imgs[8] = "./img/quran/q8.png";
    url[8] = "https://archive.org/download/btvn5/btvn5.pdf";


    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};
// export default Quran;
// export default Quran;