//====================================================================================================================
//  كتب السيرة
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[0] = "مختارات من زاد المعاد في هدي خير العباد  -  محمد بن صالح العثيمين";
    texts[0] = "مختارات من زاد المعاد في هدي خير العباد  -  محمد بن صالح العثيمين";
    imgs[0] = "./img/sera/a0.png";
    url[0] = "https://archive.org/download/mgfp6/mgfp6.pdf";

    //--------------------------------------------------------------------------
    title[1] = "من بدائع القصص النبوي الصحيح - محمد بن جميل زينو";
    texts[1] = "من بدائع القصص النبوي الصحيح - محمد بن جميل زينو ، دار المنار ، الخرج ، السعودية ، ط 1 ، 1412 هـ / 1992 م ، 112 صفحة ، 2.5 M .";
    imgs[1] = "./img/sera/a1.png";
    url[1] = "https://archive.org/download/pmdn8/pmdn8.pdf";

    //--------------------------------------------------------------------------
    title[2] = "قطوف من الشمائل المحمدية والأخلاق النبوية والآداب الإسلامية - محمد بن جميل زينو";
    texts[2] = "قطوف من الشمائل المحمدية والأخلاق النبوية والآداب الإسلامية - محمد بن جميل زينو ، دار الخراز ، جدة ، ط 15 ، 120 صفحة ، 3 M .";
    imgs[2] = "./img/sera/a2.png";
    url[2] = "https://archive.org/download/tvxf1/tvxf1.pdf";

    //--------------------------------------------------------------------------
    title[3] = "معجزة الإسراء والمعراج - محمد بن جميل زينو ";
    texts[3] = "معجزة الإسراء والمعراج - محمد بن جميل زينو ، دار المنار ، الخرج ، السعودية ، ط 4 ، 1419 هـ ، 68 صفحة .";
    imgs[3] = "./img/sera/a3.png";
    url[3] = "https://archive.org/download/evmx6/evmx6.pdf";

    //--------------------------------------------------------------------------
    title[4] = "التعريف بما أنست الهجرة من معالم دار الهجرة ، جمال الدين المطري ، ت أ.د. سليمان الرحيلي";
    texts[4] = "التعريف بما أنست الهجرة من معالم دار الهجرة ، جمال الدين محمد بن أحمد المطري ، ت أ.د. سليمان الرحيلي ، دارة الملك عبد العزيز ، الرياض ، 1426 هـ / 2005 م ، 277 صفحة .";
    imgs[4] = "./img/sera/a4.png";
    url[4] = "http://www.archive.org/download/alhegra_728/alhegra.pdf";

    //--------------------------------------------------------------------------
    title[5] = "صدى دعوة الشيخ محمد بن عبدالوهاب في البلاد التونسية في عهد الإمام سعود بن عبد العزيز (1218 ـ 1229 هـ ـ 1803 ـ 1814 م) ، د.التليلي العجيلي";
    texts[5] = "صدى دعوة الشيخ محمد بن عبدالوهاب في البلاد التونسية في عهد الإمام سعود بن عبد العزيز (1218 ـ 1229 هـ / 1803 ـ 1814 م) ، د.التليلي العجيلي ، دارة الملك عبد العزيز ، الرياض ، 1431 هـ ، 219 صفحة .";
    imgs[5] = "./img/sera/a5.png";
    url[5] = "http://www.archive.org/download/kfrd5/kfrd5.pdf";

    //--------------------------------------------------------------------------
    title[6] = "الهداية في ترتيب فوائد البداية والنهاية للحافظ ابن كثير ، أبو عمار ياسر العدني";
    texts[6] = "الهداية في ترتيب فوائد البداية والنهاية للحافظ ابن كثير ، أبو عمار ياسر العدني ، تقديم محمد بن عبد الوهاب الوصابي و محمد بن عبد الله الإمام ، دار الآثار ، اليمن ، ط 1 ، 1422 هـ / 2002 م ، 240 صفحة .";
    imgs[6] = "./img/sera/a6.png";
    url[6] = "http://www.archive.org/download/ivqq1/ivqq1.pdf";

    //--------------------------------------------------------------------------
    title[7] = "التعليق على فصول من زاد المعاد - ابن عثيمين ";
    texts[7] = "التعليق على فصول من زاد المعاد في هدي خير العباد صلى الله عليه وسلم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 349 ص ، 7 M .";
    imgs[7] = "./img/sera/a7.png";
    url[7] = "https://archive.org/download/a1633n/a1633n.pdf";







    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


