//====================================================================================================================
//  كتب السيرة
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[] = "مختارات من زاد المعاد في هدي خير العباد  -  محمد بن صالح العثيمين";
    texts[] = "";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/mgfp6/mgfp6.pdf";

    //--------------------------------------------------------------------------
    title[] = "من بدائع القصص النبوي الصحيح - محمد بن جميل زينو";
    texts[] = "من بدائع القصص النبوي الصحيح - محمد بن جميل زينو ، دار المنار ، الخرج ، السعودية ، ط 1 ، 1412 هـ / 1992 م ، 112 صفحة ، 2.5 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/pmdn8/pmdn8.pdf";

    //--------------------------------------------------------------------------
    title[] = "قطوف من الشمائل المحمدية والأخلاق النبوية والآداب الإسلامية - محمد بن جميل زينو";
    texts[] = "قطوف من الشمائل المحمدية والأخلاق النبوية والآداب الإسلامية - محمد بن جميل زينو ، دار الخراز ، جدة ، ط 15 ، 120 صفحة ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/tvxf1/tvxf1.pdf";

    //--------------------------------------------------------------------------
    title[] = "معجزة الإسراء والمعراج - محمد بن جميل زينو ";
    texts[] = "معجزة الإسراء والمعراج - محمد بن جميل زينو ، دار المنار ، الخرج ، السعودية ، ط 4 ، 1419 هـ ، 68 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/evmx6/evmx6.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعريف بما أنست الهجرة من معالم دار الهجرة ، جمال الدين المطري ، ت أ.د. سليمان الرحيلي";
    texts[] = "التعريف بما أنست الهجرة من معالم دار الهجرة ، جمال الدين محمد بن أحمد المطري ، ت أ.د. سليمان الرحيلي ، دارة الملك عبد العزيز ، الرياض ، 1426 هـ / 2005 م ، 277 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/alhegra_728/alhegra.pdf";

    //--------------------------------------------------------------------------
    title[] = "صدى دعوة الشيخ محمد بن عبدالوهاب في البلاد التونسية في عهد الإمام سعود بن عبد العزيز (1218 ـ 1229 هـ ـ 1803 ـ 1814 م) ، د.التليلي العجيلي";
    texts[] = "صدى دعوة الشيخ محمد بن عبدالوهاب في البلاد التونسية في عهد الإمام سعود بن عبد العزيز (1218 ـ 1229 هـ / 1803 ـ 1814 م) ، د.التليلي العجيلي ، دارة الملك عبد العزيز ، الرياض ، 1431 هـ ، 219 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/kfrd5/kfrd5.pdf";

    //--------------------------------------------------------------------------
    title[] = "الهداية في ترتيب فوائد البداية والنهاية للحافظ ابن كثير ، أبو عمار ياسر العدني";
    texts[] = "الهداية في ترتيب فوائد البداية والنهاية للحافظ ابن كثير ، أبو عمار ياسر العدني ، تقديم محمد بن عبد الوهاب الوصابي و محمد بن عبد الله الإمام ، دار الآثار ، اليمن ، ط 1 ، 1422 هـ / 2002 م ، 240 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/ivqq1/ivqq1.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على فصول من زاد المعاد - ابن عثيمين ";
    texts[] = "التعليق على فصول من زاد المعاد في هدي خير العباد صلى الله عليه وسلم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1439 هـ ، 349 ص ، 7 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1633n/a1633n.pdf";

    





    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


