//====================================================================================================================
//  كتب التزكية
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================



    //--------------------------------------------------------------------------
    title[0] = "وصايا ونصائح لطالب العلم - ابن الجوزي ";
    texts[0] = "وصايا ونصائح لطالب العلم - عبد الرحمن ابن الجوزي ، انتقاها وعلق عليها وحققها وخرج أحاديثها محمد بن إبراهيم الشيباني ، مركز المخطوطات والتراث والوثائق ، الكويت ، ط 2 ، 1423 هـ / 2003 م ، 107 ص ، 2 M .";
    imgs[0] = "./img/tazkia/a0.png";
    url[0] = "https://archive.org/download/a1522n/a1522n.pdf";

    //--------------------------------------------------------------------------
    title[1] = "التعليق على مقدمة المجموع للنووي - ابن عثيمين";
    texts[1] = "التعليق على مقدمة المجموع للحافظ محيي الدين يحيى بن شرف أبي زكريا النووي - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 431 ص ، 10 M .";
    imgs[1] = "./img/tazkia/a1.png";
    url[1] = "https://archive.org/download/a1634n/a1634n.pdf";

    //--------------------------------------------------------------------------
    title[2] = "صحيح الوابل الصيب لابن القيم - سليم الهلالي";
    texts[2] = "صحيح الوابل الصيب من الكلم الطيب لأبي عبد الله محمد ابن قيم الجوزية - سليم بن عيد الهلالي ، دار ابن الجوزي ، السعودية ، ط 2 / 1433 هـ ، 276 ص ، 22 M ، إهداء من أحد الإخوة - نفع الله به - وقد قمنا بتنسيقه.";
    imgs[2] = "./img/tazkia/a2.png";
    url[2] = "https://archive.org/download/fokr5/fokr5.pdf";

    //--------------------------------------------------------------------------
    title[3] = "بر الوالدين - أبو بكر الطرطوشي";
    texts[3] = "بر الوالدين (ما يجب على الوالد لولده وما يجب على الولد لوالده) - أبو بكر محمد بن الوليد بن خلف الطرطوشي ، تحقيق وتخريج محمد بن صالح بن محمد الليبي ، ط 1 ، 1440 هـ / 2019 م ، 99 ص ، 3 M ، إهداء من المحقق الفاضل - جزاه الله خيراً ، وبارك فيه - .";
    imgs[3] = "./img/tazkia/a3.png";
    url[3] = "https://archive.org/download/izor4/izor4.pdf";

    //--------------------------------------------------------------------------
    title[4] = "أسرار التوفيق -  فيصل الحاشدي";
    texts[4] = "أسرار التوفيق -  فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 2020 م ، 88 صفحة ، 1 M ،  إهداء من أخ كريم - جزاه الله خيراً - وقد قمنا بتنسيقه.";
    imgs[4] = "./img/tazkia/a4.png";
    url[4] = "https://archive.org/download/tdob7/tdob7.pdf";

    //--------------------------------------------------------------------------
    title[5] = "رسالة إلى ولدي : من تصاحب ؟ -  فيصل الحاشدي ";
    texts[5] = "رسالة إلى ولدي : من تصاحب ؟ -  فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، ط 1 ، 2010 م ، 144 صفحة ، 2 M .";
    imgs[5] = "./img/tazkia/a5.png";
    url[5] = "https://archive.org/download/a1702n/a1702n.pdf";

    //--------------------------------------------------------------------------
    title[6] = "الفقيه والمتفقه (ط 1430 هـ) - الخطيب البغدادي - ت عادل العزازي";
    texts[6] = "الفقيه والمتفقه - أحمد بن علي بن ثابت الخطيب البغدادي - حققه عادل بن يوسف العزازي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1430 هـ ، 822 ص ، 19 M .";
    imgs[6] = "./img/tazkia/a6.png";
    url[6] = "https://archive.org/download/a1704n/a1704n.pdf";

    //--------------------------------------------------------------------------
    title[7] = "حادي الصديق إلى بيت الله العتيق - فيصل الحاشدي";
    texts[7] = "حادي الصديق إلى بيت الله العتيق - فيصل بن عبده قائد الحاشدي ، دار الإيمان ، دار القمة ، الإسكندرية ، 192 صفحة ، 3 M .";
    imgs[7] = "./img/tazkia/a7.png";
    url[7] = "https://archive.org/download/a868n/a868n.pdf";


    //--------------------------------------------------------------------------
    title[8] = "بدائع الحكم بذكر فوائد حديث تداعى الأمم - سليم الهلالي ، ويليه رسالة معالم المنهج السلفي في التغيير - الألباني";
    texts[8] = "بدائع الحكم بذكر فوائد حديث تداعى الأمم - سليم بن عيد الهلالي ، ويليه رسالة معالم المنهج السلفي في التغيير ، محمد ناصر الدين الألباني ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1425 هـ / 2004 م ، 151 صفحة ، 4.4 M .";
    imgs[8] = "./img/tazkia/a8.png";
    url[8] = "https://archive.org/download/a631n/a631n.pdf";


    //--------------------------------------------------------------------------
    title[9] = "تحفة الأبرار في الأدعية والآداب والأذكار - محمد بن جميل زينو";
    texts[9] = "تحفة الأبرار في الأدعية والآداب والأذكار - محمد بن جميل زينو ، مجموعة التحف النفائس الدولية للنشر والتوزيع ، الرياض ، ط 2 ، 1417 هـ / 1997 م ، 84 صفحة ، 2.3 M .";
    imgs[9] = "./img/tazkia/a9.png";
    url[9] = "https://archive.org/download/hmvr5/hmvr5.pdf";


    //--------------------------------------------------------------------------
    title[10] = "الرغبة والرهبة منهج ثابت في الكتاب والسنة - محمد بن جميل زينو";
    texts[10] = "الرغبة والرهبة منهج ثابت في الكتاب والسنة - محمد بن جميل زينو ، ط 1 ، 1424 هـ ، 72 صفحة .";
    imgs[10] = "./img/tazkia/a10.png";
    url[10] = "https://archive.org/download/rvbg2/rvbg2.pdf";

    //--------------------------------------------------------------------------
    title[11] = "تحذير الإخوان من انحرافات عبد الرحيم الطحان - محمد بن جميل زينو ";
    texts[11] = "تحذير الإخوان من انحرافات عبد الرحيم الطحان - محمد بن جميل زينو ، تقديم د. صالح الفوزان ، بموافقة الشيخ عبد العزيز بن باز ، دار الوحدة للكتاب ، 172 صفحة .";
    imgs[11] = "./img/tazkia/a11.png";
    url[11] = "https://archive.org/download/xdvl8/xdvl8.pdf";


    //--------------------------------------------------------------------------
    title[12] = "القطوف الدواني في شرح نونية القحطاني - د. صالح السحيمي";
    texts[12] = "القطوف الدواني شرح نونية القحطاني - د. صالح بن سعد السحيمي ، مؤسسة كنوز وفوائد للنشر والإعلان ، الجزائر ، توزيع دار الميراث النبوي ، الجزائر ، ط 1 ، 1435 هـ / 2014 م ، 671 صفحة ، 14.2 M .";
    imgs[12] = "./img/tazkia/a12.png";
    url[12] = "https://archive.org/download/a572n/a572n.pdf";



    //--------------------------------------------------------------------------
    title[13] = "أخطاء شائعة يجب تصحيحها في ضوء الكتاب والسنة - محمد بن جميل زينو";
    texts[13] = "أخطاء شائعة يجب تصحيحها في ضوء الكتاب والسنة - محمد بن جميل زينو ، دار الصميعي ، الرياض ، ط 2 ، 80 صفحة ، 2 M .";
    imgs[13] = "./img/tazkia/a13.png";
    url[13] = "https://archive.org/download/oihy6/oihy6.pdf";


    //--------------------------------------------------------------------------

    title[14] = "منهاج (مختارات من كلام الإمامين ابن تيمية وابن القيم رحمهم الله)";
    texts[14] = "منهاج (مختارات من كلام الإمامين ابن تيمية وابن القيم رحمهم الله) - المجموعة الأولى (مرتبة ومبوبة مع ذكر المرجع والصفحة) ، عبد الرحمن بن محمد السبهان ، حمد بن عبد الله الجمعان ، إبراهيم بن فريهد العنزي ، وزارة الأوقاف والشؤون الإسلامية ، الكويت ، 237 ص ، 3 M .";
    imgs[14] = "./img/tazkia/a14.png";
    url[14] = "https://archive.org/download/a1508n/a1508n.pdf";

    //--------------------------------------------------------------------------
    title[15] = "نداء إلى المربين والمربيات لتوجيه البنين والبنات - محمد بن جميل زينو";
    texts[15] = "نداء إلى المربين والمربيات لتوجيه البنين والبنات - محمد بن جميل زينو ، دار الصميعي ، الرياض ، 112 صفحة ، 2.4 M .";
    imgs[15] = "./img/tazkia/a15.png";
    url[15] = "https://archive.org/download/rpgm7/rpgm7.pdf";

    //--------------------------------------------------------------------------
    title[16] = "معلومات مهمة من الدين لا يعلمها كثير من المسلمين - محمد بن جميل زينو";
    texts[16] = "معلومات مهمة من الدين لا يعلمها كثير من المسلمين - محمد بن جميل زينو ، دار الخراز ، جدة ، ط 6 ، 144 صفحة ، 4 M .";
    imgs[16] = "./img/tazkia/a16.png";
    url[16] = "https://archive.org/download/xmpl4/xmpl4.pdf";


    //--------------------------------------------------------------------------
    title[17] = "كيف نربي أبناءنا ، وما هو واجب الآباء والأبناء - محمد بن جميل زينو";
    texts[17] = "كيف نربي أبناءنا ، وما هو واجب الآباء والأبناء - محمد بن جميل زينو ، دار الصميعي ، الرياض ، ط 17 ، 1424 هـ ، 64 صفحة ، 2.2 M .";
    imgs[17] = "./img/tazkia/a17.png";
    url[17] = "https://archive.org/download/mgrv4/mgrv4.pdf";

    //--------------------------------------------------------------------------
    title[18] = "حكم الدخان والتدخين على ضوء الطب والدين - محمد بن جميل زينو";
    texts[18] = "حكم الدخان والتدخين على ضوء الطب والدين - محمد بن جميل زينو ، 56 صفحة ، 1.7 M .";
    imgs[18] = "./img/tazkia/a18.png";
    url[18] = "https://archive.org/download/mkvm8/mkvm8.pdf";

    //--------------------------------------------------------------------------
    title[19] = "توجيهات إسلامية لإصلاح الفرد والمجتمع - محمد بن جميل زينو";
    texts[19] = "توجيهات إسلامية لإصلاح الفرد والمجتمع - محمد بن جميل زينو ، جمعية دار البر ، دبي ،  144 صفحة . 2.7 M .";
    imgs[19] = "./img/tazkia/a19.png";
    url[19] = "https://archive.org/download/xpdm5/xpdm5.pdf";

    //--------------------------------------------------------------------------
    title[20] = "تكريم المرأة في الإسلام - محمد بن جميل زينو";
    texts[20] = "تكريم المرأة في الإسلام - محمد بن جميل زينو ، دار القاسم ، الرياض ، ط 3 ، 120 صفحة .";
    imgs[20] = "./img/tazkia/a20.png";
    url[20] = "https://archive.org/download/xgmn5/xgmn5.pdf";


    //--------------------------------------------------------------------------
    title[21] = "التعليق على ميمية ابن القيم - محمد بن صالح العثيمين";
    texts[21] = "التعليق على ميمية ابن القيم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1429 هـ ، 72 صفحة .";
    imgs[21] = "./img/tazkia/a21.png";
    url[21] = "https://archive.org/download/ubmd8/ubmd8.pdf";

    //--------------------------------------------------------------------------
    title[22] = "فوائد التقوى من القرآن الكريم - محمد بن صالح العثيمين";
    texts[22] = "فوائد التقوى من القرآن الكريم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1428 هـ ، 32 صفحة .";
    imgs[22] = "./img/tazkia/a22.png";
    url[22] = "https://archive.org/download/fnbd8/fnbd8.pdf";

    //--------------------------------------------------------------------------
    title[23] = "شرح حلية طالب العلم للشيخ د. بكر أبو زيد - محمد بن صالح العثيمين";
    texts[23] = "شرح حلية طالب العلم للشيخ د. بكر أبو زيد - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 397 صفحة .";
    imgs[23] = "./img/tazkia/a23.png";
    url[23] = "https://archive.org/download/nbvf3/nbvf3.pdf";

    //--------------------------------------------------------------------------
    title[24] = "الحجج القوية على أن وسائل الدعوة توقيفية ، د. عبد السلام بن برجس العبد الكريم";
    texts[24] = "الحجج القوية على أن وسائل الدعوة توقيفية ، د. عبد السلام بن برجس العبد الكريم ، دار المنهاج ، 120 صفحة .";
    imgs[24] = "./img/tazkia/a24.png";
    url[24] = "http://www.archive.org/download/jjaa2/jjaa2.pdf";

    //--------------------------------------------------------------------------
    title[25] = "تغليظ الملام على المتسرعين إلى الفتيا وتغيير الأحكام ، حمود التويجري ، وضرورة الاهتمام بالسنن النبوية ، عبدالسلام بن برجس";
    texts[25] = "تغليظ الملام على المتسرعين إلى الفتيا وتغيير الأحكام ، حمود بن عبد الله التويجري ، دار النوادر القيمة ، 1430 هـ / 2009 م ، وضرورة الاهتمام بالسنن النبوية ، عبدالسلام بن برجس ، دارالنوادر القيمة ، ط 2 ، 1426 هـ / 2005 م .";
    imgs[25] = "./img/tazkia/a25.png";
    url[25] = "http://www.archive.org/download/zad64/zad64.pdf";

    //--------------------------------------------------------------------------
    title[26] = "البيان لأخطاء بعض الكتاب (3 مجلدات) - د. صالح الفوزان ";
    texts[26] = "البيان لأخطاء بعض الكتاب - د. صالح بن فوزان بن عبد الله الفوزان ، دار ابن الجوزي ، السعودية ، 3 مجلدات (الأول ط 3 ، 1427 هـ ، 360 صفحة) ، (الثاني ط 3 ، 1427 هـ ، 288 صفحة) ، (الثالث ط 1 ، 1429 هـ ، 376 صفحة) .";
    imgs[26] = "./img/tazkia/a26.png";
    url[26] = "http://archive.org/download/frgo8/frgo8.pdf";

    //--------------------------------------------------------------------------
    title[27] = "حديث المساء من الدروس والمحاضرات والتعليقات ، عبد العزيز بن عبد الله بن باز ";
    texts[27] = "حديث المساء من الدروس والمحاضرات والتعليقات ، عبد العزيز بن عبد الله بن باز ، تحقيق صلاح الدين عثمان أحمد ، مكتبة دار المنهاج ، الرياض ، ط 1 ، 1432 هـ ، 478 صفحة .";
    imgs[27] = "./img/tazkia/a27.png";
    url[27] = "http://www.archive.org/download/garyo/garyo.pdf";

    //--------------------------------------------------------------------------
    title[28] = "الحياة الزوجية - محمد رشيد رضا";
    texts[28] = "الحياة الزوجية - محمد رشيد رضا ، جمعه وعلق عليه خالد بن جمعة بن عثمان الخراز ، مكتبة الإمام الذهبي ، الكويت ، ط 1 ، 1432 هـ / 2011 م ، 107 ص ، 2 M .";
    imgs[28] = "./img/tazkia/a28.png";
    url[28] = "https://archive.org/download/a1657n/a1657n.pdf";



    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


