//====================================================================================================================
//  كتب التزكية
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================



    //--------------------------------------------------------------------------
    title[] = "وصايا ونصائح لطالب العلم - ابن الجوزي ";
    texts[] = "وصايا ونصائح لطالب العلم - عبد الرحمن ابن الجوزي ، انتقاها وعلق عليها وحققها وخرج أحاديثها محمد بن إبراهيم الشيباني ، مركز المخطوطات والتراث والوثائق ، الكويت ، ط 2 ، 1423 هـ / 2003 م ، 107 ص ، 2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1522n/a1522n.pdf";

    //--------------------------------------------------------------------------
    title[] = "التعليق على مقدمة المجموع للنووي - ابن عثيمين";
    texts[] = "التعليق على مقدمة المجموع للحافظ محيي الدين يحيى بن شرف أبي زكريا النووي - محمد بن صالح العثيمين - مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1436 هـ ، 431 ص ، 10 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1634n/a1634n.pdf";

    //--------------------------------------------------------------------------
    title[] = "صحيح الوابل الصيب لابن القيم - سليم الهلالي";
    texts[] = "صحيح الوابل الصيب من الكلم الطيب لأبي عبد الله محمد ابن قيم الجوزية - سليم بن عيد الهلالي ، دار ابن الجوزي ، السعودية ، ط 2 / 1433 هـ ، 276 ص ، 22 M ، إهداء من أحد الإخوة - نفع الله به - وقد قمنا بتنسيقه.";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/fokr5/fokr5.pdf";

    //--------------------------------------------------------------------------
    title[] = "بر الوالدين - أبو بكر الطرطوشي";
    texts[] = "بر الوالدين (ما يجب على الوالد لولده وما يجب على الولد لوالده) - أبو بكر محمد بن الوليد بن خلف الطرطوشي ، تحقيق وتخريج محمد بن صالح بن محمد الليبي ، ط 1 ، 1440 هـ / 2019 م ، 99 ص ، 3 M ، إهداء من المحقق الفاضل - جزاه الله خيراً ، وبارك فيه - .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/izor4/izor4.pdf";

    //--------------------------------------------------------------------------
    title[] = "أسرار التوفيق -  فيصل الحاشدي";
    texts[] = "أسرار التوفيق -  فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 2020 م ، 88 صفحة ، 1 M ،  إهداء من أخ كريم - جزاه الله خيراً - وقد قمنا بتنسيقه.";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/tdob7/tdob7.pdf";

    //--------------------------------------------------------------------------
    title[] = "رسالة إلى ولدي : من تصاحب ؟ -  فيصل الحاشدي ";
    texts[] = "رسالة إلى ولدي : من تصاحب ؟ -  فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، ط 1 ، 2010 م ، 144 صفحة ، 2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1702n/a1702n.pdf";

    //--------------------------------------------------------------------------
    title[] = "الفقيه والمتفقه (ط 1430 هـ) - الخطيب البغدادي - ت عادل العزازي";
    texts[] = "الفقيه والمتفقه - أحمد بن علي بن ثابت الخطيب البغدادي - حققه عادل بن يوسف العزازي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1430 هـ ، 822 ص ، 19 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1704n/a1704n.pdf";

    //--------------------------------------------------------------------------
    title[] = "حادي الصديق إلى بيت الله العتيق - فيصل الحاشدي";
    texts[] = "حادي الصديق إلى بيت الله العتيق - فيصل بن عبده قائد الحاشدي ، دار الإيمان ، دار القمة ، الإسكندرية ، 192 صفحة ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a868n/a868n.pdf";


    //--------------------------------------------------------------------------
    title[] = "بدائع الحكم بذكر فوائد حديث تداعى الأمم - سليم الهلالي ، ويليه رسالة معالم المنهج السلفي في التغيير - الألباني";
    texts[] = "بدائع الحكم بذكر فوائد حديث تداعى الأمم - سليم بن عيد الهلالي ، ويليه رسالة معالم المنهج السلفي في التغيير ، محمد ناصر الدين الألباني ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1425 هـ / 2004 م ، 151 صفحة ، 4.4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a631n/a631n.pdf";


    //--------------------------------------------------------------------------
    title[] = "تحفة الأبرار في الأدعية والآداب والأذكار - محمد بن جميل زينو";
    texts[] = "تحفة الأبرار في الأدعية والآداب والأذكار - محمد بن جميل زينو ، مجموعة التحف النفائس الدولية للنشر والتوزيع ، الرياض ، ط 2 ، 1417 هـ / 1997 م ، 84 صفحة ، 2.3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/hmvr5/hmvr5.pdf";


    //--------------------------------------------------------------------------
    title[] = "الرغبة والرهبة منهج ثابت في الكتاب والسنة - محمد بن جميل زينو";
    texts[] = "الرغبة والرهبة منهج ثابت في الكتاب والسنة - محمد بن جميل زينو ، ط 1 ، 1424 هـ ، 72 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/rvbg2/rvbg2.pdf";

    //--------------------------------------------------------------------------
    title[] = "تحذير الإخوان من انحرافات عبد الرحيم الطحان - محمد بن جميل زينو ";
    texts[] = "تحذير الإخوان من انحرافات عبد الرحيم الطحان - محمد بن جميل زينو ، تقديم د. صالح الفوزان ، بموافقة الشيخ عبد العزيز بن باز ، دار الوحدة للكتاب ، 172 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/xdvl8/xdvl8.pdf";


    //--------------------------------------------------------------------------
    title[] = "القطوف الدواني في شرح نونية القحطاني - د. صالح السحيمي";
    texts[] = "القطوف الدواني شرح نونية القحطاني - د. صالح بن سعد السحيمي ، مؤسسة كنوز وفوائد للنشر والإعلان ، الجزائر ، توزيع دار الميراث النبوي ، الجزائر ، ط 1 ، 1435 هـ / 2014 م ، 671 صفحة ، 14.2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a572n/a572n.pdf";



    //--------------------------------------------------------------------------
    title[] = "أخطاء شائعة يجب تصحيحها في ضوء الكتاب والسنة - محمد بن جميل زينو";
    texts[] = "أخطاء شائعة يجب تصحيحها في ضوء الكتاب والسنة - محمد بن جميل زينو ، دار الصميعي ، الرياض ، ط 2 ، 80 صفحة ، 2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/oihy6/oihy6.pdf";


    //--------------------------------------------------------------------------
    title[] = "موافقة المبطن المخبر - محمد ناصر الدين الألباني ";
    texts[] = "موافقة المبطن المخبر - محمد ناصر الدين الألباني ، جمعها وشرحها عمرو عبد المنعم سليم ، دار الضياء ، طنطا ، مصر ، 32 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/mvxn4/mvxn4.pdf";

    //--------------------------------------------------------------------------
    title[] = "نداء إلى المربين والمربيات لتوجيه البنين والبنات - محمد بن جميل زينو";
    texts[] = "نداء إلى المربين والمربيات لتوجيه البنين والبنات - محمد بن جميل زينو ، دار الصميعي ، الرياض ، 112 صفحة ، 2.4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/rpgm7/rpgm7.pdf";

    //--------------------------------------------------------------------------
    title[] = "معلومات مهمة من الدين لا يعلمها كثير من المسلمين - محمد بن جميل زينو";
    texts[] = "معلومات مهمة من الدين لا يعلمها كثير من المسلمين - محمد بن جميل زينو ، دار الخراز ، جدة ، ط 6 ، 144 صفحة ، 4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/xmpl4/xmpl4.pdf";


    //--------------------------------------------------------------------------
    title[] = "كيف نربي أبناءنا ، وما هو واجب الآباء والأبناء - محمد بن جميل زينو";
    texts[] = "كيف نربي أبناءنا ، وما هو واجب الآباء والأبناء - محمد بن جميل زينو ، دار الصميعي ، الرياض ، ط 17 ، 1424 هـ ، 64 صفحة ، 2.2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/mgrv4/mgrv4.pdf";

    //--------------------------------------------------------------------------
    title[] = "حكم الدخان والتدخين على ضوء الطب والدين - محمد بن جميل زينو";
    texts[] = "حكم الدخان والتدخين على ضوء الطب والدين - محمد بن جميل زينو ، 56 صفحة ، 1.7 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/mkvm8/mkvm8.pdf";

    //--------------------------------------------------------------------------
    title[] = "توجيهات إسلامية لإصلاح الفرد والمجتمع - محمد بن جميل زينو";
    texts[] = "توجيهات إسلامية لإصلاح الفرد والمجتمع - محمد بن جميل زينو ، جمعية دار البر ، دبي ،  144 صفحة . 2.7 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/xpdm5/xpdm5.pdf";

    //--------------------------------------------------------------------------
    title[] = "تكريم المرأة في الإسلام - محمد بن جميل زينو";
    texts[] = "تكريم المرأة في الإسلام - محمد بن جميل زينو ، دار القاسم ، الرياض ، ط 3 ، 120 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/xgmn5/xgmn5.pdf";


    //--------------------------------------------------------------------------
    title[] = "التعليق على ميمية ابن القيم - محمد بن صالح العثيمين";
    texts[] = "التعليق على ميمية ابن القيم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين الخيرية ، القصيم ، السعودية ، ط 1 ، 1429 هـ ، 72 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/ubmd8/ubmd8.pdf";

    //--------------------------------------------------------------------------
    title[] = "فوائد التقوى من القرآن الكريم - محمد بن صالح العثيمين";
    texts[] = "فوائد التقوى من القرآن الكريم - محمد بن صالح العثيمين ، مؤسسة الشيخ محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1428 هـ ، 32 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/fnbd8/fnbd8.pdf";

    //--------------------------------------------------------------------------
    title[] = "شرح حلية طالب العلم للشيخ د. بكر أبو زيد - محمد بن صالح العثيمين";
    texts[] = "شرح حلية طالب العلم للشيخ د. بكر أبو زيد - محمد بن صالح العثيمين ، مؤسسة محمد بن صالح العثيمين ، القصيم ، السعودية ، ط 1 ، 1434 هـ ، 397 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/nbvf3/nbvf3.pdf";

    //--------------------------------------------------------------------------
    title[] = "الحجج القوية على أن وسائل الدعوة توقيفية ، د. عبد السلام بن برجس العبد الكريم";
    texts[] = "الحجج القوية على أن وسائل الدعوة توقيفية ، د. عبد السلام بن برجس العبد الكريم ، دار المنهاج ، 120 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/jjaa2/jjaa2.pdf";

    //--------------------------------------------------------------------------
    title[] = "تغليظ الملام على المتسرعين إلى الفتيا وتغيير الأحكام ، حمود التويجري ، وضرورة الاهتمام بالسنن النبوية ، عبدالسلام بن برجس";
    texts[] = "تغليظ الملام على المتسرعين إلى الفتيا وتغيير الأحكام ، حمود بن عبد الله التويجري ، دار النوادر القيمة ، 1430 هـ / 2009 م ، وضرورة الاهتمام بالسنن النبوية ، عبدالسلام بن برجس ، دارالنوادر القيمة ، ط 2 ، 1426 هـ / 2005 م .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/zad64/zad64.pdf";

    //--------------------------------------------------------------------------
    title[] = "البيان لأخطاء بعض الكتاب (3 مجلدات) - د. صالح الفوزان ";
    texts[] = "البيان لأخطاء بعض الكتاب - د. صالح بن فوزان بن عبد الله الفوزان ، دار ابن الجوزي ، السعودية ، 3 مجلدات (الأول ط 3 ، 1427 هـ ، 360 صفحة) ، (الثاني ط 3 ، 1427 هـ ، 288 صفحة) ، (الثالث ط 1 ، 1429 هـ ، 376 صفحة) .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/frgo8/frgo8.pdf";

    //--------------------------------------------------------------------------
    title[] = "حديث المساء من الدروس والمحاضرات والتعليقات ، عبد العزيز بن عبد الله بن باز ";
    texts[] = "حديث المساء من الدروس والمحاضرات والتعليقات ، عبد العزيز بن عبد الله بن باز ، تحقيق صلاح الدين عثمان أحمد ، مكتبة دار المنهاج ، الرياض ، ط 1 ، 1432 هـ ، 478 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/garyo/garyo.pdf";

    //--------------------------------------------------------------------------
    title[] = "الحياة الزوجية - محمد رشيد رضا";
    texts[] = "الحياة الزوجية - محمد رشيد رضا ، جمعه وعلق عليه خالد بن جمعة بن عثمان الخراز ، مكتبة الإمام الذهبي ، الكويت ، ط 1 ، 1432 هـ / 2011 م ، 107 ص ، 2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1657n/a1657n.pdf";

    title[] = "منهاج (مختارات من كلام الإمامين ابن تيمية وابن القيم رحمهم الله)";
    texts[] = "منهاج (مختارات من كلام الإمامين ابن تيمية وابن القيم رحمهم الله) - المجموعة الأولى (مرتبة ومبوبة مع ذكر المرجع والصفحة) ، عبد الرحمن بن محمد السبهان ، حمد بن عبد الله الجمعان ، إبراهيم بن فريهد العنزي ، وزارة الأوقاف والشؤون الإسلامية ، الكويت ، 237 ص ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1508n/a1508n.pdf";








    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


