//====================================================================================================================
//  كتب التراجم
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[0] = "الشهاب الثاقب في الذب عن الصحابي الجليل ثعلبة بن حاطب - رضي الله عنه - ، سليم الهلالي ، راجعه الألباني";
    texts[0] = "الشهاب الثاقب في الذب عن الصحابي الجليل ثعلبة بن حاطب - رضي الله عنه - ، سليم بن عيد الهلالي ، راجعه محمد ناصر الدين الألباني ، الدار الأثرية ، عمّان ، توزيع دار الوحيين لإحياء التراث الإسلامي ، الأردن ، ط 2 ، 1425 هـ / 2004 م ، 57 صفحة ، 1.2 M .";
    imgs[0] = "./img/tragim/a0.png";
    url[0] = "https://archive.org/download/a642n/a642n.pdf";

    //--------------------------------------------------------------------------
    title[1] = "صفحات مطوية من حياة سلطان العلماء العز بن عبد السلام - سليم الهلالي";
    texts[1] = "صفحات مطوية من حياة سلطان العلماء العز بن عبد السلام - سليم بن عيد الهلالي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1410 هـ / 1990 م ، 122 صفحة ، 2.6 M .";
    imgs[1] = "./img/tragim/a1.png";
    url[1] = "https://archive.org/download/a603n/a603n.pdf";




    //--------------------------------------------------------------------------
    title[2] = "بحوث الندوة العالمية عن شيخ الإسلام ابن تيمية وأعماله الخالدة المنعقدة في الجامعة السلفية ببنارس ـ الهند ، إشراف د. مقتدى حسن الأزهري ، إعداد وترتيب د. عبد الرحمن بن عبد الجبار الفريوائي";
    texts[2] = "بحوث الندوة العالمية عن شيخ الإسلام ابن تيمية وأعماله الخالدة المنعقدة في 18 / 3 و 1 و 2 / 4 / 1408 هـ في الجامعة السلفية ببنارس ـ الهند ، إشراف د. مقتدى حسن الأزهري ، إعداد وترتيب د. عبد الرحمن بن عبد الجبار الفريوائي ، دار الصميعي ، الرياض ، ط 2 ، 1418 هـ / 1997 م ، 462 صفحة .";
    imgs[2] = "./img/tragim/a2.png";
    url[2] = "http://www.archive.org/download/gzww1/gzww1.pdf";



    //--------------------------------------------------------------------------
    title[3] = "حبيبات المصطفى أمهات المؤمنين - فيصل الحاشدي";
    texts[3] = "حبيبات المصطفى أمهات المؤمنين - فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 2015 م ، 192 ص ، 3 M .";
    imgs[3] = "./img/tragim/a3.png";
    url[3] = "https://archive.org/download/a1225n/a1225n.pdf";


    //--------------------------------------------------------------------------
    title[4] = "الإمام الألباني شيخ الإسلام وإمام أهل السنة والجماعة في عيون أعلام العلماء وفحول الأدباء - د. سليم الهلالي";
    texts[4] = "الإمام الألباني شيخ الإسلام وإمام أهل السنة والجماعة في عيون أعلام العلماء وفحول الأدباء - د. سليم بن عيد الهلالي ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1433 هـ / 2012 م ، 344 صفحة ، 6.8 M .";
    imgs[4] = "./img/tragim/a4.png";
    url[4] = "https://archive.org/download/fgxf3/fgxf3.pdf";


    //--------------------------------------------------------------------------
    title[5] = "دعوة الشيخ محمد بن عبد الوهاب بين المعارضين والمنصفين والمؤيدين - محمد بن جميل زينو";
    texts[5] = "دعوة الشيخ محمد بن عبد الوهاب بين المعارضين والمنصفين والمؤيدين - محمد بن جميل زينو ، دار ابن خزيمة ، الرياض ، ط 2 ، 96 صفحة ، 2.4 M .";
    imgs[5] = "./img/tragim/a5.png";
    url[5] = "https://archive.org/download/gvpx5/gvpx5.pdf";


    //--------------------------------------------------------------------------
    title[6] = "الدر الثمين في ترجمة فقيه الأمة العلامة ابن عثيمين رحمه الله تعالى ( ترجمة شاملة لحياة الشيخ من النشأة إلى الوفاة ) ، عصام بن عبد المنعم المري";
    texts[6] = "الدر الثمين في ترجمة فقيه الأمة العلامة ابن عثيمين رحمه الله تعالى ( ترجمة شاملة لحياة الشيخ من النشأة إلى الوفاة ) ، عصام بن عبد المنعم المري ، دار البصيرة ، الإسكندرية / مصر ، 494 صفحة .";
    imgs[6] = "./img/tragim/a6.png";
    url[6] = "http://www.archive.org/download/otyr444/otyr444.pdf";


    //--------------------------------------------------------------------------
    title[7] = "مشاهداتي في المملكة العربية السعودية ، مقبل الوادعي ";
    texts[7] = "مشاهداتي في المملكة العربية السعودية ، مقبل الوادعي ، دار الآثار ، صنعاء / اليمن ، ط 1 ، 1426 هـ / 2005 م ، 32 صفحة .";
    imgs[7] = "./img/tragim/a7.png";
    url[7] = "http://archive.org/download/yhujp/yhujp.pdf";



    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


