//====================================================================================================================
//  كتب التراجم
//====================================================================================================================


export default function () {

    let quran;
    let title = [];
    let texts = [];
    let imgs = [];
    let url = [];
    //=============================================================

    //--------------------------------------------------------------------------
    title[] = "الشهاب الثاقب في الذب عن الصحابي الجليل ثعلبة بن حاطب - رضي الله عنه - ، سليم الهلالي ، راجعه الألباني";
    texts[] = "الشهاب الثاقب في الذب عن الصحابي الجليل ثعلبة بن حاطب - رضي الله عنه - ، سليم بن عيد الهلالي ، راجعه محمد ناصر الدين الألباني ، الدار الأثرية ، عمّان ، توزيع دار الوحيين لإحياء التراث الإسلامي ، الأردن ، ط 2 ، 1425 هـ / 2004 م ، 57 صفحة ، 1.2 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a642n/a642n.pdf";

    //--------------------------------------------------------------------------
    title[] = "صفحات مطوية من حياة سلطان العلماء العز بن عبد السلام - سليم الهلالي";
    texts[] = "صفحات مطوية من حياة سلطان العلماء العز بن عبد السلام - سليم بن عيد الهلالي ، دار ابن الجوزي ، السعودية ، ط 1 ، 1410 هـ / 1990 م ، 122 صفحة ، 2.6 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a603n/a603n.pdf";

    //--------------------------------------------------------------------------
    title[] = "بلدة طيبة (فضائل اليمن وأهلها في الكتاب والسنة) - فيصل الحاشدي";
    texts[] = "بلدة طيبة (فضائل اليمن وأهلها في الكتاب والسنة) - فيصل بن عبده بن قائد الحاشدي ، تقديم محمد بن عبد الله الإمام ، مكتبة الإمام الألباني ، صنعاء ، ط 1 ، 1431 هـ / 2010 م ، 144 صفحة ، 4.8 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/gtvx3/gtvx3.pdf";


    //--------------------------------------------------------------------------
    title[] = "حبيبات المصطفى أمهات المؤمنين - فيصل الحاشدي";
    texts[] = "حبيبات المصطفى أمهات المؤمنين - فيصل بن عبده قائد الحاشدي ، دار القمة ، الإسكندرية ، دار الإيمان ، الإسكندرية ، 2015 م ، 192 ص ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1225n/a1225n.pdf";


    //--------------------------------------------------------------------------
    title[] = "الإمام الألباني شيخ الإسلام وإمام أهل السنة والجماعة في عيون أعلام العلماء وفحول الأدباء - د. سليم الهلالي";
    texts[] = "الإمام الألباني شيخ الإسلام وإمام أهل السنة والجماعة في عيون أعلام العلماء وفحول الأدباء - د. سليم بن عيد الهلالي ، دار الإمام أحمد ، القاهرة ، ط 1 ، 1433 هـ / 2012 م ، 344 صفحة ، 6.8 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/fgxf3/fgxf3.pdf";


    //--------------------------------------------------------------------------
    title[] = "دعوة الشيخ محمد بن عبد الوهاب بين المعارضين والمنصفين والمؤيدين - محمد بن جميل زينو";
    texts[] = "دعوة الشيخ محمد بن عبد الوهاب بين المعارضين والمنصفين والمؤيدين - محمد بن جميل زينو ، دار ابن خزيمة ، الرياض ، ط 2 ، 96 صفحة ، 2.4 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/gvpx5/gvpx5.pdf";


    //--------------------------------------------------------------------------
    title[] = "الدر الثمين في ترجمة فقيه الأمة العلامة ابن عثيمين رحمه الله تعالى ( ترجمة شاملة لحياة الشيخ من النشأة إلى الوفاة ) ، عصام بن عبد المنعم المري";
    texts[] = "الدر الثمين في ترجمة فقيه الأمة العلامة ابن عثيمين رحمه الله تعالى ( ترجمة شاملة لحياة الشيخ من النشأة إلى الوفاة ) ، عصام بن عبد المنعم المري ، دار البصيرة ، الإسكندرية / مصر ، 494 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/otyr444/otyr444.pdf";


    //--------------------------------------------------------------------------
    title[] = "مشاهداتي في المملكة العربية السعودية ، مقبل الوادعي ";
    texts[] = "مشاهداتي في المملكة العربية السعودية ، مقبل الوادعي ، دار الآثار ، صنعاء / اليمن ، ط 1 ، 1426 هـ / 2005 م ، 32 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://archive.org/download/yhujp/yhujp.pdf";



    //--------------------------------------------------------------------------
    title[] = "بحوث الندوة العالمية عن شيخ الإسلام ابن تيمية وأعماله الخالدة المنعقدة في الجامعة السلفية ببنارس ـ الهند ، إشراف د. مقتدى حسن الأزهري ، إعداد وترتيب د. عبد الرحمن بن عبد الجبار الفريوائي";
    texts[] = "بحوث الندوة العالمية عن شيخ الإسلام ابن تيمية وأعماله الخالدة المنعقدة في 18 / 3 و 1 و 2 / 4 / 1408 هـ في الجامعة السلفية ببنارس ـ الهند ، إشراف د. مقتدى حسن الأزهري ، إعداد وترتيب د. عبد الرحمن بن عبد الجبار الفريوائي ، دار الصميعي ، الرياض ، ط 2 ، 1418 هـ / 1997 م ، 462 صفحة .";
    imgs[] = "/img/figh/a.png";
    url[] = "http://www.archive.org/download/gzww1/gzww1.pdf";


    //--------------------------------------------------------------------------
    title[] = "مواقف اجتماعية من حياة الشيخ العلامة عبد الرحمن بن ناصر السعدي - محمد بن عبد الرحمن السعدي ومساعد بن عبد الله السعدي";
    texts[] = "مواقف اجتماعية من حياة الشيخ العلامة عبد الرحمن بن ناصر السعدي - محمد بن عبد الرحمن بن ناصر السعدي ومساعد بن عبد الله بن سليمان السعدي ، دار الميمان ، الرياض ، ط 2 ، 1428 هـ / 2007 م ، 224 ص ، 3 M .";
    imgs[] = "/img/figh/a.png";
    url[] = "https://archive.org/download/a1354n/a1354n.pdf";

    //=============================================================
    let q = {
        title: title,
        texts: texts,
        imgs: imgs,
        url: url
    };
    return q;
};


